{"https://www.youtube.com/watch?v=1cXrNxjCLYg": {"title": "10 Natural Remedies That Actually Work", "content creator": "Doctor Mike", "description": "I’ve come on this channel and debunked “natural remedies” and “at home treatments” for various health problems more times than I can even remember. Considering how critical I’ve been of these naturopathic treatments, you might be surprised to learn that while most of them a myths, there are a handful of natural treatments that you can actually use to treat some mild health conditions. Honey for a cough, melatonin for sleep, saline nasal sprays to clear your sinuses while you have a cold, sugar for hiccups, oatmeal to treat eczema, aloe vera for sunburns, prunes for constipation, calamine for itches and burns, probiotics, and even duct tape to fight warts. Of course, don’t get me started on soda for fighting an upset stomach! Have you tried any of these? Let me know down in the comments!\n\nI LOVE reading your comments and take your suggestions seriously. If there’s a subject you want me to discuss or something you’d like for me to react to, leave a comment down below. Many of my videos have been born out of suggestions directly from you, so don’t hold back!\n-Doctor Mike Varshavski\n\nHelp us continue the fight against medical misinformation and change the world through charity by becoming a Doctor Mike Resident on Patreon where every month I donate 100% of the proceeds to the charity, organization, or cause of your choice! Residents get access to bonus content, an exclusive discord community, and many other perks for just $10 a month. Become a Resident today:", "date": "Sep 1, 2021", "views": "4,576,738 views", "comments": "8,496", "likes": "150,432 likes", "dislikes": " Unavailable", "video_length": 505.821, "url": "https://www.youtube.com/watch?v=1cXrNxjCLYg"}, "https://www.youtube.com/watch?v=xuzYaWpK2Cw": {"title": "REAGINDO A MINHA ÉPOCA DE REPÓRTER!", "content creator": "República Coisa de Nerd", "description": "Leon e Nilce assistem vídeos engraçados e também a vídeos de quando a Nilce era repórter! \n\nInscreva-se! Vai ter bolo!\nCoisa de Nerd: ", "date": "Jan 3, 2022", "views": "1,189,536 views", "comments": "1,171", "likes": "116,731 likes", "dislikes": " Unavailable", "video_length": 765.681, "url": "https://www.youtube.com/watch?v=xuzYaWpK2Cw"}, "https://www.youtube.com/watch?v=0jltioeaEyY": {"title": "Forensics Expert Explains How to Analyze Bloodstain Patterns | WIRED", "content creator": "WIRED", "description": "Crime scene analyst Matthew Steiner teaches the techniques forensics experts use to investigate bloodstain patterns, ranging from easy to difficult. Matthew explains how different types of forces create different bloodstain patterns in the crime scenes, and demonstrates how they can analyze these patterns to figure out how a crime was committed. \n\nStill haven’t subscribed to WIRED on YouTube? ►► ", "date": "Jan 30, 2020", "views": "12,369,550 views", "comments": "14,727", "likes": "372,323 likes", "dislikes": " Unavailable", "video_length": 1027.421, "url": "https://www.youtube.com/watch?v=0jltioeaEyY"}, "https://www.youtube.com/watch?v=OCC_oTmjfNM": {"title": "10 Things Jocko Willink Can't Live Without - 10 Things Jocko Uses on a Daily Basis", "content creator": "Jocko Podcast", "description": "10 Things Jocko Willink uses sometimes kinda all the time.\nUnderground Premium Content: https://www.jockounderground.com/subs...\nJoin the conversation on Twitter/Instagram: @jockowillink @echocharles", "date": "Feb 4, 2021", "views": "2,265,702 views", "comments": "5,414", "likes": "73,514 likes", "dislikes": " Unavailable", "video_length": 803.321, "url": "https://www.youtube.com/watch?v=OCC_oTmjfNM"}, "https://www.youtube.com/watch?v=iDcOrd_fJzw": {"title": "Trying Korean, Russian, and American MREs", "content creator": "Markiplier", "description": "An MRE is a portable meal for soldiers. It's not known to be very good... so I decided to try different MREs from America, Russia, and Korea to see which one was the best (and worst) food.\nMORE Reviews ► https://www.youtube.com/playlist?list...", "date": "Dec 27, 2020", "views": "15,013,617 views", "comments": "72,201", "likes": "927,267 likes", "dislikes": " Unavailable", "video_length": 1644.341, "url": "https://www.youtube.com/watch?v=iDcOrd_fJzw"}, "https://www.youtube.com/watch?v=LnOvXc-moL8": {"title": "Irish Apocalypse in Wexford! Flash floods in many counties.", "content creator": "NDNews Weather", "description": "#NDNews: Natural disasters news every day. Disaster December 25-26. Live news live about bad weather. Earth's pain will cleanse the Planet from the humanity. In the world in a day about severe nature. Catastrophes are here and now. Global warming is not far off.\n-------------------------------------------------------------------------\nIrish apocalypse in Wexford! Flash floods in many counties.\n\nParts of Ireland have been hit by flash flooding due to overflowing rivers. Several people had to be rescued and dozens of houses were evacuated after extensive flooding hit  Wexford. Among the areas worst affected was Bridgetown.  Large parts of the village were completely submerged. A number of bridges also collapsed as some roads became washed away by the deluge. The Rescue helicopter helped people trapped by flood water in Enniscorthy.\n\nMeanwhile, the village of Blackwater was also absolutely devastated by rising tides. Several roads remain impassable, with a bridge at Wilton Bree collapsed and another at Kilcarbry, Enniscorthy severely damaged. There was a yellow warning at Wexford, as well as Carlow, Kilkenny, Wicklow and Waterford counties.\n-------------------------------------------------------------------------\nThe channel lists such natural disasters as:\n1) Geological emergencies: Earthquake, volcanic eruption, mudflow, landslide, landfall, avalanche;\n2) Hydrological emergencies:  Flood, Tsunami, Limnological catastrophe, floods, flooding;\n3) Fires: Forest fire, Peat fire, Glass Fire, Wildfire;\n4) Meteorological emergencies: Tornado, Cyclone, Blizzard, Hail, Drought, Hail, Hurricane, Storm, Thunderstorm, typhoon, Tempest, Lightning.\n\nPlaylist by region, EUROPE:", "date": "Dec 26, 2021", "views": "501,881 views", "comments": "557", "likes": "4,767 likes", "dislikes": " Unavailable", "video_length": 122.021, "url": "https://www.youtube.com/watch?v=LnOvXc-moL8"}, "https://www.youtube.com/watch?v=1J1zAnA2Wds": {"title": "Hidden cameras expose Kim Jong-un's clandestine weapon and drugs trade | 60 Minutes Australia", "content creator": "60 Minutes Australia", "description": "Subscribe here: http://9Soci.al/chmP50wA97J Full Episodes: https://9now.app.link/uNP4qBkmN6 | Rogue One (2021)\n\nLike a petulant child who doesn’t get its way, North Korea likes to throw tantrums. A few days ago the rogue state reminded the world how troublesome it is by launching several short-range missiles in the first weapons tests since President Joe Biden took office, sending a sharp message to the new US administration. But behind the aggression, dictator Kim Jong-un is in serious trouble as his regime teeters on bankruptcy. Tom Steinfort, one of the few western journalists to have reported from the hermit kingdom on multiple occasions, says North Korea desperately needs cash and is willing to do almost anything to get it, even selling weapons and drugs on the black market. Now though, these long-suspected crimes have been fully exposed by the unlikely combination of an extraordinary hidden-camera sting and a heartbroken family determined to get justice for their son, who travelled to North Korea for an adventure holiday but ended up imprisoned and tortured to death.\n\nWATCH more of 60 Minutes Australia: ", "date": "Mar 29, 2021", "views": "7,246,815 views", "comments": "Error found: Message: \nStacktrace:\n#0 0x55ab4f53aa23 <unknown>\n#1 0x55ab4f005e18 <unknown>\n#2 0x55ab4f03c151 <unknown>\n#3 0x55ab4f03c311 <unknown>\n#4 0x55ab4f06eec4 <unknown>\n#5 0x55ab4f0599bd <unknown>\n#6 0x55ab4f06cc5b <unknown>\n#7 0x55ab4f059883 <unknown>\n#8 0x55ab4f02f3fa <unknown>\n#9 0x55ab4f0304c5 <unknown>\n#10 0x55ab4f56a16d <unknown>\n#11 0x55ab4f5805bb <unknown>\n#12 0x55ab4f56be75 <unknown>\n#13 0x55ab4f580e85 <unknown>\n#14 0x55ab4f55f86f <unknown>\n#15 0x55ab4f59bae8 <unknown>\n#16 0x55ab4f59bc68 <unknown>\n#17 0x55ab4f5b6aad <unknown>\n#18 0x7f645da356db <unknown>\n", "likes": "85,523 likes", "dislikes": " Unavailable", "video_length": 1883.101, "url": "https://www.youtube.com/watch?v=1J1zAnA2Wds"}, "https://www.youtube.com/watch?v=8JKkudn0F8o": {"title": "Black Rose | Full Action Movie", "content creator": "Mediatime Network", "description": "Black Rose (2014). Full action movie.\n\nSYNOPSIS\nA Russian Police Major is enlisted by the LAPD to help solve a series of gruesome murders perpetrated against young women by a sadistic sociopathic killer on the mean streets of Hollywood.\n\nDirector: Alexander Nevsky\nCast: Alexander Nevsky, Kristanna Loken, Adrian Paul", "date": "Jan 5, 2022", "views": "490,112 views", "comments": "71", "likes": "1,934 likes", "dislikes": " Unavailable", "video_length": 4993.101, "url": "https://www.youtube.com/watch?v=8JKkudn0F8o"}, "https://www.youtube.com/watch?v=MBBQ-3nsLhA": {"title": "Elon Musk & NASA's Terrifying NEW Discovery on Neptune Changes Everything!", "content creator": "Tech Space", "description": "The National Aeronautics and Space Administration is one of the most iconic agencies\nin the US. It has been responsible for many of American finer moments with its research\nand achievements. With one of the biggest budgets for any agency in the US, NASA is\nequipped to fund many high-power investigations! However, by teaming up with Elon\nMusk, NASA has unlocked many more opportunities! The latest example is the\ndiscovery on planet Neptune! What has Musk and NASA discovered on Neptune, and\nhow does it affect you? Join us to explore Elon Musk and NASA's insane new discovery\non Neptune that changes everything!\nWhat is the longest distance you have ever traveled? If you had moved from one\ncontinent to another, most probably in an aircraft, you could have covered thousands of\nmiles! That is child's play compared with Voyager 2's journey! Moving in the opposite\ndirection to its twin, the Voyager 1, the spacecraft reached planet Neptune in 1989, 12\nyears after it took off from Earth! It was, and still is, on a journey through the solar\nsystem! What it discovered on Neptune was mind blowing! The spacecraft beamed the\nfirst images of the planet's rings, but there was another discovery; a massive and violent\nstorm!\nNASA scientists were not expecting the storm Voyager 2 sent the pictures of! It was\nspotted in the southern hemisphere, appearing as a counter-clockwise wind of up to\n1,500 miles per hour or 2,414 kilometers per hour! It was the strongest ever recorded!\nAstronomers called it the Great Dark Spot. Five years later, it had gone by the time the\nHubble Space Telescope looked at the planet. This led to lots of questions about why\nthe winds were so strong!\nThe strong wind, however, was not the only thing puzzling scientists about Neptune! Its\ntemperature was also a mystery. Voyager 2 revealed that Neptune is warmer than\nUranus, despite being farther from the sun. The conventional wisdom was that the\nfarther you go from the sun in the galaxy, the colder it became! Yet Neptune had more\nheat than Uranus! The question is, where is the heat on Neptune coming from? As\nphysicist Brian Cox discussed in his BBC documentary, The Planets: \"The source of this\nextra heat remains a mystery.\" However, the bigger puzzle was whether the two usual\nbehaviors, that is, the strong wind and the elevated temperature, were in any way tied!\nSome scientists even speculated that unraveling one mystery would explain the other!\nBut how would this be achieved?\nMeasuring Neptune's temperature, however, is not so straightforward! For example, on\nEarth, you can take measurements on the solid surface and calculate the global\naverage. That is not possible on Mars, which is made up of gases. So if you must take a\ntemperature of Neptune, it has to be at an altitude. This is where you need to make\nanother decision; at what altitude will you take the measurement?\nThere is something else about the temperature measurement taken by the Voyager 2!\nObviously, it took the temperature from the outermost layer. At that point, the\ntemperature of Neptune is not so much higher than that of Uranus. But since Neptune\nreceives less solar illumination because it's farther from the sun, this shouldn't be the\ncase.\nWhat this similarity in temperature suggests is that Neptune is warmer in terms of how\nmuch heat it emits in comparison to the amount of heat it absorbs from the sun.\nAccording to Anthony Del Genio of the NASA Goddard Institute for Space Studies,\n\"Voyager's measurements show Neptune emits more than twice as much heat as it\nabsorbs from the sun, while Uranus does not.\"\nThis doesn't make Neptune unusual, though. In fact, it makes Uranus weird because\nother planets like Jupiter and Saturn also emit more heat than they absorb from the sun!\nAs stated earlier, the progression of temperature as you go farther away from the sun\nshows Jupiter to be the warmest of the gas giants, Saturn next, then Neptune. Uranus is\nthe one that is out of place. Del Genio explained the oddity further: \"Yet that unusual\nresult is associated with the fact that Uranus does not have a significant internal heat\nsource.\" In other words, Neptune is finding a way to warm itself up to the level of\nUranus, while the latter is unable to generate any extra heat other than that gleaned\nfrom the sun!\nBut just what is an internal heat source? In simple terms, it is heat left over from the\nbirth of the solar system when these planets were formed. The heat contracts out of the\nprimitive solar nebula, forming an effect known as the Kelvin-Helmholtz contraction.\nThe extra heat source on Neptune, Jupiter, and Saturn is primarily due to gravitational\ncontraction. As the planet slowly gravitationally contracts, the material falling inward\nchanges its potential energy into thermal energy, which is then released upwards out of\nthe planet. For Uranus not to have such a heat source, something must have happened\nto it! So, the question is, why does Neptune produce heat internally, but Uranus does\nnot?", "date": "Jan 13, 2022", "views": "2,733,633 views", "comments": "94", "likes": "27,979 likes", "dislikes": " Unavailable", "video_length": 650.261, "url": "https://www.youtube.com/watch?v=MBBQ-3nsLhA"}, "https://www.youtube.com/watch?v=BKS0kFRjwLI": {"title": "Former enemies playing each other's anthem - part 2", "content creator": "Musicarnia", "description": "00:00  national anthem of France played by UK army band\n00:42  national anthem of Germany played by UK army band\n01:53  national anthem of Soviet Union played by Germany army band", "date": "Jan 9, 2022", "views": "144,668 views", "comments": "512", "likes": "3,609 likes", "dislikes": " Unavailable", "video_length": 623.181, "url": "https://www.youtube.com/watch?v=BKS0kFRjwLI"}, "https://www.youtube.com/watch?v=R9FrL6wAuQQ": {"title": "FOX and Friends 1/16/22 | BREAKING FOX NEWS January 16, 2022", "content creator": "Pitbull TV", "description": "FOX and Friends 1/16/22\nTelegram trump : https://t.me/donaltrump2021\nLike and Folow Page \nThank all For watching…!\n▶▶ Watch more Fox News Video:\n👉🏻 5AM: Fox and Friends\n👉🏻 9AM: America's Newsroom\n👉🏻 11AM: The Faulkner Focus\n👉🏻 12PM: Outnumbered\n👉🏻 1PM: America Reports\n👉🏻 3PM: The Story Martha MacCallum\n👉🏻 4PM: Your World With Neil Cavuto\n👉🏻 5PM: The Five\n👉🏻 6PM: Special Report With Bret Baier\n👉🏻 7PM: Fox News Primetime\n👉🏻 8PM: Tucker Carlson Tonight\n👉🏻 9PM: Sean Hannity\n👉🏻 10PM: The Ingraham Angle\n👉🏻 11PM: Gutfeld!", "date": "Premiered Jan 16, 2022", "views": "211,253 views", "comments": "766", "likes": "2,451 likes", "dislikes": " Unavailable", "video_length": 5.241, "url": "https://www.youtube.com/watch?v=R9FrL6wAuQQ"}, "https://www.youtube.com/watch?v=bYoHjiqRgsk": {"title": "Kevin Hart Loses It Over Jodie Whittaker’s Poisonous Spider Story | The Graham Norton Show", "content creator": "The Graham Norton Show", "description": "That sounds terrifying! ", "date": "Dec 6, 2019", "views": "4,986,865 views", "comments": "1,388", "likes": "66,172 likes", "dislikes": " Unavailable", "video_length": 190.981, "url": "https://www.youtube.com/watch?v=bYoHjiqRgsk"}, "https://www.youtube.com/watch?v=vCcmFnVYtco": {"title": "Top 10 Costco Finds For 2022 - Shop With Me", "content creator": "FlavCity with Bobby Parrish", "description": "Join Thrive Market & get 40% off your 1st order & a FREE gift: http://thrivemarket.com/Bobby\n\nHere are the best items to buy at Costco in 2022. Costco is loaded with so many top quality Bobby Approved items at unbeatable prices!", "date": "Dec 29, 2021", "views": "554,400 views", "comments": "979", "likes": "16,844 likes", "dislikes": " Unavailable", "video_length": 1264.021, "url": "https://www.youtube.com/watch?v=vCcmFnVYtco"}, "https://www.youtube.com/watch?v=vVsXO9brK7M": {"title": "How to know your life purpose in 5 minutes | Adam Leipzig | TEDxMalibu", "content creator": "TEDx Talks", "description": "Never miss a talk! SUBSCRIBE to the TEDx channel: http://bit.ly/1FAg8hB\n\nAdam Leipzig has overseen more than 25 movies as a producer, executive and distributor. and has produced more than 300 stage plays and live events, and he was one of the founders of the Los Angeles Theatre Center.\nAdamLeipzig.com\n\nIn the spirit of ideas worth spreading, TEDx is a program of local, self-organized events that bring people together to share a TED-like experience. At a TEDx event, TEDTalks video and live speakers combine to spark deep discussion and connection in a small group. These local, self-organized events are branded TEDx, where x = independently organized TED event. The TED Conference provides general guidance for the TEDx program, but individual TEDx events are self-organized.* (*Subject to certain rules and regulations)", "date": "Feb 1, 2013", "views": "17,036,094 views", "comments": "13,297", "likes": "193,292 likes", "dislikes": " Unavailable", "video_length": 633.001, "url": "https://www.youtube.com/watch?v=vVsXO9brK7M"}, "https://www.youtube.com/watch?v=u8CEGyx425s": {"title": "Press Preview: A first look inside Sunday's newspapers", "content creator": "Sky News", "description": "A look at Sunday's headlines with journalist and author, Christina Patterson and director of communications at the Institute of Economic Affairs, Annabel Denham. \n\nSUBSCRIBE to our YouTube channel for more videos: ", "date": "Jan 15, 2022", "views": "19,983 views", "comments": "84", "likes": "140 likes", "dislikes": " Unavailable", "video_length": 785, "url": "https://www.youtube.com/watch?v=u8CEGyx425s"}, "https://www.youtube.com/watch?v=9Lhbm87KmOc": {"title": "", "content creator": "First We Feast", "description": "", "date": "", "views": "", "comments": "13,899", "likes": "165,377 likes", "dislikes": " Unavailable", "video_length": 1589.741, "url": "https://www.youtube.com/watch?v=9Lhbm87KmOc"}, "https://www.youtube.com/watch?v=9VM1UA0pCMQ": {"title": "The BEST relationship advice EVER - Jordan Peterson", "content creator": "Gravitahn", "description": "Professor Jordan Peterson has been in the news a LOT recently, as a staunch defender of free speech, and fiery critic of the increasingly censorious culture we live in. I thought people might enjoy seeing a very different side of him. I encourage everyone to check out the full Maps of Meaning course. It's pretty amazing.\n\nSubscribe to my channel for more great content: ", "date": "Nov 23, 2016", "views": "2,743,853 views", "comments": "1,850", "likes": "71,297 likes", "dislikes": " Unavailable", "video_length": 650.901, "url": "https://www.youtube.com/watch?v=9VM1UA0pCMQ"}, "https://www.youtube.com/watch?v=0OK80eljWrs": {"title": "Keanu Reeves and Carrie-Anne Moss on making The Matrix Awakens with Epic Games", "content creator": "The Verge", "description": "Epic Games made an interactive Matrix experience to show off its upcoming Unreal Engine 5. We sat down with the two stars of the demo and the Matrix movies, Keanu Reeves and Carrie-Ann Moss, to talk about how technology is blurring the line between what’s real and virtual, what to expect from the new Matrix Resurrections movie, and a lot more.", "date": "Dec 9, 2021", "views": "2,841,750 views", "comments": "5,124", "likes": "58,389 likes", "dislikes": " Unavailable", "video_length": 1135.201, "url": "https://www.youtube.com/watch?v=0OK80eljWrs"}, "https://www.youtube.com/watch?v=nBD-4ZDWJr8": {"title": "8 HOURS Gentle Rain at Night, Rain, Raining. Soothing Rain for Sleep, Noise Block,Headaches, Study,", "content creator": "The Relaxed Guy", "description": "Night Rain 8 HOURS of the most Beautiful Soft Rain (No Music or Thunder). One of the Very Best Rain Videos to Sleep, Relax, Study, Get Baby to Sleep. Don't forget to share with Family and Friends as they might find it useful too. Enjoy the Rain...\n\n🌎 Brunswick Heads, Australia\n\n 🌿 SUBSCRIBE & CLICK 🔔 - ", "date": "Aug 14, 2017", "views": "5,044,713 views", "comments": "806", "likes": "26,759 likes", "dislikes": " Unavailable", "video_length": 28855.881, "url": "https://www.youtube.com/watch?v=nBD-4ZDWJr8"}, "https://www.youtube.com/watch?v=4mcGl3gjvsQ": {"title": "How To Chainsaw Like a Boss. This Could Save Your Life.", "content creator": "FarmCraft101", "description": "Save 40% or more on your SimpliSafe security system during their holiday sale. Visit https://SimpliSafe.com/farmcraft to learn more!\n\nChainsaw tips, tricks, and techniques every saw owner should know!  This video builds on my previous chainsaw videos that are listed below: No nonsense guide to tree felling, and No nonsense guide to chainsaw sharpening.\n\nFull Chainsawing playlist:", "date": "Dec 11, 2021", "views": "740,233 views", "comments": "959", "likes": "12,702 likes", "dislikes": " Unavailable", "video_length": 2692.641, "url": "https://www.youtube.com/watch?v=4mcGl3gjvsQ"}, "https://www.youtube.com/watch?v=h1o4BAyd7GU": {"title": "Victor Davis Hanson | Nationalism Good and Bad: Lessons from History", "content creator": "Hillsdale College", "description": "Victor Davis Hanson spoke on October 2, 2019 during the 175th anniversary celebration.\n\nVictor Davis Hanson, the Wayne and Marcia Buske Distinguished Fellow in History at Hillsdale College, is also a senior fellow at the Hoover Institution and a professor of classics emeritus at California State University, Fresno.\n\nDr. Hanson earned his B.A. at the University of California, Santa Cruz, and his Ph.D. in classics from Stanford University. In 2007, he was awarded the National Humanities Medal, and in 2008, he received the Bradley Prize.\n\nHe is a columnist for National Review Online and for Tribune Media Services, and has published in several journals and newspapers, including Commentary, the Claremont Review of Books, The New Criterion, the New York Times, and the Wall Street Journal. Dr. Hanson has written or edited numerous books, including Wars of the Ancient Greeks, A War Like No Other: How the Athenians and Spartans Fought the Peloponnesian War, and his latest book, The Second World Wars: How the First Global Conflict Was Fought and Won.\n\nHillsdale College is an independent institution of higher learning founded in 1844 by men and women “grateful to God for the inestimable blessings” resulting from civil and religious liberty and “believing that the diffusion of learning is essential to the perpetuity of these blessings.” It pursues the stated object of the founders: “to furnish all persons who wish, irrespective of nation, color, or sex, a literary, scientific, [and] theological education” outstanding among American colleges “and to combine with this such moral and social instruction as will best develop the minds and improve the hearts of its pupils.” As a nonsectarian Christian institution, Hillsdale College maintains “by precept and example” the immemorial teachings and practices of the Christian faith.\n\nThe College also considers itself a trustee of our Western philosophical and theological inheritance tracing to Athens and Jerusalem, a heritage finding its clearest expression in the American experiment of self-government under law.\n\nBy training the young in the liberal arts, Hillsdale College prepares students to become leaders worthy of that legacy. By encouraging the scholarship of its faculty, it contributes to the preservation of that legacy for future generations. By publicly defending that legacy, it enlists the aid of other friends of free civilization and thus secures the conditions of its own survival and independence.", "date": "Oct 12, 2019", "views": "539,033 views", "comments": "1,220", "likes": "10,948 likes", "dislikes": " Unavailable", "video_length": 3585.681, "url": "https://www.youtube.com/watch?v=h1o4BAyd7GU"}, "https://www.youtube.com/watch?v=jUlbpfkm7n0": {"title": "Janet Daley: Like Mccarthyism, America will soon wake up to wokeism | Off Script", "content creator": "The Telegraph", "description": "Do not be fooled by the dominance of the woke movement; it is already running out of steam. In this week’s Off Script Janet Daley joins Steven Edginton to discuss America and Britain: what divides the two nations and what unites them. Watch the full video above or listen on your podcast app searching “Off Script”. \n\nRead more: ", "date": "Oct 22, 2021", "views": "133,071 views", "comments": "1,007", "likes": "2,755 likes", "dislikes": " Unavailable", "video_length": 3500.321, "url": "https://www.youtube.com/watch?v=jUlbpfkm7n0"}, "https://www.youtube.com/watch?v=BOrcgdsQ_uc": {"title": "Facts about Mountain People Never Taught in School | Thomas Sowell", "content creator": "Thomas SowellTV", "description": "https://thomassowelltv.myspreadshop.c...\nVisit Our Shop: https://www.spreadshirt.com/shop/user...", "date": "Jan 12, 2022", "views": "126,498 views", "comments": "328", "likes": "4,838 likes", "dislikes": " Unavailable", "video_length": 418.081, "url": "https://www.youtube.com/watch?v=BOrcgdsQ_uc"}, "https://www.youtube.com/watch?v=7MeolzCkoQ4": {"title": "Surviving the Night - Camping in -30° Weather", "content creator": "Kusk Bushcraft", "description": "Cold weather offers the best camping!\nOn this trip I tested my skills seeing if I could sleep in an open shelter in -30 degree temperatures. Alongside the challenge of sleeping in such cold conditions, I also cooked up some tasty meals that are quick and easy to prepare.\n\nThe gear I used:\n\nSleep mat: 1/2\" closed-cell foam sleep pad.\nBlankets: Two queen sized wool blankets.\nClothing: Cotton base layer, wool insulating layer, and waxed cotton pants and jacket outer layer.\nBoots: Sorel Pac Boots\nBackpack: Kelty Redwing 44\nCook Kit: Woods Nootka Cook Set\n\nHow did I not freeze?\nThis was actually one of the warmest camps I've ever had. I didn't get cold once. I layed wood on my fire in a particular way to create a \"wall\" of fire which kept me very warm. It was so warm I had to strip down to my base layer to sleep comfortably.\n\nAn open shelter? Aren't you afraid of animals?\nThe open shelter is very pleasant to sleep in. I do not worry about wildlife. In this area there are grizzly bears, black bears, wolves, and cougars. The bears are sleeping the winter away, so they aren't likely to be a problem. Wolves and cougars in this area are quite timid towards humans and usually won't bother us. Fun fact though, on my hike out from this camp I came across fresh tracks from a pack of wolves about 200 yards away from my camp. It looked like they were just travelling through the area though. Pretty cool to see.\n\nThank you so much to everyone who watches and supports the channel. I hope everyone enjoys. Happy trails!", "date": "Dec 21, 2021", "views": "731,623 views", "comments": "1,113", "likes": "11,884 likes", "dislikes": " Unavailable", "video_length": 966.261, "url": "https://www.youtube.com/watch?v=7MeolzCkoQ4"}, "https://www.youtube.com/watch?v=OC94iAUXVPQ": {"title": "Victor Davis Hanson: World War Two-Then and Now (May 2, 2018)", "content creator": "Benson Center", "description": "Presented at CU Boulder on May 2, 2018\n\nThe Visiting Scholar in Conservative Thought and Policy presents:\n\nVictor Davis Hanson: World War Two-Then and Now\nWorld War II was the most lethal conflict in human history. Never before had a war been fought on so many diverse landscapes and in so many different ways, from rocket attacks in London to jungle fighting in Burma to armor strikes in Libya.\nDrawing on 3,000 years of military history, Victor Davis Hanson argues that despite its novel industrial barbarity, neither the war's origins nor its geography were unusual. Nor was its ultimate outcome surprising. The Axis powers were well prepared to win limited border conflicts, but once they blundered into global war, they had no hope of victory.\n\n05/02/18", "date": "May 7, 2018", "views": "466,819 views", "comments": "Error found: Message: \nStacktrace:\n#0 0x55e9201b8a23 <unknown>\n#1 0x55e91fc83e18 <unknown>\n#2 0x55e91fcba151 <unknown>\n#3 0x55e91fcba311 <unknown>\n#4 0x55e91fcecec4 <unknown>\n#5 0x55e91fcd79bd <unknown>\n#6 0x55e91fceac5b <unknown>\n#7 0x55e91fcd7883 <unknown>\n#8 0x55e91fcad3fa <unknown>\n#9 0x55e91fcae4c5 <unknown>\n#10 0x55e9201e816d <unknown>\n#11 0x55e9201fe5bb <unknown>\n#12 0x55e9201e9e75 <unknown>\n#13 0x55e9201fee85 <unknown>\n#14 0x55e9201dd86f <unknown>\n#15 0x55e920219ae8 <unknown>\n#16 0x55e920219c68 <unknown>\n#17 0x55e920234aad <unknown>\n#18 0x7f87002106db <unknown>\n", "likes": "4,602 likes", "dislikes": " Unavailable", "video_length": 4799.661, "url": "https://www.youtube.com/watch?v=OC94iAUXVPQ"}, "https://www.youtube.com/watch?v=p0VA-btO43Y": {"title": "sonic screaming for no reason", "content creator": "Sonic Central", "description": "the scream heard from around world.\n#sonic #sonicadventure #sonicthehedgehog", "date": "Nov 2, 2021", "views": "661,564 views", "comments": "869", "likes": "16,888 likes", "dislikes": " Unavailable", "video_length": 4.021, "url": "https://www.youtube.com/watch?v=p0VA-btO43Y"}, "https://www.youtube.com/watch?v=sNH2cQAs57o": {"title": "Opposée à l’obligation vaccinale, une orthophoniste cesse le travail", "content creator": "RT France", "description": "RT France est allé à la rencontre des Français au sujet du pass sanitaire. Sur le terrain, l’application du pass sanitaire pour ceux qui n’ont pas voulu se faire vacciner tourne au casse-tête. Certains sont même contraints d'arrêter leur activité et ils ne comprennent pas pourquoi on ne leur permet pas d’emprunter une autre voix.", "date": "Oct 20, 2021", "views": "99,125 views", "comments": "550", "likes": "3,985 likes", "dislikes": " Unavailable", "video_length": 278.461, "url": "https://www.youtube.com/watch?v=sNH2cQAs57o"}, "https://www.youtube.com/watch?v=dbXBhi_kGZk": {"title": "Undercover Boss parody - Palmashow", "content creator": "Palmashow", "description": "Subscrire to the channel :  https://bit.ly/2TfoZUE\n\nWatch again all \"Very Bad Jokes\" episodes! https://bit.ly/2ENfeUN", "date": "Mar 8, 2019", "views": "9,788,789 views", "comments": "2,800", "likes": "193,762 likes", "dislikes": " Unavailable", "video_length": 328.901, "url": "https://www.youtube.com/watch?v=dbXBhi_kGZk"}, "https://www.youtube.com/watch?v=I7JBAcxreBw": {"title": "Fastest Worker - Okonomiyaki Master’s Amazing Skill - Japanese Street Food", "content creator": "MOGUMOGU - Food Entertainment - モグモグ", "description": "Small Okonomiyaki (Cabbage Grill)\n\nℹ️25 years old small Okonomiyaki (\"KYABETSU YAKI\") shop.\nMaster's professional skills are a must-see. He said that he had baked it about 3000 pieces a day on a busy day.\n\nWebsite: ", "date": "May 13, 2021", "views": "50,778,897 views", "comments": "8,382", "likes": "124,926 likes", "dislikes": " Unavailable", "video_length": 605.321, "url": "https://www.youtube.com/watch?v=I7JBAcxreBw"}, "https://www.youtube.com/watch?v=vF4g2RoEN4Y": {"title": "Watch Me React To My First YouTube Vids", "content creator": "Zendaya", "description": "Visit Zendaya's site for more: https://goo.gl/f7xDPT\n\nSubscribe for new clips from Zendaya: https://goo.gl/sDxfW5", "date": "Jul 28, 2017", "views": "5,127,942 views", "comments": "9,171", "likes": "281,360 likes", "dislikes": " Unavailable", "video_length": 274.841, "url": "https://www.youtube.com/watch?v=vF4g2RoEN4Y"}, "https://www.youtube.com/watch?v=0f3R40jlwvE": {"title": "*INSANELY* PRODUCTIVE HIGH SCHOOL MORNING ROUTINE.", "content creator": "Julia Bedell", "description": "comment something productive you've done today / something you want to do! \n-\nHey guys I really hope you enjoyed the video! I love and appreciate every single one of you SO much. Feel free to comment any video ideas / suggestions down below!! \n\n-  SOCIAL MEDIA  -\nInstagram: ", "date": "May 29, 2021", "views": "1,414,411 views", "comments": "2,037", "likes": "53,468 likes", "dislikes": " Unavailable", "video_length": 408.941, "url": "https://www.youtube.com/watch?v=0f3R40jlwvE"}, "https://www.youtube.com/watch?v=VrfL4q3ov_s": {"title": "Cringy White House Video of Dancing & Singing Nurses", "content creator": "Conservative Twins", "description": "Hodgetwins Merchandise:\nhttps://officialhodgetwins.com/\nHodgetwins Tour: http://hodgetwinstour.com", "date": "Dec 24, 2021", "views": "369,070 views", "comments": "4,060", "likes": "23,083 likes", "dislikes": " Unavailable", "video_length": 653.921, "url": "https://www.youtube.com/watch?v=VrfL4q3ov_s"}, "https://www.youtube.com/watch?v=H_Dqczmp8Kc": {"title": "8 Signs You Are Dealing with Narcissistic Abuse", "content creator": "Psych2Go", "description": "June 1 was Narcissistic Abuse Awareness Day. Narcissistic abuse can come in many different forms from examples of belittling comments, growing contempt, ignoring behavior (eg. silent treatment, passive-aggressiveness), triangulation, sabotage, downplay, and much more.  Many people are not sure whether or not they are suffering from narcissistic abuse. Cognitive dissonance and the confusion that goes with abuse can have a lot to do with this. The purpose of this video is to help you identify subtle signs that you may be a victim of narcissistic abuse. \n\nThis project was done in collaboration with Malanie Tonia Evan an amazing channel that helps women and men from all over the world not just survive abuse, but thrive in their new abuse-free lives. You can check her channel here: ", "date": "Jun 1, 2020", "views": "1,862,436 views", "comments": "7,614", "likes": "71,907 likes", "dislikes": " Unavailable", "video_length": 470.401, "url": "https://www.youtube.com/watch?v=H_Dqczmp8Kc"}, "https://www.youtube.com/watch?v=RPmZjyWf9lo": {"title": "Charlie Kirk vs America Hater", "content creator": "Turning Point UK", "description": "Charlie takes on an America hater on campus.", "date": "Oct 22, 2021", "views": "479,670 views", "comments": "4,569", "likes": "14,678 likes", "dislikes": " Unavailable", "video_length": 238.221, "url": "https://www.youtube.com/watch?v=RPmZjyWf9lo"}, "https://www.youtube.com/watch?v=WUwLLZPk2rY": {"title": "BLACK PANTHER 2 Is About To Change Everything", "content creator": "Film Royalty", "description": "BLACK PANTHER 2 Is About To Change Everything\n✅ Subscribe to us → https://www.youtube.com/c/FilmRoyalty...\n🔔 Turn on notifications to never miss a new upload!\n✅  Follow us on Instagram → ", "date": "Jul 31, 2021", "views": "1,559,900 views", "comments": "794", "likes": "15,804 likes", "dislikes": " Unavailable", "video_length": 536.381, "url": "https://www.youtube.com/watch?v=WUwLLZPk2rY"}, "https://www.youtube.com/watch?v=QtBS8COhhhM": {"title": "Prince Andrew & the Epstein Scandal: The Newsnight Interview - BBC News", "content creator": "BBC News", "description": "In a Newsnight special, Emily Maitlis interviews the Duke of York as he speaks for the first time about his relationship with convicted paedophile Jeffrey Epstein and allegations which have been made against him over his own conduct.\n\nPlease subscribe HERE ", "date": "Nov 17, 2019", "views": "5,421,129 views", "comments": "37,980", "likes": "23,388 likes", "dislikes": " Unavailable", "video_length": 2966.661, "url": "https://www.youtube.com/watch?v=QtBS8COhhhM"}, "https://www.youtube.com/watch?v=jKh0ni7HlNw": {"title": "Evolution & the Challenges of Modern Life | Bret Weinstein & Heather Heying | The JBP Podcast S4 E73", "content creator": "Jordan B Peterson", "description": "This episode was recorded on October 5th, 2021.\n\nPodcasters and evolutionary biology power-couple Bret Weinstein and Heather Heying join me to discuss a variety of topics related to their new book, A Hunter-Gatherer’s Guide to the 21st Century. We explore topics like niche-switching, what Darwin got wrong, Twitter, sources for modern values, hyper-novelty, the aftermath of progress, parenthood, and sexual selection – just to name a few.\nBret Weinstein and Heather Heying are evolutionary biologists, former Evergreen State College professors, and the current hosts of the DarkHorse podcast. You may also know Bret through Joe Rogan, or as the twice-moderator for Jordan’s debates with Sam Harris. \nThe couple’s book, titled “A Hunter-Gatherer’s Guide to the 21st Century: Evolution and the Challenges of Modern Life,” asks why the most prosperous age in history has scarcely offset suicide rates, tribal division, loneliness, and human misery.\n\nFollow Bret at: ", "date": "Jan 10, 2022", "views": "523,589 views", "comments": "3,132", "likes": "18,352 likes", "dislikes": " Unavailable", "video_length": 5603.141, "url": "https://www.youtube.com/watch?v=jKh0ni7HlNw"}, "https://www.youtube.com/watch?v=QP_uOLCneRA": {"title": "Gravitas Plus | Killing for Money: The business of Private Armies", "content creator": "WION", "description": "Have you ever wondered how governments fight proxy wars? They hire mercenaries who are paid to kill. Not bound by morality or accountability, they carry out jobs that regular armies can't. On Gravitas Plus, Palki Sharma gets you the story of private armies.", "date": "Premiered Jan 15, 2022", "views": "292,308 views", "comments": "1,374", "likes": "8,351 likes", "dislikes": " Unavailable", "video_length": 538.421, "url": "https://www.youtube.com/watch?v=QP_uOLCneRA"}, "https://www.youtube.com/watch?v=RsurbNcFjuc": {"title": "Inside Rafael Nadal's Yacht! I Got an Exclusive Tour in Monaco | Nico Rosberg", "content creator": "Nico Rosberg", "description": "If you had the chance to go on an eco Yacht with an athlete – who would you pick and where would you go? I think I had quite a decent experience with Rafa in Monaco...😁 Subscribe to my channel as my 1 Million special video is coming up soon: https://www.bit.ly/NicoRosbergYT", "date": "Nov 17, 2021", "views": "3,421,530 views", "comments": "1,873", "likes": "44,077 likes", "dislikes": " Unavailable", "video_length": 990.981, "url": "https://www.youtube.com/watch?v=RsurbNcFjuc"}, "https://www.youtube.com/watch?v=Umj2rrQOvd4": {"title": "FEARLESS CATS 😹 Badass Cats (Part 4) [Funny Pets]", "content creator": "Funny Pets", "description": "FEARLESS CATS 😹 Badass Cats (Part 4) [Funny Pets]\nSubscribe: http://bit.ly/FunnyPetMedia | Facebook: http://bit.ly/FunnyPetMediaFB", "date": "Nov 25, 2020", "views": "1,575,034 views", "comments": "893", "likes": "11,744 likes", "dislikes": " Unavailable", "video_length": 425.821, "url": "https://www.youtube.com/watch?v=Umj2rrQOvd4"}, "https://www.youtube.com/watch?v=Kh2vWO58sj4": {"title": "Unvaccinated NHS Doctor Explains Challenging Sajid Javid On Compulsory Covid Jabs | GMB", "content creator": "Good Morning Britain", "description": "Unvaccinated consultant Dr James confronted Sajid Javid at a Hospital saying he didn’t support the mandatory vaccine programme for NHS staff. Dr James explains what led to his decision.\nBroadcast on 12/01/22\n\nStream Good Morning Britain live, every weekday from 6am on the ITV Hub 📲 ", "date": "Jan 12, 2022", "views": "590,280 views", "comments": "Error found: Message: \nStacktrace:\n#0 0x561814d39a23 <unknown>\n#1 0x561814804e18 <unknown>\n#2 0x56181483b151 <unknown>\n#3 0x56181483b311 <unknown>\n#4 0x56181486dec4 <unknown>\n#5 0x5618148589bd <unknown>\n#6 0x56181486bc5b <unknown>\n#7 0x561814858883 <unknown>\n#8 0x56181482e3fa <unknown>\n#9 0x56181482f4c5 <unknown>\n#10 0x561814d6916d <unknown>\n#11 0x561814d7f5bb <unknown>\n#12 0x561814d6ae75 <unknown>\n#13 0x561814d7fe85 <unknown>\n#14 0x561814d5e86f <unknown>\n#15 0x561814d9aae8 <unknown>\n#16 0x561814d9ac68 <unknown>\n#17 0x561814db5aad <unknown>\n#18 0x7fc22f5ac6db <unknown>\n", "likes": "11,845 likes", "dislikes": " Unavailable", "video_length": 662.721, "url": "https://www.youtube.com/watch?v=Kh2vWO58sj4"}, "https://www.youtube.com/watch?v=y6h8TIxeg1g": {"title": "12 COVID Autopsy Cases Reveal the TRUTH \"HOW COVID PATIENTS DYING\"", "content creator": "Doctor Mike Hansen", "description": "12 COVID Autopsy Cases Reveal the TRUTH \"HOW COVID PATIENTS DYING\"\n\nIn all 12 COVID Autopsy cases, the cause of death was found within the lungs or the pulmonary vascular system. Those who did not die of large pulmonary emboli died of extensive inflammation, meaning pneumonia with ARDS. In these COVID Autopsy cases, the lungs were wet and heavy, like a saturated water sponge. The lung surfaces often had a distinct patchy pattern, with pale areas alternating with slightly protruding and firm, deep reddish-blue Hypercapillarized areas. \n\nThis indicates areas of intense inflammation, with endothelial dysfunction that can be seen at the microscopic level. When they looked at the lungs' slices under the microscope, they found diffuse alveolar damage in 8 COVID Autopsy cases. Specifically, they saw hyaline membrane formation, tiny clots in the capillaries, capillaries engorged with red blood cells, and other inflammatory findings. All these findings represent ARDS. They also found lymphocytes, a type of white blood cell, infiltrated these areas of infiltration. This fits the picture of viral pathogenesis.\n\n⏩ Timestamps", "date": "May 14, 2020", "views": "16,619,412 views", "comments": "17,564", "likes": "235,372 likes", "dislikes": " Unavailable", "video_length": 822.861, "url": "https://www.youtube.com/watch?v=y6h8TIxeg1g"}, "https://www.youtube.com/watch?v=4GEStca5lXc": {"title": "Evel Knievel - \"Absolute Evel\" 2005", "content creator": "My Collection", "description": "A 2005 documentary on Evel's life. From dvd master.", "date": "Jun 24, 2020", "views": "662,950 views", "comments": "Error found: Message: \nStacktrace:\n#0 0x55d76468fa23 <unknown>\n#1 0x55d76415ae18 <unknown>\n#2 0x55d764191151 <unknown>\n#3 0x55d764191311 <unknown>\n#4 0x55d7641c3ec4 <unknown>\n#5 0x55d7641ae9bd <unknown>\n#6 0x55d7641c1c5b <unknown>\n#7 0x55d7641ae883 <unknown>\n#8 0x55d7641843fa <unknown>\n#9 0x55d7641854c5 <unknown>\n#10 0x55d7646bf16d <unknown>\n#11 0x55d7646d55bb <unknown>\n#12 0x55d7646c0e75 <unknown>\n#13 0x55d7646d5e85 <unknown>\n#14 0x55d7646b486f <unknown>\n#15 0x55d7646f0ae8 <unknown>\n#16 0x55d7646f0c68 <unknown>\n#17 0x55d76470baad <unknown>\n#18 0x7fcdadf1b6db <unknown>\n", "likes": "4,848 likes", "dislikes": " Unavailable", "video_length": 5237.261, "url": "https://www.youtube.com/watch?v=4GEStca5lXc"}, "https://www.youtube.com/watch?v=cTsJTRUaMZ0": {"title": "Bill Gates's INCREDIBLY AWKWARD Interview - Is He Hiding Something??", "content creator": "Russell Brand", "description": "In a recent interview, Bill Gates is questioned on his relationship with controversial figures and it is awkward...\n#BillGates #NobelPeacePrize #Awkward", "date": "Oct 4, 2021", "views": "2,143,936 views", "comments": "16,774", "likes": "94,629 likes", "dislikes": " Unavailable", "video_length": 481.801, "url": "https://www.youtube.com/watch?v=cTsJTRUaMZ0"}, "https://www.youtube.com/watch?v=p5xgpcUX5x8": {"title": "Xi'an: mass testing despite 'basically zero cases'; Chinese tutoring company sees shares drop 90%", "content creator": "China in Focus - NTD", "description": "⭕️ Sign up for our NEWSLETTER and stay in touch👉https://www.ntd.com/newsletter.html \n-\n💎 Support our work: https://donorbox.org/china-in-focus", "date": "Premiered Jan 10, 2022", "views": "112,899 views", "comments": "559", "likes": "3,945 likes", "dislikes": " Unavailable", "video_length": 1443.341, "url": "https://www.youtube.com/watch?v=p5xgpcUX5x8"}, "https://www.youtube.com/watch?v=2fQfhbXdck8": {"title": "The Murder of POLTERGEIST Star Dominique Dunne - Her Grave, Where She Died and More 4K", "content creator": "grimmlifecollective", "description": "Join us as we tell the story of the tragic death of POLTERGEIST actress Dominique Dunne.\n\n#DominiqueDunne #Poltergeist #TrueCrime", "date": "Jan 3, 2022", "views": "265,798 views", "comments": "1,295", "likes": "10,462 likes", "dislikes": " Unavailable", "video_length": 999.681, "url": "https://www.youtube.com/watch?v=2fQfhbXdck8"}, "https://www.youtube.com/watch?v=8FSAWoLSjsA": {"title": "Giant Husky Sees Owner After 10 Days Apart!! We Don't Deserve Dogs! (Cutest Ever!!) Funny Ending", "content creator": "Life with Malamutes", "description": "Little did you all know I was banished for 10 whole days from seeing any form of canine or my own daughter! I was a prisoner in my own home, never did I think it would be that emotionally draining! Here's the video of seeing my pets after 10 days of solitary confinement! So good to hear them howling with excitement! Of course Amelia too but as mentioned that wasn't for the video.\n\nCheck out the amazon man throwing stuff at our cars haha.", "date": "Jan 15, 2022", "views": "148,521 views", "comments": "442", "likes": "4,363 likes", "dislikes": " Unavailable", "video_length": 805.481, "url": "https://www.youtube.com/watch?v=8FSAWoLSjsA"}, "https://www.youtube.com/watch?v=tr_dyw62xXs": {"title": "“Pisses Me Off:” Weatherman Goes Off On Gov. Northam During Live Broadcast", "content creator": "The Next News Network", "description": "Eliminate Mortgage Payments and Upgrade Your Home\nhttps://reversewithgary.com or call 847-553-4842\nClick the Link Above ^^^\n\nGet more at ", "date": "Jan 6, 2022", "views": "296,235 views", "comments": "1,087", "likes": "11,537 likes", "dislikes": " Unavailable", "video_length": 334.261, "url": "https://www.youtube.com/watch?v=tr_dyw62xXs"}, "https://www.youtube.com/watch?v=fnQjJCndqf0": {"title": "ABBA STARS - Chiquitita live", "content creator": "ABBA STARS official", "description": "Popis", "date": "Sep 1, 2016", "views": "11,443,908 views", "comments": "1,154", "likes": "47,957 likes", "dislikes": " Unavailable", "video_length": 88.781, "url": "https://www.youtube.com/watch?v=fnQjJCndqf0"}, "https://www.youtube.com/watch?v=w4IqpUXFCG0": {"title": "Ratings slump: CNN's viewership plummets", "content creator": "Sky News Australia", "description": "CNN has suffered a devastating slump in ratings, with the US network shedding almost 90 per cent of its early 2021 audience across multiple categories.", "date": "Jan 12, 2022", "views": "192,221 views", "comments": "3,658", "likes": "9,039 likes", "dislikes": " Unavailable", "video_length": 129.461, "url": "https://www.youtube.com/watch?v=w4IqpUXFCG0"}, "https://www.youtube.com/watch?v=417Qbwn9yso": {"title": "Cultivating Gourmet and Medicinal Mushrooms | PARAGRAPHIC", "content creator": "PARAGRAPHIC", "description": "Step into the mushroom kingdom and unlock the secrets of fungi. From lions mane and reishi to shiitake and pink oyster, these healthy and delicious mushroom species are worth the effort it takes to grow them. With incredible cognitive and neurological benefits, these mushrooms may hold the key to solutions for many of society's ailments.\n\nCheck out the Southwest Mushrooms website: ", "date": "Jul 9, 2020", "views": "4,345,244 views", "comments": "5,613", "likes": "129,507 likes", "dislikes": " Unavailable", "video_length": 774.141, "url": "https://www.youtube.com/watch?v=417Qbwn9yso"}, "https://www.youtube.com/watch?v=SVkVbItQJcw": {"title": "I Tested Gucci's $800 Color Pencils (way worse than I thought)", "content creator": "SuperRaeDizzle", "description": "Thank you to BetterHelp for sponsoring today's video. Click here for 10% off your first month: \nhttps://betterhelp.com/raedizzle \n\n\nMy Socials: \nInstagram: @Rae_Dizzle_ ", "date": "Nov 23, 2021", "views": "1,118,000 views", "comments": "2,378", "likes": "45,258 likes", "dislikes": " Unavailable", "video_length": 902.121, "url": "https://www.youtube.com/watch?v=SVkVbItQJcw"}, "https://www.youtube.com/watch?v=KEhbYNmY3N4": {"title": "This Is What REALLY Happens As You Start Exercising (Animated)", "content creator": "Practical Wisdom - Interesting Ideas", "description": "Have you ever wondered, what happens to your body, when you start exercising? The changes to your body physic, your muscles, the mind, and the heart? Well in this video we are going to explore just that. They say exercise is like taking a magical pill for your brain, and that if there were ever a drug that could do for your health everything that exercise can it would likely be the most valuable pharmaceutical ever developed. So why is exercise so good for us? ", "date": "Dec 23, 2018", "views": "5,826,391 views", "comments": "4,680", "likes": "158,513 likes", "dislikes": " Unavailable", "video_length": 545.301, "url": "https://www.youtube.com/watch?v=KEhbYNmY3N4"}, "https://www.youtube.com/watch?v=jgR3lBtwrLo": {"title": "Meet My French Bulldog Foster Puppies (and learn why it's NOT CUTE to breed & buy)", "content creator": "Kitten Lady", "description": "I hope that these puppies can demonstrate how unethical it is to breed and buy flat-faced dogs. These puppies require very specialized care due to severe brachycephaly (flat faces) which puts them at high risk of aspiration and other respiratory problems. Unfortunately, people continue to intentionally breed brachycephalic dogs for profit, with no regard for the suffering they cause. In addition to having a high risk of lifelong health issues, French bulldogs also have very high maternal and infant mortality; I don’t think most people realize that the consequence of buying these “cute squishy face puppies” is that many mothers and puppies die in the process. Because they are bred to have unnaturally narrow hips, mothers will risk death without a c-section, and even with one, they can die from respiratory problems under anesthesia due to their restricted airways. Their puppies are often born with congenital problems, and a majority of surviving dogs (72%) will have health conditions. When orphaned, it is hard for even a seasoned rescuer to care for them. And so, for every French bulldog you see on Instagram, many had to suffer. Breeders know this, which is why it’s all factored into the cost, as if suffering and death is nothing but a line-item expense in their business plan. It is a vile endeavor and nothing any animal lover should support.\n\nThese newborn babies came to us after a local rescue asked for help with a litter that had been surrendered to them in bad shape. These orphaned puppies were struggling on the bottle and needed tube feeding. I am currently tube feeding them every 2 hours to keep them stable. They are gaining weight and already looking a little better! I’m grateful that they were given a fighting chance, but I’m angry that human greed and aesthetic preference often takes precedent over the welfare of living beings. There is nothing okay about perpetuating congenital abnormalities for the sake of “cuteness.” I hope that in sharing their story, I can make it clear that there is nothing cute about breeding or buying French bulldogs. 💔", "date": "Dec 13, 2021", "views": "408,763 views", "comments": "3,133", "likes": "25,149 likes", "dislikes": " Unavailable", "video_length": 374.761, "url": "https://www.youtube.com/watch?v=jgR3lBtwrLo"}, "https://www.youtube.com/watch?v=S-OUzvhrDnM": {"title": "Betty White talks about her own death with Larry King", "content creator": "Pop Land", "description": "", "date": "Premiered Dec 31, 2021", "views": "541,266 views", "comments": "1,744", "likes": "25,015 likes", "dislikes": " Unavailable", "video_length": 60.501, "url": "https://www.youtube.com/watch?v=S-OUzvhrDnM"}, "https://www.youtube.com/watch?v=W_T-UzsvVF8": {"title": "willam belli being iconic for 9 minutes straight", "content creator": "fandompearl", "description": "MY BOAT IS PRETTY 🎶⛵\nincase you were wondering who the MOST iconic drag race queen is, its willam belli. PERIODT\n\n✨ subscribe for more!\n✨ give a like if you enjoyed!\n\nBUSINESS INQUIRIES:\nfandompearl@gmail.com \n\nCopyright Disclaimer Under Section 107 of the Copyright Act 1976, allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research.", "date": "Jan 3, 2022", "views": "312,509 views", "comments": "526", "likes": "11,570 likes", "dislikes": " Unavailable", "video_length": 573.461, "url": "https://www.youtube.com/watch?v=W_T-UzsvVF8"}, "https://www.youtube.com/watch?v=49yz4sjQSvU": {"title": "Judee, Jaila & Flloyd SiIently Sit For Their Grapefruit Snack", "content creator": "Mr. Flloyd", "description": "Thank you for visiting Mr. Flloyd. We promise to do a daily update about our trio JJ's & Flloyd to the fullness.\nYou will surely love to enjoy/watching them.\n\nThank you", "date": "Aug 12, 2021", "views": "10,966,187 views", "comments": "4,769", "likes": "50,775 likes", "dislikes": " Unavailable", "video_length": 775.101, "url": "https://www.youtube.com/watch?v=49yz4sjQSvU"}, "https://www.youtube.com/watch?v=pe0W7wR2Enk": {"title": "Watch Sheriff David Clarke Leaves Don Lemon SPEECHLESS on his own show", "content creator": "HOUSE NEWS", "description": "WYOMING CONGRESSIONAL CANDIDATE  CALLS FOR FAUCI TO BE TRIED, THEN EXECUTED.. See details: https://musictunez.com/senator-rand-p...", "date": "Jan 10, 2022", "views": "727,042 views", "comments": "7,974", "likes": "31,640 likes", "dislikes": " Unavailable", "video_length": 999.901, "url": "https://www.youtube.com/watch?v=pe0W7wR2Enk"}, "https://www.youtube.com/watch?v=z9uAVZP1B1I": {"title": "Trump Driver | Gabriel Iglesias", "content creator": "Gabriel Iglesias", "description": "Happy throwback Thursday!\n#GabrielIglesias", "date": "Premiered Oct 29, 2020", "views": "5,574,489 views", "comments": "3,644", "likes": "119,785 likes", "dislikes": " Unavailable", "video_length": 468.501, "url": "https://www.youtube.com/watch?v=z9uAVZP1B1I"}, "https://www.youtube.com/watch?v=xntA_judYy4": {"title": "Unexpected Dumper Truck Fall Down In Water And Fails Recovery With Hitachi Zaxis 210LCH", "content creator": "គ្រឿងចក្រ Power Machines", "description": "Dump Truck Dirt Crash Steering Wheel Fall Down In Water And Fails Recovery Operator With Excavator Hitachi Zaxis 210LCH.\n* Disclaimer :  The content on my YouTube channel can't be downloaded, published, edited or used without my permission since it's protected by copyright.", "date": "Oct 20, 2021", "views": "5,242,448 views", "comments": "376", "likes": "16,718 likes", "dislikes": " Unavailable", "video_length": 3635.001, "url": "https://www.youtube.com/watch?v=xntA_judYy4"}, "https://www.youtube.com/watch?v=pHH_09mlDkY": {"title": "DO NOT Buy the Manscaped Lawnmower 4.0", "content creator": "BeardTube", "description": "Brio Beardscape: https://bit.ly/3DXIC73\nManscaped Lawn Mower 4.0: https://amzn.to/3kZrOoA", "date": "Nov 23, 2021", "views": "417,246 views", "comments": "1,309", "likes": "24,758 likes", "dislikes": " Unavailable", "video_length": 630.861, "url": "https://www.youtube.com/watch?v=pHH_09mlDkY"}, "https://www.youtube.com/watch?v=v3vXL6iatBQ": {"title": "My Wife Moved In! (Apartment Tour)", "content creator": "Aaron Burriss", "description": "Welcome to the first vlog after we got married! First step Veronica moving into my apartment with me! I still can't believe that this is really happening and we're really thankful for how supportive everyones been with everything!\n\nBe sure to COMMENT, LIKE and SUBSCRIBE!! ", "date": "Jan 8, 2022", "views": "1,293,260 views", "comments": "2,911", "likes": "67,596 likes", "dislikes": " Unavailable", "video_length": 1533.321, "url": "https://www.youtube.com/watch?v=v3vXL6iatBQ"}, "https://www.youtube.com/watch?v=If-oWqUYzlQ": {"title": "Dolly Shuts Down Patronising Interview In Style", "content creator": "Happy Mag", "description": "Dolly Parton’s wit, grace, and patience always shines through. Walters is patronising at times, but Dolly stays so dignified the whole way through this interview.", "date": "Jul 6, 2021", "views": "5,533,609 views", "comments": "20,587", "likes": "173,981 likes", "dislikes": " Unavailable", "video_length": 241.781, "url": "https://www.youtube.com/watch?v=If-oWqUYzlQ"}, "https://www.youtube.com/watch?v=1Wsk3Oa_3F8": {"title": "The Dark Side Of Harajuku Style You Haven't Seen Yet | Style Out There | Refinery29", "content creator": "Refinery29", "description": "On this episode of Style Out There, our host, Connie Wang, takes us to Tokyo to meet the individuals pioneering the Harajuku subculture of Kawaii, more specifically Yami Kawaii. This style of fashion accentuates cuteness while incorporating symbols that represent death. Watch this episode of Style Out There to delve deeper into this morbid trend in Tokyo!\n\nABOUT SERIES\nIn fashion, what's seen on the streets is just as important as what goes down the runway. R29's Style Out There takes a look at the drastically different subcultures around the world, examining the myriad influences that color what we wear — and why.\n\nABOUT REFINERY29 \nRefinery29 is a modern woman's destination for how to live a stylish, well-rounded life. ", "date": "Feb 24, 2018", "views": "12,938,528 views", "comments": "20,969", "likes": "377,623 likes", "dislikes": " Unavailable", "video_length": 732.221, "url": "https://www.youtube.com/watch?v=1Wsk3Oa_3F8"}, "https://www.youtube.com/watch?v=t9gKr_NI2vM": {"title": "dance moms clips that make my moms blood boil", "content creator": "Mercedes Sad Hour Edits", "description": "", "date": "Jun 25, 2021", "views": "1,559,436 views", "comments": "3,111", "likes": "46,515 likes", "dislikes": " Unavailable", "video_length": 842.841, "url": "https://www.youtube.com/watch?v=t9gKr_NI2vM"}, "https://www.youtube.com/watch?v=7VqZfhrnZGM": {"title": "The Last Bowie Knife I Would Ever Sell", "content creator": "hickok45", "description": "Showing and discussing my favorite Bowie knives, made by a variety of knifesmiths: Randall, Lile, Puma, Cold Steel, etc. \n------------------------ Please check out and support the people who help make this channel possible:  BUD’s GUN SHOP, FEDERAL PREMIUM,  SONORAN DESERT INSTITUTE, SILENCER CENTRAL, TALON GRIPS, & BALLISTOL: ", "date": "Jan 6, 2022", "views": "252,705 views", "comments": "645", "likes": "7,144 likes", "dislikes": " Unavailable", "video_length": 1304.901, "url": "https://www.youtube.com/watch?v=7VqZfhrnZGM"}, "https://www.youtube.com/watch?v=04OVhR67hoE": {"title": "Tesla’s New Tiny House for Sustainable Living", "content creator": "Elon Musk Rewind", "description": "Elon Musk And Tesla First House News!\n\n🔔 Subscribe now with all notifications on for more Elon Musk news, SpaceX news and Tesla news!\n🖤 Support us now and become an Elon Musk fan: ", "date": "Dec 23, 2021", "views": "1,429,030 views", "comments": "2,343", "likes": "26,837 likes", "dislikes": " Unavailable", "video_length": 484.941, "url": "https://www.youtube.com/watch?v=04OVhR67hoE"}, "https://www.youtube.com/watch?v=UEnKw8GthM4": {"title": "The Tesla 2022 Company Update Is Here!", "content creator": "The Tesla Space", "description": "The Tesla 2022 Company Update Is Here! 2022 is going to be a landmark year for Tesla, we have FSD Beta updates, a look into Tesla energy storage and solar panels, gigafactory updates for Austin and Berlin, the Tesla Model Y 2022, Cybertruck and Semi. \n\nLast video: Tesla Energy Is Coming To Save Texas!", "date": "Jan 14, 2022", "views": "50,019 views", "comments": "197", "likes": "1,900 likes", "dislikes": " Unavailable", "video_length": 785.221, "url": "https://www.youtube.com/watch?v=UEnKw8GthM4"}, "https://www.youtube.com/watch?v=pnkw3vmKqbc": {"title": "I Surprised MrBeast With Custom 50 Million Playbutton!", "content creator": "Daniel Krafft", "description": "Check out a free trial of Wondershare Filmora X: https://bit.ly/2P8PYjD\nCampaign to win prizes like Sony Camera, iPad Air: https://bit.ly/3tLZMP9   \nSubscribe for more daniel crafts\n---------------------------------------------------------------\nFollow me on Instagram: ", "date": "Mar 25, 2021", "views": "13,749,349 views", "comments": "21,248", "likes": "756,031 likes", "dislikes": " Unavailable", "video_length": 790.881, "url": "https://www.youtube.com/watch?v=pnkw3vmKqbc"}, "https://www.youtube.com/watch?v=-U5dEdWouDY": {"title": "MIND BLOWING WORK ETHIC - Elon Musk Motivational Video", "content creator": "Outcast Motivation", "description": "In this motivational video, Elon Musk talks about his mind-blowing work ethic, experiences when he created PayPal, Tesla, SpaceX, etc. He gives valuable advice for aspiring entrepreneurs on how to go against all the odds when starting your own company. He also talks about failure, life advice, thinking in first principles, AI, Mars, and much more. Musk’s ultimate goal in life is to have a long-term sustainable transport energy generation and for humanity to be out there among the stars as a spacefaring civilization. Musk also talks about one of his newer companies called Neuralink, which is a neurotechnology company that solves brain and spine problems.\n\nSubscribe below for weekly motivational videos: ", "date": "Nov 14, 2021", "views": "392,567 views", "comments": "425", "likes": "5,403 likes", "dislikes": " Unavailable", "video_length": 3603.481, "url": "https://www.youtube.com/watch?v=-U5dEdWouDY"}, "https://www.youtube.com/watch?v=AreThawRsmc": {"title": "Elon Musk & Grimes' Son Sits On Dad's Lap & Says Hi In SpaceX Video", "content creator": "Access", "description": "Elon Musk and Grimes' little boy is ready for his close-up! The former couple's son, X AE A-Xii, made a rare on-camera appearance while sitting on Elon's lap for a SpaceX video presentation this week and was clearly having a blast in his front-row seat! The 50-year-old tech mogul was preparing to deliver a presentation about Starship, a fully reusable spacecraft, but it didn't take long for X and his famous dad to realize the youngster had already stolen the spotlight!\n\n» SUBSCRIBE: ", "date": "Nov 21, 2021", "views": "918,145 views", "comments": "1,067", "likes": "17,170 likes", "dislikes": " Unavailable", "video_length": 141.161, "url": "https://www.youtube.com/watch?v=AreThawRsmc"}, "https://www.youtube.com/watch?v=5U6mxGuC_Po": {"title": "🔴 CANADA ANNOUNCES NEW IMMIGRATION RULES FOR 2022 | CANADA IMMIGRATION 2022", "content creator": "Canada Immigration News", "description": "In today's video update, we'll discuss the new immigration priorities. Canada's Prime Minister Justin Trudeau has just unveiled the latest mandate letters he has submitted to his cabinet 🔴 Whatsapp Group / Telegram Channel: https://bit.ly/3pCUkNn  🔴 IMPORTANT LINK: https://bit.ly/366167d", "date": "Dec 20, 2021", "views": "189,120 views", "comments": "540", "likes": "1,850 likes", "dislikes": " Unavailable", "video_length": 284.341, "url": "https://www.youtube.com/watch?v=5U6mxGuC_Po"}, "https://www.youtube.com/watch?v=Hc2MN1n6UIA": {"title": "Don Rickles roasts Clint Eastwood on the set of Kelly's Heroes, 1968", "content creator": "Eyes On Cinema @RealEOC", "description": "1968 behind the scenes footage of Brian G. Hutton's Kelly's Heroes (movie released in 1970).\n\nCourtesy of ABC13 Houston. Original footage via: https://www.youtube.com/channel/UCDmN...", "date": "Jun 23, 2021", "views": "1,645,955 views", "comments": "1,533", "likes": "28,618 likes", "dislikes": " Unavailable", "video_length": 136.941, "url": "https://www.youtube.com/watch?v=Hc2MN1n6UIA"}, "https://www.youtube.com/watch?v=Rjym-pZOz5Q": {"title": "Deer Pantry \"Close view\"", "content creator": "Brownville's Food Pantry For Deer", "description": "The Brownville Food Pantry For Deer feeds approximately 400-500 pounds per day of native oats (local) to help sustain the white-tailed deer population through rough winters here in central Maine. Feeding happens daily around 09: 00 (9 AM) Eastern Standard Time starting December 16 and continues to the beginning of April. These are wild deer and this is not a deer farm.  Some of the deer have been coming for more than 10 years including a piebald deer with more white markings than a normal white-tailed deer.  At times there are 100 to 200 deer at the pantry.  Wild turkeys also come and eat the native oats along side the deer.  At times you may see up to 100 wild turkeys at once.   There is no Chronic Wasting Disease, or CWD in wild deer in Maine.  Please dont complain about it in chat.  These deer are all very healthy and there has never been any type of disease spread among these deer.  This \"Yarding\" of deer happens in Maine every winter, even if they were not being fed.\n\nTo Donate with CC click here:  https://www.gofundme.com/f/89mnxy-bro...\nTo Donate via PayPal send to:  brownvillefoodpantryfordeer@gmail.com\nTo Donate by check: Brownville Food Pantry For Deer, 16 Rips Road,  Brownville, Me 04414\nAll Donations go to help feed the deer and for the new cameras and related equipment.  \nThe Food Pantry For Deer is a nonprofit organization.  EIN: 81-1458580\n\nTo Join and become a member click here:  https://www.youtube.com/brownvillesfo...\n\nHome page with multiple cameras click here: https://www.youtube.com/brownvillesfo...\n\nFacebook page click here:  https://www.facebook.com/BrownvillesF...\n\nChat Rules:\nThis is a family friendly channel, children and school classes watch.\nPlease use English only.  Be polite and respectful.\nNo talk of eating or killing of animals.\nNo inappropriate language or comments.\nNo religious, political, race, or sexual comments.\nNo self-promoting of your YouTube or other social media account. \n\nHere are some news videos with Interviews of Richard.\n2016\nhttps://www.newscentermaine.com/video...\n2017\nhttps://www.youtube.com/watch?v=14VeC...\n2018\nhttps://www.youtube.com/watch?v=W3KOt...\n2021\nhttps://foxbangor.com/news/item/food-...\n\nCheck out the Wildlife Cam also which has an Eagle Cam and a Moose Cam.\nhttps://www.youtube.com/wildlifeofmaine", "date": "Started streaming on Dec 14, 2021", "views": "442 watching now", "comments": "Error found: Message: \nStacktrace:\n#0 0x55bc4f379a23 <unknown>\n#1 0x55bc4ee44e18 <unknown>\n#2 0x55bc4ee7b151 <unknown>\n#3 0x55bc4ee7b311 <unknown>\n#4 0x55bc4eeadec4 <unknown>\n#5 0x55bc4ee989bd <unknown>\n#6 0x55bc4eeabc5b <unknown>\n#7 0x55bc4ee98883 <unknown>\n#8 0x55bc4ee6e3fa <unknown>\n#9 0x55bc4ee6f4c5 <unknown>\n#10 0x55bc4f3a916d <unknown>\n#11 0x55bc4f3bf5bb <unknown>\n#12 0x55bc4f3aae75 <unknown>\n#13 0x55bc4f3bfe85 <unknown>\n#14 0x55bc4f39e86f <unknown>\n#15 0x55bc4f3daae8 <unknown>\n#16 0x55bc4f3dac68 <unknown>\n#17 0x55bc4f3f5aad <unknown>\n#18 0x7f37631286db <unknown>\n", "likes": "Unavailable", "dislikes": " Unavailable", "video_length": 2848989.306, "url": "https://www.youtube.com/watch?v=Rjym-pZOz5Q"}, "https://www.youtube.com/watch?v=aoPdxyA3gNs": {"title": "1920s UNSEEN Colorized Photos - A Photo Album of Life in America", "content creator": "Recollection Road", "description": "Rare unseen colorized photos of life in the 1920s.\n--\nPlease consider supporting Recollection Road on \nPatreon for just $3: ", "date": "Jan 6, 2022", "views": "335,602 views", "comments": "542", "likes": "8,516 likes", "dislikes": " Unavailable", "video_length": 370.101, "url": "https://www.youtube.com/watch?v=aoPdxyA3gNs"}, "https://www.youtube.com/watch?v=meiU6TxysCg": {"title": "Two Monkeys Were Paid Unequally: Excerpt from Frans de Waal's TED Talk", "content creator": "TED Blog Video", "description": "What happens when you pay two monkeys unequally? Watch what happens.\nAn excerpt from the TED Talk: \"Frans de Waal: Moral behavior in animals.\" Watch the whole talk here: http://www.ted.com/talks/frans_de_waa...", "date": "Apr 4, 2013", "views": "18,413,120 views", "comments": "8,921", "likes": "163,168 likes", "dislikes": " Unavailable", "video_length": 163.541, "url": "https://www.youtube.com/watch?v=meiU6TxysCg"}, "https://www.youtube.com/watch?v=YAJqUApEVtQ": {"title": "Michele Tafoya cuts off Whoopi Goldberg on her own show to educate her on race", "content creator": "Beshel News Service", "description": "", "date": "Nov 3, 2021", "views": "303,260 views", "comments": "1,195", "likes": "2,180 likes", "dislikes": " Unavailable", "video_length": 95.781, "url": "https://www.youtube.com/watch?v=YAJqUApEVtQ"}, "https://www.youtube.com/watch?v=qCFrDSPQF8c": {"title": "Exploring For Sea Creatures In Tide Pools", "content creator": "YBS Youngbloods", "description": "We spend 3 days camping in the remote coast of Australia to explore the 3 lowest tides of the year! Searching tide pools in the mangroves, coastal and open ocean areas for some of the world most venomous, dangerous and amazing sea creatures! - Ep 327\n\nGet YBS products at", "date": "Nov 14, 2021", "views": "4,357,416 views", "comments": "1,874", "likes": "57,919 likes", "dislikes": " Unavailable", "video_length": 1179.261, "url": "https://www.youtube.com/watch?v=qCFrDSPQF8c"}, "https://www.youtube.com/watch?v=2QTiAmvygC4": {"title": "Jennifer Hudson Sings “The Jeffersons” Theme Song – Live In Front Of A Studio Audience", "content creator": "ABC", "description": "Jennifer Hudson sings “The Jeffersons” theme song during Live In Front Of A Studio Audience.\n\nSubscribe: http://goo.gl/mo7HqT", "date": "May 23, 2019", "views": "896,740 views", "comments": "1,596", "likes": "23,916 likes", "dislikes": " Unavailable", "video_length": 86.141, "url": "https://www.youtube.com/watch?v=2QTiAmvygC4"}, "https://www.youtube.com/watch?v=OoK3uWSu-K0": {"title": "The Lion King (2019) Scar and Mufasa Scene HD", "content creator": "David Limås XD", "description": "Enjoy this video and don't forget to subscribe!", "date": "Oct 21, 2019", "views": "2,611,127 views", "comments": "3,181", "likes": "17,635 likes", "dislikes": " Unavailable", "video_length": 195.001, "url": "https://www.youtube.com/watch?v=OoK3uWSu-K0"}, "https://www.youtube.com/watch?v=TMDxo8ZDJ98": {"title": "Brady + Gronk + Evans = Super Bowl - Drew Brees break Wild Card: Eagles at Bucs? - 49ers at Cowboys?", "content creator": "Ausin", "description": "Brady + Gronk + Evans = Super Bowl - Drew Brees break Wild Card: Eagles at Bucs? - 49ers at Cowboys?", "date": "Jan 10, 2022", "views": "124,645 views", "comments": "264", "likes": "828 likes", "dislikes": " Unavailable", "video_length": 701.261, "url": "https://www.youtube.com/watch?v=TMDxo8ZDJ98"}, "https://www.youtube.com/watch?v=_RQJJJfeaDg": {"title": "Candace Owens Leaves Triggered Leftist Professor SPEECHLESS In Epic Exchange", "content creator": "True Leaders", "description": "Watch Candace Owens ENDS leftist professor in heated exchange", "date": "Dec 18, 2021", "views": "449,823 views", "comments": "4,275", "likes": "10,266 likes", "dislikes": " Unavailable", "video_length": 776.321, "url": "https://www.youtube.com/watch?v=_RQJJJfeaDg"}, "https://www.youtube.com/watch?v=DJcZq7-6BsA": {"title": "Reaction to Tim Pool getting SWATTED. @Timcast IRL must be PROTECTED at all costs.", "content creator": "Stuck in the Middle", "description": "Best way to support - join\nhttp://stuckndamid.locals.com", "date": "Jan 7, 2022", "views": "61,680 views", "comments": "577", "likes": "3,703 likes", "dislikes": " Unavailable", "video_length": 566.621, "url": "https://www.youtube.com/watch?v=DJcZq7-6BsA"}, "https://www.youtube.com/watch?v=bTZgBl7DmW4": {"title": "15 AMAZING HOME AQUARIUMS AND FISH TANKS", "content creator": "Top Fives", "description": "These aquariums are owned by the rich and famous. And some of them look absolutely incredible. From massive 20,000 gallon fish tanks, to unusual aquarium designs, here are the top 15 most incredible private aquariums.", "date": "Oct 27, 2021", "views": "1,150,151 views", "comments": "232", "likes": "9,088 likes", "dislikes": " Unavailable", "video_length": 990.341, "url": "https://www.youtube.com/watch?v=bTZgBl7DmW4"}, "https://www.youtube.com/watch?v=3yWrXPck6SI": {"title": "4K Star Wars 'De-Specialized' - Battle of Yavin", "content creator": "Prometheus of Videos", "description": "The Battle of Yavin as it was meant to be seen during its initial 1977 release in 4K. Removing all CGI and other additions that were added on its 1997 'Special Edition' re-release and kept as \"official\" to present day. Sourced from 4+77.\n\nWith the analysis of the Death Star plans, a weakness is found in the exhaust port. The Rebels send 30 X-wings and Y-wing in hopes of destroying it before it can destroy them.", "date": "Dec 31, 2021", "views": "717,719 views", "comments": "1,697", "likes": "12,072 likes", "dislikes": " Unavailable", "video_length": 789.461, "url": "https://www.youtube.com/watch?v=3yWrXPck6SI"}, "https://www.youtube.com/watch?v=vmqqr1EeVQY": {"title": "Skyrim in Unreal Engine 5: Riverwood", "content creator": "Hall 00117", "description": "I'm not sure what happened but sometime between when I recorded the video and exported the final render the colors became a bit washed out so here's some high res screenshots on my ArtStation portfolio as well: https://www.artstation.com/artwork/aG...", "date": "Dec 26, 2021", "views": "1,028,749 views", "comments": "3,034", "likes": "24,036 likes", "dislikes": " Unavailable", "video_length": 208.921, "url": "https://www.youtube.com/watch?v=vmqqr1EeVQY"}, "https://www.youtube.com/watch?v=X9cWhCU-Fq0": {"title": "Scarface | Every Shootout with Tony Montana", "content creator": "Universal Pictures", "description": "\"Say hello to my little friend!\"\nAl Pacino's Tony Montana is one of cinema's most iconic characters. Here are some of his most epic moments from the film Scarface.", "date": "Sep 18, 2019", "views": "17,797,089 views", "comments": "12,743", "likes": "159,740 likes", "dislikes": " Unavailable", "video_length": 975.441, "url": "https://www.youtube.com/watch?v=X9cWhCU-Fq0"}, "https://www.youtube.com/watch?v=UpCBIF1Yl4k": {"title": "The Greatest Advice You Will Ever Receive | Jordan Peterson Motivation", "content creator": "Motivation Madness", "description": "Pre-Order Jordan Peterson's #1 NEW RELEASE Book Here - https://geni.us/ZUhWp\n\nSubscribe for Motivational Videos Every Weekday, Helping You Get Through The Week! ", "date": "Jun 21, 2021", "views": "2,463,142 views", "comments": "2,600", "likes": "72,772 likes", "dislikes": " Unavailable", "video_length": 629.441, "url": "https://www.youtube.com/watch?v=UpCBIF1Yl4k"}, "https://www.youtube.com/watch?v=WXR-bCF5dbM": {"title": "Gorillaz - 19-2000 (Official Video)", "content creator": "Gorillaz", "description": "Follow Gorillaz online:\nhttp://gorillaz.com \nhttp://facebook.com/Gorillaz", "date": "Jun 28, 2016", "views": "111,497,252 views", "comments": "37,369", "likes": "1,156,529 likes", "dislikes": " Unavailable", "video_length": 235.621, "url": "https://www.youtube.com/watch?v=WXR-bCF5dbM"}, "https://www.youtube.com/watch?v=--r23q1SPnI": {"title": "Betty White Teaches Kim Kardashian How to Score | Betty's Happy Hour", "content creator": "KineticTV", "description": "Betty White gives Kim Kardashian-West a makeover for a night on the town! \n\nSUBSCRIBE HERE: http://bit.ly/2l55edX", "date": "Apr 26, 2017", "views": "838,838 views", "comments": "507", "likes": "15,331 likes", "dislikes": " Unavailable", "video_length": 35.281, "url": "https://www.youtube.com/watch?v=--r23q1SPnI"}, "https://www.youtube.com/watch?v=NwLg7Zgdp14": {"title": "Charlie Kirk and Candace Owens school rude leftist", "content creator": "Turning Point UK", "description": "Charlie Kirk and Candace Owens school rude leftist", "date": "Jan 9, 2022", "views": "86,641 views", "comments": "520", "likes": "3,439 likes", "dislikes": " Unavailable", "video_length": 107.381, "url": "https://www.youtube.com/watch?v=NwLg7Zgdp14"}, "https://www.youtube.com/watch?v=2bARBCilwJQ": {"title": "Groom's Ex Girlfriend ‘Sabotages’ Bride’s Appointment | Say Yes To The Dress Atlanta", "content creator": "Say Yes to the Dress", "description": "Bride Yasmine is willing to go over the budget set by her groom for the perfect wedding dress. But one of her entourage, her groom's ex-girlfriend, is keen to make sure she sticks within the budget! \n\n🇬🇧 Catch full episodes of Say Yes to the Dress on discovery+: ", "date": "Jun 8, 2021", "views": "3,131,660 views", "comments": "7,605", "likes": "70,889 likes", "dislikes": " Unavailable", "video_length": 481.421, "url": "https://www.youtube.com/watch?v=2bARBCilwJQ"}, "https://www.youtube.com/watch?v=-suTcsO_qUU": {"title": "ariana \"talks more italian\" when bella is in the room | the voice US", "content creator": "difference", "description": "so sweet :))\n\njoin the discord: https://discord.gg/Jvb2bxcN", "date": "Oct 12, 2021", "views": "2,030,810 views", "comments": "2,491", "likes": "64,016 likes", "dislikes": " Unavailable", "video_length": 16.081, "url": "https://www.youtube.com/watch?v=-suTcsO_qUU"}, "https://www.youtube.com/watch?v=bW8GocUSqsA": {"title": "Ethan SMEARS Jordan Peterson in Twitter MELTDOWN", "content creator": "Lauren Chen", "description": "✅ Enjoy The Healthy Aging Support of Collagen 🔥\nGet 51% Off  Here ➡️  http://www.healthwithlauren.com/  \nThis is my FAV trusted source ^^^^💪💪 \n\nH3H3's Ethan Klein took to Twitter to denounce Jordan Peterson and explain why he's removing the interview they did together. But is there any merit to Klein's smears against Peterson? And is it wise for someone with such a \"problematic\" past to be courting a woke mob as his audience?\n\nethan klein twitter h3h3 jordan peterson \n\nJoin my Locals community! ", "date": "Jan 15, 2022", "views": "103,662 views", "comments": "1,451", "likes": "7,003 likes", "dislikes": " Unavailable", "video_length": 983.461, "url": "https://www.youtube.com/watch?v=bW8GocUSqsA"}, "https://www.youtube.com/watch?v=d1KoEC-_5S8": {"title": "Spending last moments with my Cookie || 2011-2021", "content creator": "Alen AxP", "description": "I am so sorry all of you for this kind of video :( It was really hard to make it :(\nCookie I love you so much! You will never be alone! I miss you so much, it hurts :(\n\nThe Greatest Budgie and a Friend\n\nI want to thank all my members on support!\n➡️ Cheryl Kinkaid ➡️ ", "date": "Aug 5, 2021", "views": "715,227 views", "comments": "6,636", "likes": "27,430 likes", "dislikes": " Unavailable", "video_length": 601.341, "url": "https://www.youtube.com/watch?v=d1KoEC-_5S8"}, "https://www.youtube.com/watch?v=BhGqb8d6hII": {"title": "Baby Chipmunk Burrows Into Giant 115-Pound Dog's Fur | The Dodo", "content creator": "The Dodo", "description": "115-pound dog falls in love with a baby chipmunk — and their mom finds the sweetest way for them to be together forever ❤️\n\nKeep up with Kip and Charlie on Instagram: ", "date": "Jan 14, 2022", "views": "2,293,493 views", "comments": "3,304", "likes": "63,090 likes", "dislikes": " Unavailable", "video_length": 242.821, "url": "https://www.youtube.com/watch?v=BhGqb8d6hII"}, "https://www.youtube.com/watch?v=WuHSBSLK3_A": {"title": "Relaxing Fireplace Sounds - Burning Fireplace & Crackling Fire Sounds (NO MUSIC)", "content creator": "Cat Trumpet", "description": "Enjoy 12 hours of relaxing fireplace sounds! This burning fireplace features crackling fire sounds ideal for deep sleep, relaxation, meditation and study.\n✿ Follow on Spotify https://spoti.fi/2rXqPK9", "date": "Feb 20, 2019", "views": "7,229,937 views", "comments": "614", "likes": "28,351 likes", "dislikes": " Unavailable", "video_length": 43249.361, "url": "https://www.youtube.com/watch?v=WuHSBSLK3_A"}, "https://www.youtube.com/watch?v=d-yWx772qFU": {"title": "Surgeon Explains How to Apply Stitches | WIRED", "content creator": "WIRED", "description": "Trauma surgeon Annie Onishi shows WIRED contributor Peter Rubin how to tie various forms of surgical knots. Annie demonstrates the techniques behind a one-handed knot using different types of sutures that are typically used for various parts of the human body.\n\nStill haven’t subscribed to WIRED on YouTube? ►► ", "date": "Nov 27, 2019", "views": "3,839,216 views", "comments": "2,787", "likes": "85,800 likes", "dislikes": " Unavailable", "video_length": 1021.041, "url": "https://www.youtube.com/watch?v=d-yWx772qFU"}, "https://www.youtube.com/watch?v=COhSs7o1XLU": {"title": "White Guy Shocks Nigerians by Speaking African Language", "content creator": "Xiaomanyc 小马在纽约", "description": "Sign up for free: https://cen.yt/mbxiaomanyc and become smarter in 5 minutes – thanks to Morning Brew for sponsoring today’s video! So this month I’ve been spending some time learning Yoruba, just one of the over 500 languages spoken in Nigeria, Africa’s most populous country. I was interested in Yoruba because as a strictly tonal language, Yoruba being pronounced Yorùbá, it’s an amazing challenge to learn to speak and it reminds me a lot of Mandarin Chinese. Then I decided to go and find some Nigerians to practice with and…we had a good time! People were really surprised when I started speaking Yoruba, one of the biggest African languages, with them. Finally I tried Nigerian food for the first time and it was incredible. Next time, we’ll do this in Nigeria!", "date": "Jul 27, 2021", "views": "10,529,721 views", "comments": "13,105", "likes": "333,835 likes", "dislikes": " Unavailable", "video_length": 615.481, "url": "https://www.youtube.com/watch?v=COhSs7o1XLU"}, "https://www.youtube.com/watch?v=uLAuzWNrK0w": {"title": "Dwight Thinks it's Friday - The Office US", "content creator": "The Office", "description": "When he realises Dwight mistakenly thinks it's Friday, Jim spends the day playing along.\n\nFrom Season 2, Episode 8 \"Performance Review\" - Michael's uses his discussion with the staff about their performance to steal ideas for his meeting with Jan, and Pam and Jim try and fool Dwight into thinking it's Friday.\n\nStreaming now on Peacock: ", "date": "May 13, 2021", "views": "4,040,330 views", "comments": "953", "likes": "69,924 likes", "dislikes": " Unavailable", "video_length": 158.741, "url": "https://www.youtube.com/watch?v=uLAuzWNrK0w"}, "https://www.youtube.com/watch?v=MTogtDE7M7Q": {"title": "Cardiac Surgeon Breaks Down Surgeries From Movies & TV | GQ", "content creator": "GQ", "description": "Dr. Leonard Lee, Cardiac Surgeon, breaks down surgeries from movies and TV, including 'Doctor Strange,' 'Trainwreck,' 'Seinfeld,' 'The Good Doctor,' and 'Spies Like Us.'", "date": "Jun 22, 2021", "views": "2,309,611 views", "comments": "1,301", "likes": "48,397 likes", "dislikes": " Unavailable", "video_length": 838.741, "url": "https://www.youtube.com/watch?v=MTogtDE7M7Q"}, "https://www.youtube.com/watch?v=CaTwmVx75xI": {"title": "HYDRAULIC PRESS VS OLD AND MODERN ARMY HELMET", "content creator": "Crazy Hidraulic Press", "description": "We will test the strength of the army helmets with a hydraulic press. Which helmet will be stronger modern or old", "date": "Jan 4, 2022", "views": "24,716,215 views", "comments": "8,187", "likes": "300,496 likes", "dislikes": " Unavailable", "video_length": 412.061, "url": "https://www.youtube.com/watch?v=CaTwmVx75xI"}, "https://www.youtube.com/watch?v=YtIw3wqHeNY": {"title": "Astronaut Answers Space Questions From Twitter | Tech Support | WIRED", "content creator": "WIRED", "description": "Astronaut Mike Massimino answers the internet's burning questions about the far reaches of space. How do astronauts get leverage when screwing things in? After a long space flight, where does the poo go? Does NASA let astronauts get acclimated to space on their first space walk? Are space suits comfortable? How many languages do astronauts have to learn? Does space have a smell?\n\nFollow Mike on Social:\ntwitter: @astro_mike\ninstagram: @astromikemassimino\nfacebook: AstroMikeMassimino\nlinkedin: Michael Massimino\n\nStill haven’t subscribed to WIRED on YouTube? ►► ", "date": "Aug 12, 2021", "views": "886,154 views", "comments": "828", "likes": "28,326 likes", "dislikes": " Unavailable", "video_length": 807.381, "url": "https://www.youtube.com/watch?v=YtIw3wqHeNY"}, "https://www.youtube.com/watch?v=cJ81GuY1K-U": {"title": "Every Major Tool A Heart Surgeon Uses | Expert Toolbox", "content creator": "Insider", "description": "Dr. Leonard Lee, a cardiac surgeon, explains every common tool he uses when he performs heart surgery in his operating room.\n\nMORE INSIDER VIDEOS:\nEvery Major Tool A Plastic Surgeon Uses | Expert Toolbox", "date": "Dec 27, 2021", "views": "1,193,186 views", "comments": "868", "likes": "28,351 likes", "dislikes": " Unavailable", "video_length": 496.521, "url": "https://www.youtube.com/watch?v=cJ81GuY1K-U"}, "https://www.youtube.com/watch?v=fIBIGRNH734": {"title": "Model Scout Decides Who's Most Attractive", "content creator": "Cut", "description": "Buy Truth or Drink: The Card Game - playtruthordrink.com\nBuy Fear Pong: The Card Game - buy.cut.com\nVisit our Store - buy.cut.com", "date": "Mar 12, 2021", "views": "8,818,636 views", "comments": "11,956", "likes": "300,245 likes", "dislikes": " Unavailable", "video_length": 410.621, "url": "https://www.youtube.com/watch?v=fIBIGRNH734"}, "https://www.youtube.com/watch?v=xvP5NFNU_HY": {"title": "Leo Terrell: What does BLM have to do with selling groceries?", "content creator": "Fox News", "description": "Fox News contributor and civil rights attorney Leo Terrell discusses the FDA prioritizing treatment based on race and Whole Foods clarifying their dress code policy. #FoxNews", "date": "Jan 11, 2022", "views": "258,442 views", "comments": "Error found: Message: \nStacktrace:\n#0 0x55d6e2eb5a23 <unknown>\n#1 0x55d6e2980e18 <unknown>\n#2 0x55d6e29b7151 <unknown>\n#3 0x55d6e29b7311 <unknown>\n#4 0x55d6e29e9ec4 <unknown>\n#5 0x55d6e29d49bd <unknown>\n#6 0x55d6e29e7c5b <unknown>\n#7 0x55d6e29d4883 <unknown>\n#8 0x55d6e29aa3fa <unknown>\n#9 0x55d6e29ab4c5 <unknown>\n#10 0x55d6e2ee516d <unknown>\n#11 0x55d6e2efb5bb <unknown>\n#12 0x55d6e2ee6e75 <unknown>\n#13 0x55d6e2efbe85 <unknown>\n#14 0x55d6e2eda86f <unknown>\n#15 0x55d6e2f16ae8 <unknown>\n#16 0x55d6e2f16c68 <unknown>\n#17 0x55d6e2f31aad <unknown>\n#18 0x7f21e29c36db <unknown>\n", "likes": "9,347 likes", "dislikes": " Unavailable", "video_length": 241.761, "url": "https://www.youtube.com/watch?v=xvP5NFNU_HY"}, "https://www.youtube.com/watch?v=Eg8d30aU0G4": {"title": "What Happened To Music? This Week In the 80s Based On All-Time Performance | Professor of Rock", "content creator": "Professor of Rock", "description": "Up next we're going to go go behind the top 10 songs of this same week from the year 1983.  We'll recalibrate them based on their performance up to now and with your memories and artist commentary!  Including  Tell Her About It By Billy Joel, The Safety Dance by Men Without Hats, Islands in the Stream by Kenny Rogers and Dolly Parton, Mainiac by Micheal Sembello, True By Spandau Ballet, Making Love out of Nothing at All by Air Supply and Total Eclipse Of The Heart by Bonnie Tyler.\n\nWe Have New MERCH! ", "date": "Sep 30, 2021", "views": "474,723 views", "comments": "3,740", "likes": "16,817 likes", "dislikes": " Unavailable", "video_length": 1443.221, "url": "https://www.youtube.com/watch?v=Eg8d30aU0G4"}, "https://www.youtube.com/watch?v=-GQEd-uZzvA": {"title": "Supreme Court Blocks Vaccine Mandate on Businesses in All 50 States, Leaves Healthcare in Place", "content creator": "Facts Matter with Roman Balmakov", "description": "An analysis of the the Supreme Court ruling to block the OSHA mandate, while leaving in place the CMS healthcare mandate.\n\nResources:\n\n🔥 Epoch TV:", "date": "Premiered Jan 14, 2022", "views": "167,966 views", "comments": "2,335", "likes": "23,053 likes", "dislikes": " Unavailable", "video_length": 968.481, "url": "https://www.youtube.com/watch?v=-GQEd-uZzvA"}, "https://www.youtube.com/watch?v=kYYJlNbV1OM": {"title": "2017 Personality 01: Introduction", "content creator": "Jordan B Peterson", "description": "In this lecture, I define personality from multiple angles, historical, constructivist, psychoanalytic, behavioral and neuropsychological. Personality is a way of looking at the world, and a characteristic mode of behaving. It's both stable and adaptively dynamic. \n\n--- SUPPORT THIS CHANNEL ---\n\nDirect Support: ", "date": "Feb 8, 2017", "views": "2,065,859 views", "comments": "1,995", "likes": "34,537 likes", "dislikes": " Unavailable", "video_length": 3242.501, "url": "https://www.youtube.com/watch?v=kYYJlNbV1OM"}, "https://www.youtube.com/watch?v=AVJ0SkahgQQ": {"title": "Comedian Claims He Defeated Every Argument Against Gun Control - Part 1", "content creator": "Colion Noir", "description": "Steve Hofstetter guns \nhttps://bit.ly/2CHLudt \n\nI got sent a video from a comedian Steve Hofstetter that claimed he defeated every argument against gun control. He stated, \"People against gun control parrot the same arguments over and over. Here’s a detailed takedown of every single one of them.\"\n\nI felt compelled to counter all 23 of his points and point out the straw man fallacies people like to use when arguing against guns. There's a lot to unpack here, so this will be a multiple-part series. Here are Arguments 1-5.   \n\nArgument 1. - If you think there should be absolutely no laws when it comes to the regulation of firearms that means it shouldn't be child endangerment to give one to a toddler, \"Arm the toddlers like the Bill of Rights intended\"\n\nArgument 2.  - The Constitution is not absolute because that's what an amendment is. 27 Times the United States has seen fit to fix something that the Constitution either left out or got completely wrong.\n\nArgument 3. - The justification to make it harder for responsible people to own guns because then it would also be harder for irresponsible people to own a gun.\n\nArgument 4. - Registering your guns.\n\nArgument 5. - Gun registration leads directly to confiscation is a hilariously untrue statement. \n\nDefund Gun Control Hats & Apparel\n➡️ ", "date": "Jul 22, 2021", "views": "747,827 views", "comments": "9,927", "likes": "78,080 likes", "dislikes": " Unavailable", "video_length": 747.581, "url": "https://www.youtube.com/watch?v=AVJ0SkahgQQ"}, "https://www.youtube.com/watch?v=e3FfL46OzYI": {"title": "Denzel Washington's Life Advice Will Leave You Speechless (MUST WATCH)", "content creator": "Motivation Madness", "description": "Denzel Washington shares his greatest wisdoms, telling us his life story, and journey to becoming the man he is today. This Powerful Motivational Speech for 2020 will change your future and leave you speechless! \n\nDenzel Hayes Washington Jr. is an American actor, director, and producer. He has been described as an actor who reconfigured \"the concept of classic movie stardom\", associating with characters defined by their grace, dignity, humanity, and inner strength.\n\nInterested in saving this audio and listening to it offline? Check it out on the Mindset App: ", "date": "Nov 2, 2020", "views": "9,886,755 views", "comments": "9,949", "likes": "237,547 likes", "dislikes": " Unavailable", "video_length": 724.461, "url": "https://www.youtube.com/watch?v=e3FfL46OzYI"}, "https://www.youtube.com/watch?v=Wm2R6MrJdyY": {"title": "How To Stop Being A People Pleaser & Stand Up For Yourself! - Jordan Peterson Motivation", "content creator": "WisdomTalks", "description": "Get Jordan Peterson's Audiobook With Audible: https://amzn.to/2KhJOpS\nHow To Stop Being A People Pleaser & Stand Up For Yourself! - Jordan Peterson Motivation\n\n==========================================\n\nSubscribe To Jordan Peterson Youtube Channel:", "date": "Jul 14, 2021", "views": "1,060,622 views", "comments": "675", "likes": "26,527 likes", "dislikes": " Unavailable", "video_length": 2471.341, "url": "https://www.youtube.com/watch?v=Wm2R6MrJdyY"}, "https://www.youtube.com/watch?v=0XgYfsjrAc4": {"title": "\"You Don't Buzz A Legend\" - Betty White defends her friend Lucille Ball", "content creator": "Chronic Nostalgia", "description": "A segment from Super Password, Aired in November of 1988.\n-\nContestants are: Lucille Ball in her final game show appearance and one of her last appearances on TV. Lucy had suffered a stroke earlier in 1988 and she is seen struggling here in this show with her memory. Also appearing are: Betty White, Carol Channing, and Dick Martin along with the host, Bert Convy.\n\"Copyright Disclaimer Under Section 107 of the Copyright Act 1976, allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.", "date": "Sep 3, 2019", "views": "1,545,876 views", "comments": "Error found: Message: \nStacktrace:\n#0 0x556e082e6a23 <unknown>\n#1 0x556e07db1e18 <unknown>\n#2 0x556e07de8151 <unknown>\n#3 0x556e07de8311 <unknown>\n#4 0x556e07e1aec4 <unknown>\n#5 0x556e07e059bd <unknown>\n#6 0x556e07e18c5b <unknown>\n#7 0x556e07e05883 <unknown>\n#8 0x556e07ddb3fa <unknown>\n#9 0x556e07ddc4c5 <unknown>\n#10 0x556e0831616d <unknown>\n#11 0x556e0832c5bb <unknown>\n#12 0x556e08317e75 <unknown>\n#13 0x556e0832ce85 <unknown>\n#14 0x556e0830b86f <unknown>\n#15 0x556e08347ae8 <unknown>\n#16 0x556e08347c68 <unknown>\n#17 0x556e08362aad <unknown>\n#18 0x7f8cdc9eb6db <unknown>\n", "likes": "22,598 likes", "dislikes": " Unavailable", "video_length": 192, "url": "https://www.youtube.com/watch?v=0XgYfsjrAc4"}, "https://www.youtube.com/watch?v=wXyvLuOKoUc": {"title": "Varnish, Paint, and bad jokes! (Rebuilding Tally Ho / EP116)", "content creator": "Sampson Boat Co", "description": "Support / Donate; http://www.sampsonboat.co.uk/support\nBecome a Patron; http://www.patreon.com/sampsonboatco\nPatrick's YouTube channel - https://www.youtube.com/channel/UCGtQ...", "date": "Premiered Jan 15, 2022", "views": "269,559 views", "comments": "884", "likes": "23,671 likes", "dislikes": " Unavailable", "video_length": 1612.461, "url": "https://www.youtube.com/watch?v=wXyvLuOKoUc"}, "https://www.youtube.com/watch?v=5Ae-U2p1_EA": {"title": "Updated 2022 Governors Map Prediction (Jan. 2022)", "content creator": "Red Eagle Politics", "description": "Protect Your Retirement W/ A Gold. IRA\nMetal: https://noblegoldinvestments.com/gold...\nNoble Gold is Who I Trust ^^^\n\nAn updated look and forecast of the 2022 US Gubernatorial Elections, approximately ten months out.\n\nJOIN THE WEBSITE (for exclusive content and to access the Discord): ", "date": "Jan 6, 2022", "views": "62,030 views", "comments": "685", "likes": "3,080 likes", "dislikes": " Unavailable", "video_length": 888.221, "url": "https://www.youtube.com/watch?v=5Ae-U2p1_EA"}, "https://www.youtube.com/watch?v=kujtF7tZ1Zk": {"title": "Gutfeld: This is why the hugest story on Earth must vanish", "content creator": "Fox News", "description": "'Gutfeld!' panel reacts to debunked Steele dossier that accused former President Donald Trump of lewd behavior #FoxNews #Gutfeld \n\nSubscribe to Fox News! ", "date": "Nov 8, 2021", "views": "3,820,510 views", "comments": "9,447", "likes": "97,828 likes", "dislikes": " Unavailable", "video_length": 873.421, "url": "https://www.youtube.com/watch?v=kujtF7tZ1Zk"}, "https://www.youtube.com/watch?v=8aZLSp-QAR8": {"title": "Magnificent - Hillsong Worship", "content creator": "Hillsong Worship", "description": "'Magnificent' from the Hillsong Worship album 'Blessed' released in July 2002.\n\nSubscribe to our YouTube channel: http://smarturl.it/HillsongWorshipSub", "date": "Aug 3, 2017", "views": "3,887,766 views", "comments": "790", "likes": "16,480 likes", "dislikes": " Unavailable", "video_length": 315.501, "url": "https://www.youtube.com/watch?v=8aZLSp-QAR8"}, "https://www.youtube.com/watch?v=hObcrSoLc8w": {"title": "ТИГР ПРОТИВ АЛАБАЯ 21 #Shorts", "content creator": "ТИГР ПРОТИВ АЛАБАЯ", "description": "#Shorts Заходите в группу Facebook: https://www.facebook.com/ALABAIANDTIGER/\n\nДоп. описание: #cat #instacat #catsagram #cats #catstagram #kitty #instagood #kitten #kittens ", "date": "Mar 25, 2017", "views": "20,813,887 views", "comments": "5,854", "likes": "65,754 likes", "dislikes": " Unavailable", "video_length": 46.101, "url": "https://www.youtube.com/watch?v=hObcrSoLc8w"}, "https://www.youtube.com/watch?v=JqhVc9-NWVE": {"title": "Obama-appointed liberal justices meet ferocious pushback for this", "content creator": "Fox News", "description": "Correspondent Lucas Tomlinson discusses accusations against Justice Elena Kagan and Justice Sonia Sotomayor for spreading misinformation on 'Fox Report.' #FoxNews #FoxReport", "date": "Jan 9, 2022", "views": "868,754 views", "comments": "4,907", "likes": "18,518 likes", "dislikes": " Unavailable", "video_length": 167.261, "url": "https://www.youtube.com/watch?v=JqhVc9-NWVE"}, "https://www.youtube.com/watch?v=xRbHeaiJRRQ": {"title": "'The Five' react to The Squad in melting mode after demise of Biden agenda", "content creator": "Fox News", "description": "'The Five' panel discusses the fallout after key Democrat, Sen. Joe Manchin of West Virginia, said on Fox News Sunday that he will not vote for President Biden's Build Back Better bill. #FoxNews #TheFive", "date": "Dec 20, 2021", "views": "2,153,522 views", "comments": "10,747", "likes": "46,953 likes", "dislikes": " Unavailable", "video_length": 569.561, "url": "https://www.youtube.com/watch?v=xRbHeaiJRRQ"}, "https://www.youtube.com/watch?v=6I_0EvoZg9A": {"title": "Largest Asian Buffet in New York... Visiting Flushing, Queens", "content creator": "Tim Lee", "description": "The food in New York City gets better and better.  This time, I'm visiting the Chinatown area in New York and thanks to all the suggestion from everyone to visit the Chinatown in Flushing, Queens.  While the Chinatown in Manhattan was quite the sight, the places in Flushing, Queens were outstanding.\n\nI got a chance to visit a buffet in the Flushing, Queens area... Great price, great seafood, and more importantly great people... Oh yes, and the unlimited Peking Duck was quite impressive as well.\n\nSome useful links:\nThe Buffet NY Restaurant:  \n  • Website:  ", "date": "Dec 19, 2021", "views": "241,013 views", "comments": "528", "likes": "4,109 likes", "dislikes": " Unavailable", "video_length": 1786.541, "url": "https://www.youtube.com/watch?v=6I_0EvoZg9A"}, "https://www.youtube.com/watch?v=PVxprj4YSAM": {"title": "Insane Jamaican Jerk BBQ!! HUGE MEAT PIT + Jerk Champion in Montego Bay, Jamaica! 🇯🇲", "content creator": "Mark Wiens", "description": "🙏Thanks to Matt Robinson: https://www.instagram.com/jamaicafood...\n🎥Watch - Kingston Street Food Tour: https://youtu.be/Il3NjMlQ_dk\n👍100% Real Durian Chips - Order Here: https://amzn.to/2RdmD5q", "date": "Apr 12, 2020", "views": "4,843,342 views", "comments": "6,386", "likes": "71,415 likes", "dislikes": " Unavailable", "video_length": 1820.121, "url": "https://www.youtube.com/watch?v=PVxprj4YSAM"}, "https://www.youtube.com/watch?v=EQkNmAARSe0": {"title": "Bach Cello Suite 10 Hours", "content creator": "CLASSICAL MUSIC", "description": "Cello Suite No.1 in G major, BWV 1007 by Johann Sebastian Bach for full 10 Hours performed by Colin Carr", "date": "May 14, 2019", "views": "746,248 views", "comments": "189", "likes": "7,647 likes", "dislikes": " Unavailable", "video_length": 36000.001, "url": "https://www.youtube.com/watch?v=EQkNmAARSe0"}, "https://www.youtube.com/watch?v=4CTZXG6_Qqs": {"title": "LIVING on WORLD'S BEST VENDING MACHINES for 1 WEEK!", "content creator": "LivingBobby", "description": "Vending machine challenge to live on the world's best vending machines for 1 entire week. Although many think this is an impossible challenge I found unique Japanese vending machines that you’ve never seen before of a pizza vending machine, a 7-eleven vending machine, McDonalds, dominos pizza and Pepsi vending business, KFC and much more! \n\nDuring the video there were definitely some weird vending machines you’ve never seen before, but also some that had amazing food, even if they were vending machine foods! I found these vending machines inside gas stations, fast food restaurants, and even a capsule hotel! Enjoy my reaction to this week long challenge and let me know the ones you would give 1 star reviews to or 5-star reviews! For me these are the best vending machines everywhere from Tokyo, Japan to the entire world! Enjoy this never before seen video! \n\nWatch All The Challenges ", "date": "Dec 3, 2021", "views": "4,191,298 views", "comments": "2,782", "likes": "100,194 likes", "dislikes": " Unavailable", "video_length": 668.801, "url": "https://www.youtube.com/watch?v=4CTZXG6_Qqs"}, "https://www.youtube.com/watch?v=GyE55eB9Afc": {"title": "Former CIA Agent Mike Baker on China's 2049 Plan", "content creator": "PowerfulJRE", "description": "This clip is taken from the Joe Rogan Experience #1617 with Mike Baker. https://open.spotify.com/episode/5g9c...", "date": "Mar 10, 2021", "views": "8,252,891 views", "comments": "21,194", "likes": "120,498 likes", "dislikes": " Unavailable", "video_length": 852.181, "url": "https://www.youtube.com/watch?v=GyE55eB9Afc"}, "https://www.youtube.com/watch?v=f8cyvpJYZlk": {"title": "Outlets vs retail, and Winners prices: Sale fail? (CBC Marketplace)", "content creator": "CBC News", "description": "Originally broadcast January 8, 2016\nGet our newsletter http://cbc.ca/marketplace/watchdog\nFacebook: http://facebook.com/cbcmarketplace", "date": "Jan 8, 2016", "views": "3,306,010 views", "comments": "3,018", "likes": "25,005 likes", "dislikes": " Unavailable", "video_length": 1341.001, "url": "https://www.youtube.com/watch?v=f8cyvpJYZlk"}, "https://www.youtube.com/watch?v=5Mf1EMI6EWY": {"title": "Can this 'wheelchair' Really Climb STAIRS?! - Mobile Stairlift", "content creator": "ZacksJerryRig", "description": "Finally, with technology, stairs are less of an obstacle. Check out the Mobile Stair Lift HERE: https://www.mobilestairlift.com/colle... (this video is not sponsored) Its fun to check out new pieces of technology that can make things easier for someone in a wheelchair. Stairs are one of the big issues. This Mobile Stair Lift might not be a permanent solution, but it is very good for a temporary setup; or a good backup for when you might need it. Its much stronger than it looks! \n\nGet my knife here! ", "date": "Jan 22, 2021", "views": "4,760,618 views", "comments": "4,408", "likes": "64,817 likes", "dislikes": " Unavailable", "video_length": 586, "url": "https://www.youtube.com/watch?v=5Mf1EMI6EWY"}, "https://www.youtube.com/watch?v=MmG84E0hu58": {"title": "Costco Employees Share Secrets", "content creator": "BuzzFeedVideo", "description": "Credits: https://www.buzzfeed.com/bfmp/videos/...\n\nSubscribe to BuzzFeedVideo: https://bzfd.it/2lVAsJ3", "date": "Jun 29, 2020", "views": "1,067,494 views", "comments": "1,005", "likes": "23,206 likes", "dislikes": " Unavailable", "video_length": 412.521, "url": "https://www.youtube.com/watch?v=MmG84E0hu58"}, "https://www.youtube.com/watch?v=p9ajgFcfzXY": {"title": "Jane Fonda Started & Ended Her Career Sleeping With Robert Redford | The Graham Norton Show", "content creator": "The Graham Norton Show", "description": "And she discusses turning 80!", "date": "Oct 13, 2017", "views": "582,344 views", "comments": "329", "likes": "6,003 likes", "dislikes": " Unavailable", "video_length": 144.741, "url": "https://www.youtube.com/watch?v=p9ajgFcfzXY"}, "https://www.youtube.com/watch?v=gIV1C8nDYdA": {"title": "3 Retirement Benefits in Canada | CPP OAS GIS, How Do They Work? | Retirement in Canada", "content creator": "Thomas C Chan - Financial Services", "description": "- Want To Learn More With Thomas? - \n■  💸Not sure If you are on the right path in saving?\n💪  Download this FREE Retirement Stability Checklist:  \n- ", "date": "Jun 20, 2021", "views": "273,622 views", "comments": "434", "likes": "5,180 likes", "dislikes": " Unavailable", "video_length": 789.621, "url": "https://www.youtube.com/watch?v=gIV1C8nDYdA"}, "https://www.youtube.com/watch?v=G4_mDOqLMpA": {"title": "Spain Declares End Of Pandemic?", "content creator": "Valuetainment Short Clips", "description": "Patrick Bet-David Podcast Episode 115. In this short clip, they discuss Spain changing Covid from a 'Pandemic' to something 'Endemic'.\n\nVisit vtmerch.com for all official Valuetainment gear: ", "date": "Jan 13, 2022", "views": "76,009 views", "comments": "574", "likes": "2,498 likes", "dislikes": " Unavailable", "video_length": 380.741, "url": "https://www.youtube.com/watch?v=G4_mDOqLMpA"}, "https://www.youtube.com/watch?v=rZh1f7SZ36s": {"title": "Elon Musk Explains Why Tesla Created Phone Model Pi", "content creator": "Elon Musk Rewind", "description": "Elon Musk and Tesla Phone Model Pi News\n\n🔔 Subscribe now with all notifications on for more Elon Musk news, SpaceX news and Tesla news!\n🖤 Support us now and become an Elon Musk fan: ", "date": "Jan 10, 2022", "views": "39,065 views", "comments": "230", "likes": "1,645 likes", "dislikes": " Unavailable", "video_length": 488.261, "url": "https://www.youtube.com/watch?v=rZh1f7SZ36s"}, "https://www.youtube.com/watch?v=UTtAyfJ1CiI": {"title": "Jordan Peterson drops the Red Pill on woman that has hit the wall", "content creator": "Be Reset", "description": "LIKE, SHARE and SUBSCRIBE‼️ Compilation videos everyday of people in some crazy bad relationships! Guys make a best version of your selfs, don't let someone to manipulate you and your feelings, know your worth!\n\nPlease 👍 and subscribe 🙏 to the channel and hit that bell 🛎 button! And don't forget to share videos like these with your friends! ", "date": "May 30, 2021", "views": "2,339,267 views", "comments": "9,071", "likes": "55,472 likes", "dislikes": " Unavailable", "video_length": 102.181, "url": "https://www.youtube.com/watch?v=UTtAyfJ1CiI"}, "https://www.youtube.com/watch?v=MebophtkgsE": {"title": "SJW TRIGGERED - Meaning Of Free Speech According To Liberals", "content creator": "Sjw Triggered", "description": "Please Show some Support by Buying our MERCH.\nClick the link - https://titoo-store.creator-spring.co...", "date": "Apr 10, 2021", "views": "106,730 views", "comments": "1,112", "likes": "4,726 likes", "dislikes": " Unavailable", "video_length": 401.041, "url": "https://www.youtube.com/watch?v=MebophtkgsE"}, "https://www.youtube.com/watch?v=xzQywQLbO9M": {"title": "Pelosi Is In Trouble As More and More House Democrats Say No", "content creator": "The Next News Network", "description": "Stay Up To Date With Noble Gold YouTube\nhttps://youtube.com/c/NobleGoldInvest...\nNoble Gold is Who I Trust ^^^\n\nGet more at ", "date": "Dec 25, 2021", "views": "116,267 views", "comments": "1,570", "likes": "15,569 likes", "dislikes": " Unavailable", "video_length": 216.801, "url": "https://www.youtube.com/watch?v=xzQywQLbO9M"}, "https://www.youtube.com/watch?v=N89rhthui2I": {"title": "Audience Were In PERFECT SILENCE When She Performed! BEAUTIFUL!", "content creator": "PS", "description": "►\n► ► CLICK HERE to Learn How To Sing ► http://eSingingTalent.com/Learn-To-Sing ◄\n►\n\nAudience Were In PERFECT SILENCE In Rachel Wooding's Performance| Britain's Got Talent Audition 2016", "date": "Apr 7, 2017", "views": "12,219,069 views", "comments": "2,540", "likes": "76,508 likes", "dislikes": " Unavailable", "video_length": 276.461, "url": "https://www.youtube.com/watch?v=N89rhthui2I"}, "https://www.youtube.com/watch?v=uDwW-De29aw": {"title": "15 Largest & Insane Military Vehicles", "content creator": "Top Fives", "description": "The militaries of the world have invested billions in land, air, and seafaring vehicles. And some of them look absolutely incredible. Today we'll be taking a look at the most powerful, and the most unique vehicles in the world. Here are the top 15 largest and most insane military vehicles.", "date": "Sep 10, 2021", "views": "773,166 views", "comments": "208", "likes": "3,675 likes", "dislikes": " Unavailable", "video_length": 979.441, "url": "https://www.youtube.com/watch?v=uDwW-De29aw"}, "https://www.youtube.com/watch?v=hg4wqkCwDPU": {"title": "McCarthy vows to kick extremist Democrats off committees if GOP wins House", "content creator": "Fox News", "description": "Rep. Kevin McCarthy lays out vision for a potential GOP majority on 'Hannity.'\n#FoxNews #Hannity", "date": "Jan 12, 2022", "views": "167,839 views", "comments": "1,672", "likes": "7,004 likes", "dislikes": " Unavailable", "video_length": 364.321, "url": "https://www.youtube.com/watch?v=hg4wqkCwDPU"}, "https://www.youtube.com/watch?v=ikxomajuWLM": {"title": "Lyft driver shoots two suspects attempting to carjack vehicle in Philadelphia, police say", "content creator": "FOX 29 Philadelphia", "description": "An unidentified man is in critical condition after he and another man were reportedly attempting to carjack a Lyft driver's car and the licensed-to-carry Lyft driver shot him in West Philadelphia Monday afternoon.\n\nMORE: ", "date": "Jan 4, 2022", "views": "857,788 views", "comments": "9,493", "likes": "17,451 likes", "dislikes": " Unavailable", "video_length": 265.181, "url": "https://www.youtube.com/watch?v=ikxomajuWLM"}, "https://www.youtube.com/watch?v=BzebaSukpQg": {"title": "Robin Williams Last Interview Before Suicide", "content creator": "FlickFlock", "description": "Beloved actor Robin Williams was found dead on Monday, police reported.\n\nHe was 63.\n\nThe apparent cause of death was suicide by asphyxiation, authorities said. According to his publicist, Williams had been battling severe depression.\n\nWilliams was best known for his starring roles in classic comedies like Mrs. Doubtfire, Good Morning, Vietnam and Jumanji, but also in dramas like Dead Poets Society. He won the Academy Award for Best Supporting Actor for his portrayal of Dr. Sean Maguire in Good Will Hunting. He rose to fame while playing Mork the alien in the TV show Mork & Mindy, a Happy Days spinoff.\n\nMost recently, Williams had starred in the new CBS sitcom 'The Crazy Ones.' It was cancelled after just one season. At his time of death, a sequel to Mrs. Doubtfire was in the works.\n\nSusan Schneider, the actor's wife, released the following statement to the New York Times' Dave Itzkoff:\n\n\"This morning, I lost my husband and my best friend, while the world lost one of its most beloved artists and beautiful human beings. I am utterly heartbroken. On behalf of Robin's family, we are asking for privacy during our time of profound grief. As he is remembered, it is our hope that the focus will not be on Robin's death but on the countless moments of joy and laughter he gave to millions.\"", "date": "Aug 11, 2014", "views": "11,340,907 views", "comments": "18,047", "likes": "84,684 likes", "dislikes": " Unavailable", "video_length": 89.401, "url": "https://www.youtube.com/watch?v=BzebaSukpQg"}, "https://www.youtube.com/watch?v=ciN4j1RUFkw": {"title": "Marine Combat on 'Bloody Nose Ridge' in the The Pacific's Battle of Peleliu with Frank Pomroy", "content creator": "American Veterans Center", "description": "A veteran of the Guadalcanal Campaign, Frank Pomroy had already been hardened by fierce combat by the time he hit the beaches of Peleliu in September of 1944. However no amount of combat experience could prepare Frank, or his fellow Marines, for the hell that they were about to encounter on that small coral island. \n\nFrank Pomroy would later be immortalized in a chance photo captured right after the long battle for Hill 200 near the Peleliu Airport. The photo shows an injured Pomroy, weary and exhausted from battle, resting his head in his hands.  The photo is seen in the thumbnail of this video.\n\nLearn more about the American Veterans Center: ", "date": "Sep 21, 2021", "views": "524,860 views", "comments": "811", "likes": "8,309 likes", "dislikes": " Unavailable", "video_length": 1499.781, "url": "https://www.youtube.com/watch?v=ciN4j1RUFkw"}, "https://www.youtube.com/watch?v=yQDnwbav-cE": {"title": "Never swim in this Australian river", "content creator": "MrBallen", "description": "🎃 This is video number 6 of the 2021 Halloween \"Scare-A-Thon\" which features some of the scariest stories on the internet... boo!\n\nTime Stamp:\n#1 -- \"Black Water\" -- ", "date": "Oct 22, 2021", "views": "3,482,646 views", "comments": "17,673", "likes": "178,959 likes", "dislikes": " Unavailable", "video_length": 1380.381, "url": "https://www.youtube.com/watch?v=yQDnwbav-cE"}, "https://www.youtube.com/watch?v=RQ2THtQdWgk": {"title": "Vietnam 🇻🇳 1969: First Infantry Division; Lai Khe", "content creator": "Patrick Guy", "description": "God bless the men who gave the ultimate sacrifice 🙏they are the true heros.\n\nThere is a 24 minute version of my tour also on this channel.\n\nIn addition I have written a book entitled “Vietnam 1969: A Gunt’s View”, about my tour which I am selling for $20. \n\nIf interested send check to:\n\nP Guy\n1108 Saint Charles Ave \nSaint Charles, Missouri \n63301\n\nThanks for watching my video 👍", "date": "Jul 27, 2021", "views": "75,746 views", "comments": "69", "likes": "783 likes", "dislikes": " Unavailable", "video_length": 485.601, "url": "https://www.youtube.com/watch?v=RQ2THtQdWgk"}, "https://www.youtube.com/watch?v=6xpOD9SyksY": {"title": "No motivation to do cold showers? | Wim Hof", "content creator": "Wim Hof", "description": "With cold weather settling in, we might find it harder to find the motivation to turn that knob all the way to cold water. Here's how to find your inner strength to do this! \n\nIf you enjoyed this video LIKE & SUBSCRIBE for more! \n\n=====\n\nWant to discover & learn more about the Wim Hof Method?\n\nJOIN THE FREE MINI CLASS:", "date": "Nov 19, 2021", "views": "249,809 views", "comments": "992", "likes": "13,589 likes", "dislikes": " Unavailable", "video_length": 139.921, "url": "https://www.youtube.com/watch?v=6xpOD9SyksY"}, "https://www.youtube.com/watch?v=oy3t9zag2oE": {"title": "British PM Boris Johnson Facing Calls To Resign For Attending 2020 Party", "content creator": "NBC News", "description": "U.K. Prime Minister Boris Johnson apologizes before Parliament for attending a party in May 2020 at the height of the pandemic when gatherings were forbidden. NBC News’ Matt Bradley reports why his own party is calling for Johnson to step down. \n» Subscribe to NBC News: ", "date": "Jan 12, 2022", "views": "24,159 views", "comments": "137", "likes": "258 likes", "dislikes": " Unavailable", "video_length": 263.981, "url": "https://www.youtube.com/watch?v=oy3t9zag2oE"}, "https://www.youtube.com/watch?v=1UsEgWZV-Vk": {"title": "5 TFSA Mistakes YOU MUST Avoid", "content creator": "Parallel Wealth", "description": "Our free retirement ready e-book: https://www.parallelwealth.com/youtub...\n\nThere are a number of different reasons why you may not be using your TFSA correctly. Maybe you do not understand the difference between a beneficiary or a successor holder, or maybe you are stuck on what a TFSA can actually provide for you because it was poorly advertised early on. \n\nWhatever reason it may be, in this video we'll go through the 5 main mistakes that we often see when we meet with our clients. By the end of the video, you'll get a good idea of when & how you should be investing within your TFSA, as well as some planning strategies so that you can take full advantage of the tax benefits that come with a TFSA.\n\n6 ways to level up your financial plan:\nPersonal Finance for Canadians for Dummies: ", "date": "May 5, 2021", "views": "345,604 views", "comments": "721", "likes": "10,868 likes", "dislikes": " Unavailable", "video_length": 696.401, "url": "https://www.youtube.com/watch?v=1UsEgWZV-Vk"}, "https://www.youtube.com/watch?v=rWnCk_86KVE": {"title": "Cosmic Dreams VFX - Let Go of Your Negative Energy - Get Inspired - Relaxation Music", "content creator": "Brainwave Music", "description": "With this video we encourage you to reflect on positive energy by imagining the good humanity can bring to this world. Channel this positive energy towards the people you believe need it. Cleanse your Chakra through good will and good karma. Imagine if every view on this video directed their positive energy towards the problems of the world. Collectively our power and energy is strong, and with it we can enlighten each other to make the world a better place. We hope you enjoy this music, and that we can manifest some good into the world. As for the inception, i found that this music really reminded me the movie inception. Which made me think about how we can use dreams to not only question our reality but to examine ourselves and our energy. Looking into oneself, and challenging your view of yourself and of the world, with the goal of creating a brighter future.\n\n Please take a moment to read through our affiliate partners below. In all transparency, we do make a commission on any business we send their way. This helps us to fund the channel and not rely so heavily on Youtube advertising.  We have checked all our affiliates out to make sure they are all legit and we will never put anything in front of you that we have not checked out properly. \n\nAvailable Artwork NFTs: www.opensea.com/brainwaveart\nFollow Us on Instagram: ", "date": "Feb 19, 2020", "views": "1,484,106 views", "comments": "1,925", "likes": "44,519 likes", "dislikes": " Unavailable", "video_length": 10853.101, "url": "https://www.youtube.com/watch?v=rWnCk_86KVE"}, "https://www.youtube.com/watch?v=lHR5r2jJ8bI": {"title": "De-Googling your phone! Retired forensic investigator gives tips on protecting your privacy", "content creator": "Rebel News", "description": "Vincent Gircys is a retired Ontario Provincial Police officer with a degree in Electronic Engineering Technology.\nFULL REPORT from Tamara Ugolini ► https://rebelne.ws/3n53HG5", "date": "Jan 7, 2022", "views": "50,902 views", "comments": "593", "likes": "3,250 likes", "dislikes": " Unavailable", "video_length": 1307.121, "url": "https://www.youtube.com/watch?v=lHR5r2jJ8bI"}, "https://www.youtube.com/watch?v=zHvtCQaAWgQ": {"title": "Betty White's Lifestyle ★ 2021", "content creator": "Lifestyle & Net Worth", "description": "Lifestyle 2020 ★ Betty White's Net Worth 2020\n\nHelp Us Get To 1 Million Subscribers! SUBSCRIBE HERE: https://goo.gl/5AY56P", "date": "Jan 21, 2021", "views": "619,897 views", "comments": "807", "likes": "12,455 likes", "dislikes": " Unavailable", "video_length": 615.501, "url": "https://www.youtube.com/watch?v=zHvtCQaAWgQ"}, "https://www.youtube.com/watch?v=xjxENtG6HDQ": {"title": "Novak Djokovic's visa cancellation case to be heard by full court in federal court of Australia", "content creator": "WION", "description": "Australia has cancelled Tennis star Novak Djokovic's visa for the second time. Novak Djokovic's visa cancellation case to be heard by full court in federal court of Australia on Sunday.", "date": "Jan 15, 2022", "views": "48,969 views", "comments": "1,138", "likes": "362 likes", "dislikes": " Unavailable", "video_length": 325.441, "url": "https://www.youtube.com/watch?v=xjxENtG6HDQ"}, "https://www.youtube.com/watch?v=frFgq8I9bmM": {"title": "Charles Barkley and Shaq Being Best Friends For 4 Minutes Straight...", "content creator": "Dat Balla Productions", "description": "Even though they always are roasting each other, Charles Barkley and Shaq have a lot of respect for each other, and are actually pretty good friends. Everybody loves watching them clown on each other, and while it's always surprising, it is cool in these rare moments when we get to see Shaq and Charles Barkley act towards each other like this...\n\nSubscribe for more funny Charles Barkley and Inside The NBA videos!!!", "date": "Jan 11, 2022", "views": "435,594 views", "comments": "345", "likes": "5,569 likes", "dislikes": " Unavailable", "video_length": 285.701, "url": "https://www.youtube.com/watch?v=frFgq8I9bmM"}, "https://www.youtube.com/watch?v=Fy5UJKz5igY": {"title": "Historic inflation under Biden now leading to empty shelves", "content creator": "Fox News", "description": "'Outnumbered' panel react to a D.C. shopper comparing the empty grocery store shelves to the Soviet Union. #FoxNews", "date": "Jan 12, 2022", "views": "217,496 views", "comments": "2,396", "likes": "6,291 likes", "dislikes": " Unavailable", "video_length": 523.601, "url": "https://www.youtube.com/watch?v=Fy5UJKz5igY"}, "https://www.youtube.com/watch?v=KVtxPeqY948": {"title": "Mozart - Classical Music for Working, Studying & Brain Power", "content creator": "HALIDONMUSIC", "description": "🎵 Buy the MP3 album on the Official Halidon Music Store: https://bit.ly/3o0R2Vq\n🎧 Listen to our playlist on Spotify: http://bit.ly/MozartEssentialClassics", "date": "Dec 6, 2021", "views": "179,577 views", "comments": "96", "likes": "2,460 likes", "dislikes": " Unavailable", "video_length": 9693.541, "url": "https://www.youtube.com/watch?v=KVtxPeqY948"}, "https://www.youtube.com/watch?v=eEvL5ueufcs": {"title": "Gen. Keane responds to Biden's demand he resign or be fired", "content creator": "Fox News", "description": "Fox News senior strategic analyst Jack Keane is among the military academy board members who were told to step down by the Biden administration.\n\nSubscribe to Fox News! ", "date": "Sep 9, 2021", "views": "2,398,323 views", "comments": "11,180", "likes": "47,905 likes", "dislikes": " Unavailable", "video_length": 250.461, "url": "https://www.youtube.com/watch?v=eEvL5ueufcs"}, "https://www.youtube.com/watch?v=-i-ZAz9EX3A": {"title": "The Funniest Signs Ever, And The Puns Are Priceless", "content creator": "Happy Live", "description": "The Funniest Signs Ever, And The Puns Are Priceless\n\nWe wish you will always be happy when you wake up. Here we collect funny pictures, stories related to everyday life that you and I may have experienced.\nIf that sounds good, please subscribe to the channel to follow our next products.\nSub: ", "date": "Dec 22, 2021", "views": "295,722 views", "comments": "Error found: Message: \nStacktrace:\n#0 0x55b3d678da23 <unknown>\n#1 0x55b3d6258e18 <unknown>\n#2 0x55b3d628f151 <unknown>\n#3 0x55b3d628f311 <unknown>\n#4 0x55b3d62c1ec4 <unknown>\n#5 0x55b3d62ac9bd <unknown>\n#6 0x55b3d62bfc5b <unknown>\n#7 0x55b3d62ac883 <unknown>\n#8 0x55b3d62823fa <unknown>\n#9 0x55b3d62834c5 <unknown>\n#10 0x55b3d67bd16d <unknown>\n#11 0x55b3d67d35bb <unknown>\n#12 0x55b3d67bee75 <unknown>\n#13 0x55b3d67d3e85 <unknown>\n#14 0x55b3d67b286f <unknown>\n#15 0x55b3d67eeae8 <unknown>\n#16 0x55b3d67eec68 <unknown>\n#17 0x55b3d6809aad <unknown>\n#18 0x7fd8633ee6db <unknown>\n", "likes": "4,125 likes", "dislikes": " Unavailable", "video_length": 584, "url": "https://www.youtube.com/watch?v=-i-ZAz9EX3A"}, "https://www.youtube.com/watch?v=XaA_fHkUYNs": {"title": "Victor Davis Hanson on How Environmental Regulations \"Killed\" Farming in California", "content creator": "Breitbart News", "description": "Ostensibly environmental regulations restricting water diversion and use have “killed” farming in California, historian and professor Victor Davis Hanson, author of The Dying Citizen: How Progressive Elites, Tribalism, and Globalization Are Destroying the Idea of America, explained in an interview with Breitbart News Editor-in-Chief Alex Marlow.", "date": "Jan 6, 2022", "views": "14,428 views", "comments": "63", "likes": "684 likes", "dislikes": " Unavailable", "video_length": 579.481, "url": "https://www.youtube.com/watch?v=XaA_fHkUYNs"}, "https://www.youtube.com/watch?v=JDt_2UP_g6o": {"title": "Bob Hope & Dean Martin Carson Tonight Show 1975", "content creator": "Archy L", "description": "", "date": "Aug 6, 2017", "views": "1,140,637 views", "comments": "792", "likes": "5,919 likes", "dislikes": " Unavailable", "video_length": 1470.621, "url": "https://www.youtube.com/watch?v=JDt_2UP_g6o"}, "https://www.youtube.com/watch?v=xB-7t51_6uY": {"title": "Kid tries to buy an RTX GPU in 2022", "content creator": "NikTek", "description": "What a way to start this new Year, Nvidia revealed some new GPUs like the RTX 3050,RTX 3090 Ti and RTX 3080 12GB variant. But the price of them hasn't been getting any cheaper at all. Retailers are selling these GPUs at 2x MSRP and this meme that I made just illustrates how the situation really is...\n\nWanna Connect with me? Here's where to find me on Social Media:\n\nDiscord:", "date": "Jan 11, 2022", "views": "358,851 views", "comments": "Error found: Message: \nStacktrace:\n#0 0x55b3d678da23 <unknown>\n#1 0x55b3d6258e18 <unknown>\n#2 0x55b3d628f151 <unknown>\n#3 0x55b3d628f311 <unknown>\n#4 0x55b3d62c1ec4 <unknown>\n#5 0x55b3d62ac9bd <unknown>\n#6 0x55b3d62bfc5b <unknown>\n#7 0x55b3d62ac883 <unknown>\n#8 0x55b3d62823fa <unknown>\n#9 0x55b3d62834c5 <unknown>\n#10 0x55b3d67bd16d <unknown>\n#11 0x55b3d67d35bb <unknown>\n#12 0x55b3d67bee75 <unknown>\n#13 0x55b3d67d3e85 <unknown>\n#14 0x55b3d67b286f <unknown>\n#15 0x55b3d67eeae8 <unknown>\n#16 0x55b3d67eec68 <unknown>\n#17 0x55b3d6809aad <unknown>\n#18 0x7fd8633ee6db <unknown>\n", "likes": "22,857 likes", "dislikes": " Unavailable", "video_length": 68.681, "url": "https://www.youtube.com/watch?v=xB-7t51_6uY"}, "https://www.youtube.com/watch?v=9F9ahZQ7oP0": {"title": "RetroAhoy: The Secret of Monkey Island", "content creator": "Ahoy", "description": "Next up: Chicken-o-meter.\nPatreon: https://www.patreon.com/ahoy", "date": "May 18, 2018", "views": "2,063,540 views", "comments": "5,080", "likes": "58,928 likes", "dislikes": " Unavailable", "video_length": 4433.401, "url": "https://www.youtube.com/watch?v=9F9ahZQ7oP0"}, "https://www.youtube.com/watch?v=MG1LnNwuf4Y": {"title": "after nvidia rtx 3090 Ti launch, their family looks like", "content creator": "S T A R R I M S", "description": "", "date": "Jan 8, 2022", "views": "25,733 views", "comments": "83", "likes": "1,548 likes", "dislikes": " Unavailable", "video_length": 28.661, "url": "https://www.youtube.com/watch?v=MG1LnNwuf4Y"}, "https://www.youtube.com/watch?v=OqpumEZmxa0": {"title": "Ghostbusters promotional film for Showest 1984 Bill Murray & Dan Aykroyd", "content creator": "FT Depot", "description": "35mm scan of the film print shown to the cinema exhibition industry at the Showest convention in 1984 to promote the upcoming film \"Ghostbusters\".\n\nNote the actual film clips shown are not included here, only the intro/outro footage by Bill Murray and Dan Aykroyd.", "date": "May 16, 2020", "views": "102,488 views", "comments": "348", "likes": "3,490 likes", "dislikes": " Unavailable", "video_length": 228.661, "url": "https://www.youtube.com/watch?v=OqpumEZmxa0"}, "https://www.youtube.com/watch?v=N8ag4k8rCGw": {"title": "Snotty Boy Titan Glow Up Meme (GPU Edition)", "content creator": "NikTek", "description": "Hey You, Wanna Connect with me? Here's where to find me on Social Media:\n\nDiscord:", "date": "Oct 14, 2021", "views": "890,906 views", "comments": "1,642", "likes": "50,719 likes", "dislikes": " Unavailable", "video_length": 32.061, "url": "https://www.youtube.com/watch?v=N8ag4k8rCGw"}, "https://www.youtube.com/watch?v=amQ28UySNHU": {"title": "Reporter Points Out How Dumb Psaki: \"You refuses to admit to any mistakes?\"", "content creator": "Epoch US News", "description": "#BidenJokes #BidenMeme\nReporter Points Out How Dumb Psaki: \"You refuses to admit to any mistakes?\"", "date": "Jan 13, 2022", "views": "501,313 views", "comments": "4,086", "likes": "10,678 likes", "dislikes": " Unavailable", "video_length": 163.841, "url": "https://www.youtube.com/watch?v=amQ28UySNHU"}, "https://www.youtube.com/watch?v=6ce11_sIhc0": {"title": "Andrew Garfield set leak SUBTITLED", "content creator": "malkinky", "description": "Dubbed Version: https://www.youtube.com/watch?v=TvFgg...\nNobody is 100% sure about this line, it's probably too weird and intricate. Can you help me out in the comments?\n\nPossibilities:\n\n\"SO YOU'VE LIKE WEB-BLOOD\"\nThe pair of RAIMI hands on the left are facing upside and they're shaking like they're \"indicated\" as the subject of their dialogue.\nSo Andrew may have asked Tobey \"where are your web shooters?\" and then at the answer he said \"Oh\" (As you can see at the beginning of the leak) and then said \"So you have like web-blood\"\n\n\"SO WHAT IF I'M NOT?\"\n(a generic line that matches 100% with Andrew's labial)\n\n\"@#@# BELONG\"\n(Belong matches a lot with the labial too)\n\nWhat do you think he's saying? Is this a leak or just an old cut scene?\nLet me know! I'll try to answer every comment!\n\nmy instagram: ", "date": "Sep 12, 2021", "views": "4,284,934 views", "comments": "3,450", "likes": "80,583 likes", "dislikes": " Unavailable", "video_length": 36.261, "url": "https://www.youtube.com/watch?v=6ce11_sIhc0"}, "https://www.youtube.com/watch?v=KeqBbO_jpXk": {"title": "Every American Needs To Hear This Speech", "content creator": "PragerU", "description": "If every high school principal said this, it would change students' lives and would change America. So what exactly should every high school principal say? Dennis Prager explains. \nDonate today to PragerU! http://l.prageru.com/2ylo1Yt", "date": "Aug 29, 2016", "views": "5,609,147 views", "comments": "18,903", "likes": "92,767 likes", "dislikes": " Unavailable", "video_length": 350.181, "url": "https://www.youtube.com/watch?v=KeqBbO_jpXk"}, "https://www.youtube.com/watch?v=1v32Op5Uwdc": {"title": "Meet the Richest Man Who Ever Lived", "content creator": "Thoughty2", "description": "Listen to my new podcast Random Interesting Facts: http://bit.ly/RIFThoughty2\nOr watch it on YouTube: http://bit.ly/RIFPodcastYT", "date": "Jun 28, 2021", "views": "4,529,387 views", "comments": "13,704", "likes": "145,563 likes", "dislikes": " Unavailable", "video_length": 893.761, "url": "https://www.youtube.com/watch?v=1v32Op5Uwdc"}, "https://www.youtube.com/watch?v=HBOl26hRV4U": {"title": "Tom Holland being the cutest human for 18 minutes straight", "content creator": "wickedloki", "description": "", "date": "Jan 17, 2019", "views": "9,740,360 views", "comments": "11,047", "likes": "372,261 likes", "dislikes": " Unavailable", "video_length": 1078.721, "url": "https://www.youtube.com/watch?v=HBOl26hRV4U"}, "https://www.youtube.com/watch?v=ek-sbs_JW8Q&t=37s": {"title": "Why You Can't Trust the Mainstream Media: A Video Marathon", "content creator": "PragerU", "description": "Viewer trust in legacy media is at an all-time low. What's behind this? Is there good reason for it? What have been the media's biggest, most damaging lies? Fifteen 5-Minute Videos explore these questions and more in this specially-curated playlist. Enjoy!", "date": "Premiered Jan 3, 2022", "views": "65,240 views", "comments": "304", "likes": "4,718 likes", "dislikes": " Unavailable", "video_length": 3219.601, "url": "https://www.youtube.com/watch?v=ek-sbs_JW8Q&t=37s"}, "https://www.youtube.com/watch?v=MgWGI2Py5Po": {"title": "What COBRA KAI Really Looks Like Without CGI", "content creator": "Movie Addicts", "description": "What COBRA KAI Really Looks Like Without CGI season 4\n✅ Subscribe to us → https://www.youtube.com/channel/UC3va... \n🔔 Turn on notifications to never miss a new upload!\n\nAbout Cobra Kai: Thirty-four years after his defeat in the 1984 All-Valley Karate Tournament, Johnny Lawrence, now in his 50s, works as a part-time handyman and lives in an apartment in Reseda, Los Angeles, having fallen far from the wealthy lifestyle in Encino that had been enabled by his verbally abusive step-father, Sid Weinberg. He has a son, Robby Keene, with ex-girlfriend Shannon Keene, but he abandoned them both when both Robby was born and Johnny's mother Laura died on the same day. Johnny, admittedly, has never recovered from his breakup with then high school girlfriend, Ali Mills. After losing his job, a down-and-out Johnny rescues his teenage neighbour Miguel Diaz from a gang of bullies using karate. \n\nVisual effects (abbreviated VFX) is the process by which imagery is created or manipulated outside the context of a live action shot in filmmaking. The integration of live action footage and CG elements to create realistic imagery is called VFX.\n\nThirty-four years after his defeat in the 1984 All-Valley Karate Tournament, Johnny Lawrence, now in his 50s, works as a part-time handyman and lives in an apartment in Reseda, Los Angeles, having fallen far from the wealthy lifestyle in Encino that had been enabled by his verbally abusive step-father, Sid Weinberg. He has a son, Robby Keene, with ex-girlfriend Shannon Keene, but he abandoned them both when both Robby was born and Johnny's mother Laura died on the same day. Johnny, admittedly, has never recovered from his breakup with then high school girlfriend, Ali Mills.\n\nAfter losing his job, a down-and-out Johnny rescues his teenage neighbor Miguel Diaz from a gang of bullies using karate. Miguel, an asthmatic child raised by his Ecuadorian single mother Carmen, asks Johnny to teach him. Initially reluctant, Johnny finally agrees and decides to reopen the Cobra Kai karate dojo as a chance to recapture his past; however, this act reawakens his rivalry with Daniel LaRusso. Daniel, now the owner of a highly successful car dealership chain, is married to Amanda and has two children: Samantha and Anthony. Daniel is finally living the wealthy lifestyle he envied as a child when he lived in Reseda. However, after his friend and mentor Mr. Miyagi died, Daniel's struggle to meaningfully connect with his children has disrupted the balance in his life. Meanwhile, his mother Lucille, his other source of support, has a complicated relationship with his wife Amanda.\n\nJohnny's dojo attracts a group of bullied social outcasts who find camaraderie and self-confidence under his tutelage, a marked contrast to the kind of students Tommy, Bobby, Dutch, Jimmy and Johnny were when training in the original Cobra Kai run by John Kreese. Johnny develops a bond with his first and best student, Miguel, in a manner that resembles the relationship between Daniel and Mr. Miyagi. Cobra Kai's philosophy, however, remains mostly unchanged, though Johnny tries to infuse it with more honor than Kreese did. Thus, Miguel develops into a very different kind of student than Daniel, or even Johnny, was; he also begins dating Samantha. Johnny's efforts to reform Cobra Kai are undermined by the unexpected reappearance of Kreese, who hopes to bring the dojo back to its originally ruthless form.\n\nAs a means of revenge against his estranged father, Robby convinces Amanda to hire him for a position at the LaRusso Auto dealership and develops a close friendship with Daniel (although Daniel is unaware of Robby's lineage). He even studies Mr. Miyagi's form of Karate with Daniel and becomes friendly with Samantha. She eventually joins her father's dojo, which ultimately leads to her breaking up with Miguel. Miguel later begins dating another Cobra Kai student, Tory, who is Sam's rival.\n\nThe developing story revolves around these primary relationships, which lead to conflicts that are ultimately the product of Daniel and Johnny's inability to move away from the past.\n\n\"Copyright Disclaimer Under Section 107 of the Copyright Act 1976, allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"\n\nHashtags:  ", "date": "Dec 27, 2020", "views": "5,602,329 views", "comments": "2,908", "likes": "93,759 likes", "dislikes": " Unavailable", "video_length": 613.581, "url": "https://www.youtube.com/watch?v=MgWGI2Py5Po"}, "https://www.youtube.com/watch?v=k-aZ6W4mRds": {"title": "Hailee Steinfeld’s Guide to Glowing Skin and Easy Everyday Makeup | Beauty Secrets | Vogue", "content creator": "Vogue", "description": "“Dickinson” actress Hailee Steinfeld shares her everyday skin-care routine and minimalist approach to makeup. \n\nShop this beauty routine:\n\nKora Organics Noni Glow Sleeping Mask: ", "date": "Dec 2, 2020", "views": "3,401,328 views", "comments": "2,767", "likes": "141,498 likes", "dislikes": " Unavailable", "video_length": 625.381, "url": "https://www.youtube.com/watch?v=k-aZ6W4mRds"}, "https://www.youtube.com/watch?v=paPZbasXNpA": {"title": "Ryan Grim: Fmr US Ambassador To Haiti Proposed “Prime Minister Solution” MONTHS Before Assassination", "content creator": "The Hill", "description": "Ryan Grim breaks down controversy surrounding March Congressional testimony from the former U.S. ambassador to Haiti. \n\nFor more from Ryan Grim, follow: ", "date": "Jan 13, 2022", "views": "32,616 views", "comments": "288", "likes": "818 likes", "dislikes": " Unavailable", "video_length": 727.841, "url": "https://www.youtube.com/watch?v=paPZbasXNpA"}, "https://www.youtube.com/watch?v=inEI6dp582Y": {"title": "BREAKING: Kevin McCarthy Speaks After Refusing To Cooperate With Jan. 6 Probe", "content creator": "The Hill", "description": "House Minority Leader Kevin McCarthy (R-Calif.) held a press conference Thursday a day after saying that he will not cooperate with the select committee investigating the Jan. 6, 2021, riot at the U.S. Capitol, asserting the panel \"is not conducting a legitimate investigation.\"\n\nREAD MORE: ", "date": "Jan 13, 2022", "views": "43,674 views", "comments": "605", "likes": "1,604 likes", "dislikes": " Unavailable", "video_length": 802.701, "url": "https://www.youtube.com/watch?v=inEI6dp582Y"}, "https://www.youtube.com/watch?v=PE15WrxSeVw": {"title": "", "content creator": "That's why MMA!", "description": "", "date": "", "views": "", "comments": "194", "likes": "18,997 likes", "dislikes": " Unavailable", "video_length": 1518.621, "url": "https://www.youtube.com/watch?v=PE15WrxSeVw"}, "https://www.youtube.com/watch?v=o4AS6OxjJ7k": {"title": "The Arrogance and Ignorance of \"Front Row America,\" with Chris Arnade | The Megyn Kelly Show", "content creator": "Megyn Kelly", "description": "Megyn Kelly is joined by Chris Arnade, photographer and author of Dignity: Seeking Respect in Back Row America, to discuss how out of touch \"Front Row America\" and America's elites are out of touch with the rest of the country.\n\nLIKE & SUBSCRIBE for new videos everyday: ", "date": "Jan 13, 2022", "views": "58,999 views", "comments": "179", "likes": "1,375 likes", "dislikes": " Unavailable", "video_length": 432.161, "url": "https://www.youtube.com/watch?v=o4AS6OxjJ7k"}, "https://www.youtube.com/watch?v=wSiHjKIckNM": {"title": "Top 3 SPOOKY stories from missing people FOUND ALIVE | Missing 411 (Part 21)", "content creator": "MrBallen", "description": "100s of people go missing every year under BAFFLING circumstances inside national parks and forests across North America. 1 former police detective, David Paulides, has researched 1000's of these cases, and some of them are truly mind blowing...\n\nMrBallen merchandise 👉 ", "date": "Premiered Jan 1, 2021", "views": "5,075,433 views", "comments": "12,530", "likes": "171,515 likes", "dislikes": " Unavailable", "video_length": 1366.121, "url": "https://www.youtube.com/watch?v=wSiHjKIckNM"}, "https://www.youtube.com/watch?v=x2m1xir2Yrw": {"title": "How to Season Steak Experiment - When to Salt Your Steaks, INCREDIBLE!", "content creator": "Red Meat Lover", "description": "In this video, we'll explore how to season steak experiment using salt and applying at different times - 1 min, 1 hour, and 1 DAY before cooking.  The results were surprising!\n\nOfficial Website - Red Meat Lover:  ", "date": "Mar 20, 2020", "views": "3,771,518 views", "comments": "3,342", "likes": "94,165 likes", "dislikes": " Unavailable", "video_length": 867.801, "url": "https://www.youtube.com/watch?v=x2m1xir2Yrw"}, "https://www.youtube.com/watch?v=2SxXjN7WT90": {"title": "Antarctica - A Frozen History", "content creator": "Benny The Bouncer", "description": "Antarctica - A Frozen History", "date": "May 21, 2016", "views": "2,939,567 views", "comments": "2,802", "likes": "15,325 likes", "dislikes": " Unavailable", "video_length": 5394.421, "url": "https://www.youtube.com/watch?v=2SxXjN7WT90"}, "https://www.youtube.com/watch?v=3iW8B0ZDauM": {"title": "Overwhelming 24 Hours in Nigeria (this is extreme)", "content creator": "Indigo Traveller", "description": "Nigeria is surreal. Go to https://curiositystream.thld.co/Indig... and use code INDIGO to save 25% off today, that’s only $14.99 a year. Thanks to Curiosity Stream for sponsoring today’s video.\n\n📸 My Instagram: ", "date": "Dec 26, 2021", "views": "777,937 views", "comments": "2,818", "likes": "16,922 likes", "dislikes": " Unavailable", "video_length": 1617.861, "url": "https://www.youtube.com/watch?v=3iW8B0ZDauM"}, "https://www.youtube.com/watch?v=b6OvrRbGU68": {"title": "World's Hardest Flash - Adam Ondra Climbs 5.15 (9a+) First Try", "content creator": "REEL ROCK", "description": "\"Flashing\" a climb means doing it bottom to top, with no falls, on your first try.  Adam Ondra, the best sport climber in the world, set himself an impossible-seeming goal of becoming the first person to flash a route rated 9a+ (5.15a). There were only a few climbs of the grade on the planet that he hadn't yet done or tried. He strategized for years, failed on several of them, and then in 2018 he finally succeeded, sending Alex Megos' route Supercrackinette, in St Leger, France. Luckily our team was there to capture this rare moment. \n\nThe full documentary, \"Age of Ondra,\" about Adam's climbing career and his epic mission to flash 9a+, is featured in Reel Rock 13. Check it out here: ", "date": "Jun 30, 2021", "views": "5,241,618 views", "comments": "3,513", "likes": "58,263 likes", "dislikes": " Unavailable", "video_length": 636.581, "url": "https://www.youtube.com/watch?v=b6OvrRbGU68"}, "https://www.youtube.com/watch?v=lQhI3Jb7vMg": {"title": "Being Mortal (full film) | FRONTLINE", "content creator": "FRONTLINE PBS | Official", "description": "How do you talk about death with a dying loved one? Dr. Atul Gawande explores death, dying and why even doctors struggle to discuss being mortal with patients, in this Emmy-nominated documentary.\n\n“Aging and dying — you can’t fix those,\" says Dr. Gawande. This film examines the relationships between doctors and patients nearing the end of life, and how the medical profession can better help people navigate mortality. The ultimate goal, after all, is not a good death but a good life — to the very end.\n\nThis journalism is made possible by viewers like you. \n\nSupport your local PBS station here: ", "date": "Mar 17, 2020", "views": "2,404,802 views", "comments": "3,583", "likes": "27,427 likes", "dislikes": " Unavailable", "video_length": 3241.701, "url": "https://www.youtube.com/watch?v=lQhI3Jb7vMg"}, "https://www.youtube.com/watch?v=hYB-2K-ic3U": {"title": "Snorkeling for KING Crab & Catching by HAND in Jamaica | Dinner is Served!", "content creator": "Kelly Young", "description": "For the link to the AirBnB we're staying at in this video ,click here https://abnb.me/CuxBsOe82lb\n\nTo contact \"Boom Boom' our event planner and driver for the entire trip, call or email him.\nemail- Wilsonevans12@yahoo.com\nphone number- 876 479 8289\n\nSHOP & SUPPORT CODES:\n-Promo code \"islandkey\" for 10% off Portable Grill: ", "date": "Dec 23, 2021", "views": "498,011 views", "comments": "590", "likes": "8,923 likes", "dislikes": " Unavailable", "video_length": 1631.701, "url": "https://www.youtube.com/watch?v=hYB-2K-ic3U"}, "https://www.youtube.com/watch?v=9_J0iOjAhcc": {"title": "START YOUR DAY POSITIVELY! | Tony Robbins Motivational Speeches", "content creator": "The Motivation", "description": "START YOUR DAY POSITIVELY! | Tony Robbins Motivational Speeches\n@Law of Attraction Coaching @The Motivation @Inspire Your Personal Growth \n\nSpeakers:\nTony Robbins \nMel Robbins\nJim Rohn\nBrendon Burchard\nJocko Willink\n\nTony Robbins\nVisit Tony Robbins' websites:", "date": "Sep 1, 2021", "views": "258,854 views", "comments": "99", "likes": "5,731 likes", "dislikes": " Unavailable", "video_length": 737.601, "url": "https://www.youtube.com/watch?v=9_J0iOjAhcc"}, "https://www.youtube.com/watch?v=nqNxSRcIQPY": {"title": "How Doctors Can Predict Who Dies From COVID", "content creator": "Doctor Mike Hansen", "description": "How doctors can predict which patients are more likely to die of COVID\n\nSeveral studies have come out about the COVID prognosis. As a result, we now have a powerful way to predict which patients with COVID pneumonia are more likely to die and require longer stays in the hospital. \n\nWe already know that less than 15% of people who get COVID have a severe disease to the point of requiring hospitalization. Less than 5% of people who get covid require ICU. For those with COVID pneumonia who require ICU, and for some of the other patients in the hospital who might not necessarily need ICU, these are the patients who have the cytokine storm that we keep hearing about, meaning the immune system is going haywire. There is a ton of inflammation in the body….especially the lungs. But now, we have a more specific way of predicting who is more likely to develop cytokine storm, and therefore more likely to die, and who is more likely to require a more extended stay in the hospital….and it's based on the bloodwork we get when patients are hospitalized.\n\n---------------------------------------------------------\nDoctor Mike Hansen's Programs ⏩ \nFULL Course for MORE ENERGY:", "date": "Nov 18, 2020", "views": "2,302,221 views", "comments": "6,033", "likes": "43,466 likes", "dislikes": " Unavailable", "video_length": 469.881, "url": "https://www.youtube.com/watch?v=nqNxSRcIQPY"}, "https://www.youtube.com/watch?v=OaqWkRZjPHM": {"title": "25 Minutes of Extreme Natural Disasters", "content creator": "Underworld", "description": "25 Minutes of Extreme Weather & Natural Disasters Caught on Camera\nSUBSCRIBE: https://bit.ly/3obsVlo", "date": "Jan 15, 2022", "views": "291,806 views", "comments": "222", "likes": "2,802 likes", "dislikes": " Unavailable", "video_length": 1519.281, "url": "https://www.youtube.com/watch?v=OaqWkRZjPHM"}, "https://www.youtube.com/watch?v=_lMVX2eDIfI": {"title": "Ave María en hebreo | Hail Mary in hebrew", "content creator": "Harpa Dei", "description": "Una composición propia del Ave María en hebreo.\nEl  video fue filmado en la Capilla de Nuestra Señora, ubicada en la nave derecha de la Iglesia de la archiabadía benedictina Beuron; un lugar que apreciamos de forma especial y que presenta las joyas del arte beuronense.\n\n\n___________________________________________________________________________\nwww.harpadei.com\nTelegram: ", "date": "Mar 12, 2021", "views": "909,474 views", "comments": "1,186", "likes": "Unavailable", "dislikes": " Unavailable", "video_length": 161.421, "url": "https://www.youtube.com/watch?v=_lMVX2eDIfI"}, "https://www.youtube.com/watch?v=mEgCI5fd5s4": {"title": "A housing bubble or #JustinFlation.", "content creator": "Pierre Poilievre", "description": "A housing bubble or #JustinFlation.", "date": "Jan 9, 2022", "views": "125,036 views", "comments": "2,382", "likes": "4,379 likes", "dislikes": " Unavailable", "video_length": 284.581, "url": "https://www.youtube.com/watch?v=mEgCI5fd5s4"}, "https://www.youtube.com/watch?v=wZWAtpRAXyA": {"title": "Most Dangerous Transports: Siberian Ice Road | Mega Transports | Free Documentary", "content creator": "Free Documentary", "description": "A Mega Transport on one of the most dangerous roads in the world – the Siberian Ice Road. It doesn't forgive mistakes. It's treacherous. And unpredictable. A life-threatening adversary that has left many fractured and broken.\n\nThe Kolymar mountain range in eastern Russia - an inhospitable frozen landscape. With temperatures as low as fifty degrees below. \nOnly in winter, when the snow buries the underlying mudflats, is this region accessible at all – over the Ice Road. \n\nOne of the biggest businesses in the area involves transports to gold mines! Sometimes what they need is a colossal machine-like Komatsu D four hundred and seventy-five A. It's one of the biggest bulldozers in the world. It weighs in at a hefty eighty-six tons – far more than the world’s heaviest tank.\n\nThe mega transport route leads from the Russian Magadan through the tundra of Siberia for a total of one thousand kilometers. \n\nOver snow-covered mountain passes, temporary bridges and unpaved ice roads. \n\nThere the truckers are on their own. Spare lines, workshops, rescue services of any kind – you won’t find any of these on the Ice Road! In order to reach the destination in time, the men will drive most of the way without breaks. Day and night.\nThe mine is basically still \"hibernating.\" But in a few days, this year's digging will begin. And, if the transport and bulldozer don't make it there in time, the mine could lose an estimated ton of gold this season!\n\nFor the drivers an icy, brutal battle: \"Man against Nature’s cold heart\". \n\n__________________________________________________________\n\nSubscribe Free Documentary Channel for free: ", "date": "Nov 24, 2019", "views": "7,093,330 views", "comments": "2,942", "likes": "54,533 likes", "dislikes": " Unavailable", "video_length": 2894.021, "url": "https://www.youtube.com/watch?v=wZWAtpRAXyA"}, "https://www.youtube.com/watch?v=-ybiXR2WCFQ": {"title": "Journey to the Andromeda Galaxy [4K]", "content creator": "SEA", "description": "The Andromeda Galaxy is our massive galactic neighbour, a spiral galaxy more than double the size of the Milky Way. In this video, we will be taking a journey, from this galaxy's ancient history, right up to its remote future- using the latest and most beautiful images to know our cosmic neighbour like never before. This is our journey to the Andromeda Galaxy...\n\nDo you use these videos to sleep or for night time watching? Check out the new sleeping space playlist, a collection of my most chilled out and ambient videos.", "date": "Jan 5, 2022", "views": "1,061,676 views", "comments": "1,317", "likes": "21,026 likes", "dislikes": " Unavailable", "video_length": 2118.701, "url": "https://www.youtube.com/watch?v=-ybiXR2WCFQ"}, "https://www.youtube.com/watch?v=4J8-wXomcZ4": {"title": "Cat D11 Dozer in Action.", "content creator": "Hastings Deering", "description": "THE ALL NEW CAT® D11 - MAKING THE BEST BETTER.\n\nHow do you make the industry’s best large dozer even better? By listening to our customers - the all new Cat D11 dozer delivers everything you love about the D11, with more productivity and efficiency than ever before.\n\nBacked with uncompromising service and expert solutions from Hastings Deering to keep you moving.\n\nLearn more here: ", "date": "May 7, 2020", "views": "1,750,683 views", "comments": "345", "likes": "8,326 likes", "dislikes": " Unavailable", "video_length": 164.901, "url": "https://www.youtube.com/watch?v=4J8-wXomcZ4"}, "https://www.youtube.com/watch?v=-xfra2_tVF8": {"title": "They Call These Chimps Lion Killers | Joe Rogan and Forrest Galante", "content creator": "JRE Clips", "description": "Taken from Joe Rogan Experience #1240 w/Forrest Galante: https://youtu.be/OT0ZIq-yWEM", "date": "Feb 6, 2019", "views": "7,857,759 views", "comments": "9,652", "likes": "76,893 likes", "dislikes": " Unavailable", "video_length": 384.181, "url": "https://www.youtube.com/watch?v=-xfra2_tVF8"}, "https://www.youtube.com/watch?v=Czc6aVYcjrM": {"title": "Denzel Washington tears up on 'Colbert' while talking about his late mother", "content creator": "The World News", "description": "Waterworks were flowing Wednesday on The Late Show With Stephen Colbert as Denzel Washington broke down while discussing his late mother, Lennis Washington, who died in June at the age of 97.\n\nColbert brought up a quote Washington said about a mother being a boy’s first true love, and the host asked the actor how he is honoring that love with his work. That’s when the Oscar winner was hit with some unexpected emotions.\n\n“A mother is a son's first true love. A son, especially that first son, is a mother's last true love,” Washington began. “That's... I'm getting choked up. Sorry.”\n\nWashington, who stars in the new Joel Coen film The Tragedy of Macbeth, went on to say that his mother was there for everything throughout his life and career, but “she went home,” before asking Colbert for a tissue.\n\nThe emotions of the moment caught up with viewers at home, who took to Twitter with comments like “Crying with Denzel Washington tonight was not something I had on my agenda.”\n\nThe Interesting Lists channel is a new media initiative that aims its viewers to spend their free time laughing, being surprised and learning new things, at the office, at school or at home, by telling their troubles with photos and subtitles.\n\nThe Interesting Lists channel has something to say about every topic and a creative list to prepare; That's why the Interesting Lists channel is not, and never will be, a single topic in focus.\n\nIt is not recommended for anyone under the age of 18 to visit the Interesting Lists channel. All written and visual materials described in this channel are unreal and fabricated.\n\n► Source: ", "date": "Dec 16, 2021", "views": "76,771 views", "comments": "73", "likes": "734 likes", "dislikes": " Unavailable", "video_length": 137.501, "url": "https://www.youtube.com/watch?v=Czc6aVYcjrM"}, "https://www.youtube.com/watch?v=vlS5jamJrd8": {"title": "Brian Johnson’s Audition for AC/DC (2011)", "content creator": "The Howard Stern Show", "description": "Brian Johnson told Howard in 2011 that just before his audition to join AC/DC he recorded a jingle for a vacuum commercial.  \n\nSUBSCRIBE for more videos: ", "date": "Nov 15, 2020", "views": "1,533,819 views", "comments": "279", "likes": "17,856 likes", "dislikes": " Unavailable", "video_length": 429.381, "url": "https://www.youtube.com/watch?v=vlS5jamJrd8"}, "https://www.youtube.com/watch?v=RWIOggQZ5ns": {"title": "How did clinical chemists respond to Elizabeth Holmes explanations? (Theranos)", "content creator": "SAWS", "description": "A rare Q&A between Elizabeth Holmes of Theranos and actual scientists from 2016.\n\nSources\n\nAmerican Association of Clinical Chemistry Presentation", "date": "Aug 31, 2021", "views": "370,914 views", "comments": "2,374", "likes": "6,214 likes", "dislikes": " Unavailable", "video_length": 1757.781, "url": "https://www.youtube.com/watch?v=RWIOggQZ5ns"}, "https://www.youtube.com/watch?v=FQ4WCKCFCL8": {"title": "Olympic Swimmer Attempts the Navy Seal Screening Test", "content creator": "Austen Alexander", "description": "Today Olympic Gold Medalist and 2x World Record breaker Markus Rogan attempts the Navy Seal Screening Test\n\nsubscribe or do 107 burpees \n\nI encourage you guys to give Dr. Markus a follow", "date": "Apr 4, 2021", "views": "6,240,768 views", "comments": "5,766", "likes": "96,580 likes", "dislikes": " Unavailable", "video_length": 868.601, "url": "https://www.youtube.com/watch?v=FQ4WCKCFCL8"}, "https://www.youtube.com/watch?v=eTFMY0FU4Os": {"title": "4 Levels of Pad Thai: Amateur to Food Scientist | Epicurious", "content creator": "Epicurious", "description": "We challenged chefs of three different skill levels - amateur John, home cook Natasha, and professional chef instructor King Phojanakong from The Institute of Culinary Education - to stir fry us their preferred Pad Thai recipe. Once each level of chef had finished and tasted their final product, we asked food scientist Rose to explain their choices from an expert's perspective. Which Pad Thai take the prize in your eyes?\n\nCheck out the level 3 recipe here on the ICE blog: ", "date": "Dec 23, 2020", "views": "1,046,443 views", "comments": "2,103", "likes": "17,973 likes", "dislikes": " Unavailable", "video_length": 1158.461, "url": "https://www.youtube.com/watch?v=eTFMY0FU4Os"}, "https://www.youtube.com/watch?v=VHa6vYq6Nyk": {"title": "The Bee Gees walk out of CLIVE ANDERSON TALKS BACK (BBC1, 30th October 1997)", "content creator": "GuildfordGhost", "description": "The famous interview, in full, of Clive Anderson annoying Barry Gibb so much, he walked off the show.  To be honest, Clive was pushing it a bit but Barry was nevertheless being a bit of a pompous tit.  I can't watch this without thinking of David Walliams' impersonation on ROCK PROFILES. [NB : I've disabled comments on this video because I'd just had enough of trolling behaviour]", "date": "Feb 9, 2010", "views": "5,825,373 views", "comments": "Error found: Message: \nStacktrace:\n#0 0x55cdc536da23 <unknown>\n#1 0x55cdc4e38e18 <unknown>\n#2 0x55cdc4e6f151 <unknown>\n#3 0x55cdc4e6f311 <unknown>\n#4 0x55cdc4ea1ec4 <unknown>\n#5 0x55cdc4e8c9bd <unknown>\n#6 0x55cdc4e9fc5b <unknown>\n#7 0x55cdc4e8c883 <unknown>\n#8 0x55cdc4e623fa <unknown>\n#9 0x55cdc4e634c5 <unknown>\n#10 0x55cdc539d16d <unknown>\n#11 0x55cdc53b35bb <unknown>\n#12 0x55cdc539ee75 <unknown>\n#13 0x55cdc53b3e85 <unknown>\n#14 0x55cdc539286f <unknown>\n#15 0x55cdc53ceae8 <unknown>\n#16 0x55cdc53cec68 <unknown>\n#17 0x55cdc53e9aad <unknown>\n#18 0x7f132bfce6db <unknown>\n", "likes": "15,975 likes", "dislikes": " Unavailable", "video_length": 599.201, "url": "https://www.youtube.com/watch?v=VHa6vYq6Nyk"}, "https://www.youtube.com/watch?v=lMnFnUIJxw8": {"title": "DESIRABLE WOMEN according to Jordan Peterson | Jordan Peterson Advice", "content creator": "Chaos & Order", "description": "Discussion on desirable women:\nDeciding if the person you are dating is also the one that you should marry may be the toughest thing to decide on especially nowadays with the presence of online dating, your options always seem limitless. But to Dr. Peterson, though your options of meeting people are endless, finding someone that will stick with you to the ver end is rare and if you find someone who has a chance to be your soulmate then you should not let that go. But how do you know if the person you're dating is the one, well in this video, Dr. Peterson shares with you the key traits to look for when deciding if she is the one.\n\nFollow and Join us on our Twitter and Discord Page!", "date": "Jul 7, 2021", "views": "1,220,624 views", "comments": "2,089", "likes": "28,843 likes", "dislikes": " Unavailable", "video_length": 484.681, "url": "https://www.youtube.com/watch?v=lMnFnUIJxw8"}, "https://www.youtube.com/watch?v=rnrK3zxsKdA": {"title": "Alone and Peace | Beautiful Ambient Mix", "content creator": "BLUME", "description": "💜 Your support means a lot • https://streamlabs.com/blumemusic\n\nMy other channels 🔎\nBLUM Gaming — ", "date": "Aug 10, 2018", "views": "3,720,098 views", "comments": "3,313", "likes": "76,429 likes", "dislikes": " Unavailable", "video_length": 4563.721, "url": "https://www.youtube.com/watch?v=rnrK3zxsKdA"}, "https://www.youtube.com/watch?v=I8Xc2_FtpHI": {"title": "2017 Maps of Meaning 01: Context and Background", "content creator": "Jordan B Peterson", "description": "In this lecture, I discuss the context within which the theory I am delineating through this course emerge: that of the cold war. What is belief? Why is it so important to people? Why will they fight to protect it? I propose that belief unites a culture's expectations and desires with the actions of its people, and that the match between those two allows for cooperative action and maintains emotional stability. I suggest, further, that culture has a deep narrative structure, presenting the world as a forum for action, with characters representing the individual, the known, and the unknown -- or the individual, culture and nature -- or the individual, order and chaos. \n\n--- SUPPORT THIS CHANNEL ---\n\nDirect Support: ", "date": "Jan 16, 2017", "views": "4,937,719 views", "comments": "5,759", "likes": "62,128 likes", "dislikes": " Unavailable", "video_length": 9086.901, "url": "https://www.youtube.com/watch?v=I8Xc2_FtpHI"}, "https://www.youtube.com/watch?v=AR-86T8jpuQ": {"title": "YOU ARE STRONG! An Incredible Speech by Jordan Peterson", "content creator": "Mulligan Brothers Interviews", "description": "SHOP - https://www.mulliganbrothers.com/\nYOU CAN GET THE FOOTAGE HERE - https://goo.gl/uiZjsw", "date": "Jun 25, 2018", "views": "2,584,582 views", "comments": "2,621", "likes": "45,072 likes", "dislikes": " Unavailable", "video_length": 4129.481, "url": "https://www.youtube.com/watch?v=AR-86T8jpuQ"}, "https://www.youtube.com/watch?v=uwUt1fVLb3E": {"title": "Alicia Keys: NPR Music Tiny Desk Concert", "content creator": "NPR Music", "description": "This performance was recorded on Feb. 12, 2020. We will continue releasing Tiny Desk videos of shows that had already been taped. In light of current events, NPR is postponing new live tapings of Tiny Desk Concerts. In the meantime, check out Tiny Desk (home) concerts! They’re recorded by the artists in their home. It’s the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nJune 17, 2020 | Abby O'Neill -- On a brisk February morning, Alicia Keys, full of effervescence, entered NPR through the loading dock wearing a canary yellow faux fur coat. During our ride to the fourth floor, she joked about how she hadn't been invited to play at the Tiny Desk. That, of course, wasn't exactly true. We worked on and off for years to make this moment happen, and I can say wholeheartedly that it was worth the wait.\n\nAlicia Keys has an aura that you can sense the second she enters a room, or in my case, an elevator. She radiates compassion and kindness. This spirit is the key to Keys's songwriting, which is rooted in introspection and mindfulness.\n\nAs she approached her piano, a bit surprised at the amount of people in the room, she smiled and remarked over her shoulder, \"Gee, the Tiny Desk is tiny!\" She kicked off the set with an uncanny ode to combat the darkness of this moment in American history: \"Show Me Love,\" a single she released in 2019. No one could have predicted then how much her lyrics and musical healing would be crucial during this emotionally fraught time of unprecedented political and racial unrest, heightened by three months of quarantine due to a global pandemic.\n\nThe stand-out moment during her Tiny Desk was the premiere of \"Gramercy Park\", a song from her upcoming self-titled album, ALICIA, which is set to be released this fall. It's one of those timeless songs that will transcend radio formats and genres, with lyrics that address how utter selflessness and worrying about making everyone happy but yourself can throw your own center askew. The song's spiritual refrain is sure to be a sing-along moment for the rest of Keys's career.\n\nShe told the crowd after \"Gramercy Park\" that she's struggled with appeasing people her whole life, but she's trying harder now to set boundaries. Luckily for the Tiny Desk audience, that resolution didn't pertain to this concert. After wrapping up what was to be a three-song set with her latest single \"Underdog,\" which you may have seen her perform at this year's Grammys, the crowd begged for an encore. After crowdsourcing suggestions, she and her band delivered a riveting rendition of Keys's breakout 2001 single, \"Fallin'.\"\n\nThe world, now more than ever, needs more love, reflection and accountability – a mantra that's woven into every fiber of Alicia Keys's being and every lyric of her songs.\n\nSET LIST\n\"Show Me Love\"\n\"Gramercy Park\"\n\"Underdog\"\n\"Fallin'\"\n\nMUSICIANS\nAlicia Keys: vocals, piano; RAII & Whitney: vocals; Ant Parrish: bass; Curt Chambers: guitar; Mike Reid: drums; Omar Edwards: keys.\n\nCREDITS\nProducers: Abby O'Neill, Morgan Noelle Smith, Kara Frame; Creative director: Bob Boilen; Audio engineers: Josh Rogosin, Natasha Branch; Videographers: Kara Frame, Maia Stern, Melany Rochester, Shanti Hands; Editor: Maia Stern; Associate Producer: Bobby Carter; Executive producer: Lauren Onkey; VP, programming: Anya Grundmann; Photo: Kisha Ravi/NPR", "date": "Jun 22, 2020", "views": "22,786,009 views", "comments": "11,080", "likes": "320,283 likes", "dislikes": " Unavailable", "video_length": 1666.841, "url": "https://www.youtube.com/watch?v=uwUt1fVLb3E"}, "https://www.youtube.com/watch?v=gH8XPT8cLQU": {"title": "How to Discipline your child and toddler, without hitting - Jordan Peterson", "content creator": "Dose of Truth", "description": "Please, like, share, subscribe and comment!\n\nJordan Peterson's Links:\nPatreon: ", "date": "Mar 15, 2018", "views": "1,650,844 views", "comments": "3,186", "likes": "43,177 likes", "dislikes": " Unavailable", "video_length": 585.581, "url": "https://www.youtube.com/watch?v=gH8XPT8cLQU"}, "https://www.youtube.com/watch?v=bBRgEDTWrB4": {"title": "Ibiza Summer Mix 2022 🍓 Best Of Tropical Deep House Music Chill Out Mix #26", "content creator": "Hot Vibes", "description": "Ibiza Summer Mix 2022 🍓 Best Of Tropical Deep House Music Chill Out Mix #26\n\n#Deephouse #Chillout #Houserelax2022 #Summermix2022 #Summermusicmix2022", "date": "Streamed live on Jan 15, 2022", "views": "13,703 views", "comments": "2", "likes": "68 likes", "dislikes": " Unavailable", "video_length": 42898.621, "url": "https://www.youtube.com/watch?v=bBRgEDTWrB4"}, "https://www.youtube.com/watch?v=9bamaEMftg4": {"title": "Natural versus vaccine immunity", "content creator": "Dr. John Campbell", "description": "Post infection natural immunity, debate and implications for mandatory vaccination\n\nhttps://www.bmj.com/content/374/bmj.n...", "date": "Oct 2, 2021", "views": "2,393,994 views", "comments": "17,021", "likes": "61,721 likes", "dislikes": " Unavailable", "video_length": 1314.201, "url": "https://www.youtube.com/watch?v=9bamaEMftg4"}, "https://www.youtube.com/watch?v=50l5xusNz-0": {"title": "January 6th, one...year...later!", "content creator": "Jericho Green", "description": "https://noblegoldinvestments.com/", "date": "Jan 8, 2022", "views": "34,010 views", "comments": "989", "likes": "4,933 likes", "dislikes": " Unavailable", "video_length": 1116.321, "url": "https://www.youtube.com/watch?v=50l5xusNz-0"}, "https://www.youtube.com/watch?v=XkWlIhaeuaY": {"title": "NEVER DO THIS....Revolver Edition", "content creator": "Jerry Miculek - Pro Shooter", "description": "Hey Everyone! Have had a lot of requests for some tips and tricks with the ole' revolver. Here's a few to get you started!! Let me know what you think!\n\nBecome a Member Here - ", "date": "Jul 8, 2020", "views": "1,139,025 views", "comments": "1,695", "likes": "40,060 likes", "dislikes": " Unavailable", "video_length": 356.681, "url": "https://www.youtube.com/watch?v=XkWlIhaeuaY"}, "https://www.youtube.com/watch?v=ZgE_x1-kkqY": {"title": "A. Vivaldi: Concerti con molti strumenti [Europa Galante - F. Biondi]", "content creator": "Dramma per musica", "description": "Antonio Vivaldi\n\nCONCERTO for 2 Mandolines, Strings and B.C. in G major RV 532 0:01", "date": "Jan 10, 2016", "views": "4,349,154 views", "comments": "1,186", "likes": "Unavailable", "dislikes": " Unavailable", "video_length": 8277.021, "url": "https://www.youtube.com/watch?v=ZgE_x1-kkqY"}, "https://www.youtube.com/watch?v=aG2QKRx6SbU": {"title": "[4K HDR] The Night of Apgujeong Alley in Gangnam where Luxury Brand Shops and Restaurants", "content creator": "Seoul Walker", "description": "Hello everyone, my name is Nathan, Seoul Walker 🚶🏻🐈\nToday, let's walk together through the night alleys of Apgujeong-dong, Gangnam-gu, Seoul. The area is home to clubs and bars, restaurants and cafes and luxury brand shops.\nThank you so much for coming to see my video today! Subscribers who are always my strength. Thank you as always! 💜😍\n\nFilmed: January 7th, 2022, 5:40pm (pre-recorded)\nWeather: Sunny 🌤\nTemperature: 0℃ / 32℉ 🌡\n\n🚨This is only one 'Seoul Walker' YouTube channel. Don't get confused with other imitation channels, thanks all! \n\n► Join Seoul Walker's Channel Membership!", "date": "Jan 9, 2022", "views": "42,806 views", "comments": "81", "likes": "1,322 likes", "dislikes": " Unavailable", "video_length": 4197.061, "url": "https://www.youtube.com/watch?v=aG2QKRx6SbU"}, "https://www.youtube.com/watch?v=fFF2GvkQfNU": {"title": "The 6 WARNING Signs of Dementia", "content creator": "Dr. Eric Berg DC", "description": "If you notice these early signs of dementia, you need to act now. \n\nGet Dr. Berg’s Nutritional Yeast Tablets (B Vitamins) Here: https://shop.drberg.com/nutritional-y...", "date": "Dec 16, 2021", "views": "2,686,196 views", "comments": "2,905", "likes": "54,052 likes", "dislikes": " Unavailable", "video_length": 836.301, "url": "https://www.youtube.com/watch?v=fFF2GvkQfNU"}, "https://www.youtube.com/watch?v=LZmC37hWUmk": {"title": "norm's roast of Bob Saget (full set save for rin tin tin)", "content creator": "I Didn't Even Know He Was Sick", "description": "the best ever. RIP to the both of em\n---------------------------------------------------------------------------------\nTHANK YOU FOR WATCHING\n---------------------------------------------------------------------------------\n► BUY NORM'S BOOK: ", "date": "Jan 9, 2022", "views": "519,745 views", "comments": "1,476", "likes": "7,942 likes", "dislikes": " Unavailable", "video_length": 495.061, "url": "https://www.youtube.com/watch?v=LZmC37hWUmk"}, "https://www.youtube.com/watch?v=L5YNt6_aTH0": {"title": "When you pull her hair and she gives you that look....", "content creator": "Jinyu", "description": "Check out Ryan's channel, the boy with the golden smile.\n\nhttps://youtube.com/channel/UC2vdWG-P...", "date": "Dec 19, 2016", "views": "10,364,010 views", "comments": "7,238", "likes": "436,826 likes", "dislikes": " Unavailable", "video_length": 7.361, "url": "https://www.youtube.com/watch?v=L5YNt6_aTH0"}, "https://www.youtube.com/watch?v=cwbd3s0nz3s": {"title": "Inmate saves baby from locked SUV using his car theft skills | ABC7", "content creator": "ABC7", "description": "UNLIKELY HERO: The local sheriff admitted it was a unique situation, allowing an inmate to use his skill set to break into a car for the right reasons. https://abc7.la/2SbfxMl", "date": "Feb 18, 2019", "views": "21,201,779 views", "comments": "28,960", "likes": "493,689 likes", "dislikes": " Unavailable", "video_length": 99.761, "url": "https://www.youtube.com/watch?v=cwbd3s0nz3s"}, "https://www.youtube.com/watch?v=eNeUu4QWDd0": {"title": "Woman's Boyfriend Tries To Win Over Her Possessive Bird | The Dodo Soulmates", "content creator": "The Dodo", "description": "Clingy bird was NOT happy when his mom got a boyfriend — watch the adorable way the guy ends up winning him over 💚\n\nKeep up with Dusty on TikTok: ", "date": "Nov 21, 2021", "views": "4,203,598 views", "comments": "4,924", "likes": "163,364 likes", "dislikes": " Unavailable", "video_length": 185.181, "url": "https://www.youtube.com/watch?v=eNeUu4QWDd0"}, "https://www.youtube.com/watch?v=7ZreRdTqLZc": {"title": "Watch 'The View's' Joy Behar Lose It When Faced with COVID Facts | Direct Message | Rubin Report", "content creator": "The Rubin Report", "description": "Dave Rubin of The Rubin Report talks about Joy Behar’s inability to deal with COVID facts from her former co-host of \"The View\" Jedediah Bila, Press Secretary Jen Psaki making the case that high gas prices are actually a good thing, and Ron DeSantis scoring a win against the Biden administration. First, Dave shares a clip from \"The View\" of Jedediah Bila being grilled by Joy Behar for being unvaccinated and against vaccine mandates. Watch how Joy, Sunny Hostin, and Whoopi Goldberg react when Jedediah reasonably asserts some basic established facts about how COVID is transmitted. Next, Dave shares a clip from a Jen Psaki press conference where she tries to convince reporters that high gas prices are actually beneficial because they will force us to increase our investment in renewable energy. Tell that to struggling families who are being crushed by inflation and climbing oil prices. Dave also shares a clip from the COP26 summit of Minister of Environment and Climate Change of Canada Steven Guilbeault demanding that indigenous people have a say in climate change solutions. Finally, Dave shares good news from Florida. Ron DeSantis and other governors challenged the Biden employer vaccine mandate and now courts have ordered a halt to the rule. Will red states like Florida be able to halt other federal COVID restrictions and  demands for proof of vaccination?\n\n----------\n\nToday’s Sponsors:\nCozy Earth - This holiday season, give the gift that will be appreciated every single night - Cozy Earth bedding and loungewear\nSleep comfortably year-round. Go to ", "date": "Streamed live on Nov 17, 2021", "views": "806,336 views", "comments": "5,607", "likes": "33,018 likes", "dislikes": " Unavailable", "video_length": 1886.741, "url": "https://www.youtube.com/watch?v=7ZreRdTqLZc"}, "https://www.youtube.com/watch?v=DLg2Q0daphE": {"title": "A Conversation so Intense It Might as Well Be Psychedelic | John Vervaeke | The JBP Podcast | S4 E34", "content creator": "Jordan B Peterson", "description": "On this Season 4, Episode 34 of the Jordan Peterson Podcast, Jordan is joined by John Vervaeke, a colleague of Jordan’s. John has been an associate professor in the teaching stream at the University of Toronto since 1994. He teaches courses in the Psychology department on thinking and reasoning with an emphasis on insight problem solving associated with creativity, cognitive development with an emphasis on the dynamic nature of development, and higher cognitive processes with an emphasis on intelligence, rationality, mindfulness, and the psychology of wisdom.\n\nJordan and John discuss how they know each other, the last time they saw one another, Christianity, power, perspective, atheists, religion, Heidegger, and much more.\nFind more about John Vervaeke online on his website ", "date": "Jun 28, 2021", "views": "586,322 views", "comments": "6,999", "likes": "18,381 likes", "dislikes": " Unavailable", "video_length": 9219.901, "url": "https://www.youtube.com/watch?v=DLg2Q0daphE"}, "https://www.youtube.com/watch?v=0AtTM9hgCDw": {"title": "Is There Life after Death? Fifty Years of Research at UVA", "content creator": "UVA Medical Center Hour", "description": "February 22, 2017\nJim B. Tucker\nBruce Greyson\nEdward F. Kelly\nJ. Kim Penberthy", "date": "Mar 7, 2017", "views": "1,763,108 views", "comments": "1,611", "likes": "17,214 likes", "dislikes": " Unavailable", "video_length": 3730.361, "url": "https://www.youtube.com/watch?v=0AtTM9hgCDw"}, "https://www.youtube.com/watch?v=XpMNoeIuEys": {"title": "Is Vladimir Putin the mastermind behind Russia's global web of poisoning? | Under Investigation", "content creator": "60 Minutes Australia", "description": "Subscribe here: http://9Soci.al/chmP50wA97J Full Episodes: https://9now.app.link/uNP4qBkmN6 | Putin's poison (2021)\n\nVladimir Putin’s 20 year campaign of terror seems to know no bounds. Referred to as ‘Putin’s Poison’, the chemical Novichok has been used to keep enemies at bay, like Russia's opposition leader Alexei Navalny. Now on Under Investigation, has Putin finally met his match? \n\nWATCH more of 60 Minutes Australia: ", "date": "Apr 21, 2021", "views": "1,644,446 views", "comments": "Error found: Message: \nStacktrace:\n#0 0x5647c1f4da23 <unknown>\n#1 0x5647c1a18e18 <unknown>\n#2 0x5647c1a4f151 <unknown>\n#3 0x5647c1a4f311 <unknown>\n#4 0x5647c1a81ec4 <unknown>\n#5 0x5647c1a6c9bd <unknown>\n#6 0x5647c1a7fc5b <unknown>\n#7 0x5647c1a6c883 <unknown>\n#8 0x5647c1a423fa <unknown>\n#9 0x5647c1a434c5 <unknown>\n#10 0x5647c1f7d16d <unknown>\n#11 0x5647c1f935bb <unknown>\n#12 0x5647c1f7ee75 <unknown>\n#13 0x5647c1f93e85 <unknown>\n#14 0x5647c1f7286f <unknown>\n#15 0x5647c1faeae8 <unknown>\n#16 0x5647c1faec68 <unknown>\n#17 0x5647c1fc9aad <unknown>\n#18 0x7fb6fc8316db <unknown>\n", "likes": "19,382 likes", "dislikes": " Unavailable", "video_length": 3001.621, "url": "https://www.youtube.com/watch?v=XpMNoeIuEys"}, "https://www.youtube.com/watch?v=-zg1j7Zquoc": {"title": "Covid: The Path not Taken - DarkHorse Podcast with Dr. Peter McCullough", "content creator": "Bret Weinstein", "description": "Dr. Peter McCullough is an academic internist, cardiologist, and a trained epidemiologist located in Dallas, Texas. He speaks with Bret regarding what a wise response to Covid would look like.\n\nThe McCullough Report: ", "date": "Dec 6, 2021", "views": "470,953 views", "comments": "4,909", "likes": "26,636 likes", "dislikes": " Unavailable", "video_length": 4414.701, "url": "https://www.youtube.com/watch?v=-zg1j7Zquoc"}, "https://www.youtube.com/watch?v=04ZWqOuB45Y": {"title": "Washington DC's New COVID Rule for 12-Year Olds Will Scare You | DM CLIPS | Rubin Report", "content creator": "The Rubin Report", "description": "Dave Rubin of “The Rubin Report” talks about Washington D.C.’s insane new COVID restrictions. Washington D.C.’s mayor Muriel Bowser has issued some of the most insane COVID restrictions yet. In a few days there will be vaccine mandates for anyone older than 12 to enter Washington DC restaurants, coffee shops, and most indoor businesses. These new rules come as the COVID narratives spun by COVID experts like Dr. Fauci and Rochelle Walensky are rapidly collapsing from the reality of the effectiveness of the COVID vaccine at preventing transmission or the reality of comorbidities and COVID deaths.\n\nWatch Dave's FULL DIRECT MESSAGE here:", "date": "Jan 13, 2022", "views": "52,360 views", "comments": "629", "likes": "5,349 likes", "dislikes": " Unavailable", "video_length": 256.941, "url": "https://www.youtube.com/watch?v=04ZWqOuB45Y"}, "https://www.youtube.com/watch?v=7O2FY2dOhHA": {"title": "Judge Blocks Pentagon From Enforcing Vaccine Mandate Against Navy SEALs | Facts Matter", "content creator": "Facts Matter with Roman Balmakov", "description": "🧶 WATCH: How Communist China Manipulates the Narrative  👉 https://ept.ms/3ffk26w\n\nResources\n\n🔥 Epoch TV:", "date": "Premiered Jan 10, 2022", "views": "148,509 views", "comments": "1,888", "likes": "24,374 likes", "dislikes": " Unavailable", "video_length": 1170.521, "url": "https://www.youtube.com/watch?v=7O2FY2dOhHA"}, "https://www.youtube.com/watch?v=n9IxomBusuw": {"title": "Dr. David Sinclair: The Biology of Slowing & Reversing Aging | Huberman Lab Podcast #52", "content creator": "Andrew Huberman", "description": "In this episode, I am joined by Dr. David Sinclair, tenured Professor of Genetics at Harvard Medical School and an expert researcher in the field of longevity. Dr. Sinclair is also the author of the book Lifespan: Why We Age & Why We Don't Have To, and the host of the Lifespan Podcast, which launches January 5, 2022. \n\nIn this interview, we discuss the cellular and molecular mechanisms of aging and what we all can do to slow or reverse the aging process. We discuss fasting and supplementation with resveratrol, NAD, metformin, and NMN. We also discuss the use of caffeine, exercise, cold exposure, and why excessive iron load is bad for us. We discuss food choices for offsetting aging and promoting autophagy (clearance of dead cells). And we discuss the key blood markers everyone should monitor to determine your biological versus chronological age. We also discuss the future of longevity research and technology. This episode includes lots of basic science and specific, actionable protocols, right down to the details of what to do and when. By the end, you will have in-depth knowledge of the biology of aging and how to offset it.\n\nThank you to our sponsors:\nROKA - ", "date": "Dec 27, 2021", "views": "795,378 views", "comments": "2,403", "likes": "25,884 likes", "dislikes": " Unavailable", "video_length": 7842.461, "url": "https://www.youtube.com/watch?v=n9IxomBusuw"}, "https://www.youtube.com/watch?v=WxSfDQum6sM": {"title": "The LARGEST Galaxy In The Universe! | IC 1101", "content creator": "Factnomenal", "description": "The largest currently known galaxy has the generic designation of IC 1101, some 1.045 billion light years from Earth. The nondescript name gives no indication of its incredible size and remarkable features, not to mention what it is hiding in its core.  \n\nHiding is very likely a SLAB, or stupendously large black hole, of gargantuan proportions that may prove to be the largest in the known universe.\n\nWelcome to Factnomenal!  In today’s video we look at the largest galaxy ever found and explore its truly incredible features, including its completely out of proportion dark matter content and the supermassive black hole hiding in its center.  \n\n\nBuy us a coffee to show your support!", "date": "Dec 30, 2021", "views": "397,582 views", "comments": "388", "likes": "5,869 likes", "dislikes": " Unavailable", "video_length": 588.661, "url": "https://www.youtube.com/watch?v=WxSfDQum6sM"}, "https://www.youtube.com/watch?v=DniB09RXO2E": {"title": "I made my own spaceship from styrofoam using a 570cc. engine", "content creator": "NASAT Channel", "description": "Vanguard engine 18hp V-Twin 570cc\n\nWelcome to NASAT Channel!\nI guarantee you won't be disappointed with the uploaded videos as there are some of the best videos that no one has done yet.\nThanks and hope you will enjoy and not be disappointed with your time spent watching my videos.\n \nSupport the channel by subscribing to see more great videos!\nIf you find it interesting, Like, Subscribe and comment on your questions and ideas, the channel will support and make great videos for you.", "date": "Dec 22, 2021", "views": "4,234,713 views", "comments": "2,400", "likes": "38,984 likes", "dislikes": " Unavailable", "video_length": 939.021, "url": "https://www.youtube.com/watch?v=DniB09RXO2E"}, "https://www.youtube.com/watch?v=rMQ5Yc6pJak": {"title": "How to Find the Planets in the Night Sky", "content creator": "Learn the Sky", "description": "Learn how to find the planets in the sky, what their characteristics are, and which planets are invisible to the naked eye. \n\nChapters", "date": "Jan 8, 2022", "views": "34,126 views", "comments": "59", "likes": "795 likes", "dislikes": " Unavailable", "video_length": 1491.101, "url": "https://www.youtube.com/watch?v=rMQ5Yc6pJak"}, "https://www.youtube.com/watch?v=v5BcXZ08z5E": {"title": "Fermi Paradox: The Impossible Earth hypothesis", "content creator": "John Michael Godier", "description": "Is Earth impossible? An exploration of the impossible earth hypothesis and its implications on science and existence.\n\nMy Patreon Page:", "date": "Jan 12, 2022", "views": "124,997 views", "comments": "845", "likes": "6,461 likes", "dislikes": " Unavailable", "video_length": 1385.281, "url": "https://www.youtube.com/watch?v=v5BcXZ08z5E"}, "https://www.youtube.com/watch?v=4tujk8FDP8Q": {"title": "Top 10 All-New Electric Cars on Roads in 2022", "content creator": "Future Lab", "description": "Representing Awesome New Electric Cars 2022\n\n0:00 Intro", "date": "Dec 26, 2021", "views": "438,573 views", "comments": "393", "likes": "4,199 likes", "dislikes": " Unavailable", "video_length": 1278.401, "url": "https://www.youtube.com/watch?v=4tujk8FDP8Q"}, "https://www.youtube.com/watch?v=jvBQuJ8lAuE": {"title": "The Clock Game million dollar winner on The Price is Right", "content creator": "Yoshi Fighter 727", "description": "I like this one because the clock game is my favorite TPIR game along with Plinko #TPIR #Thepriceisright #milliondollarwinner #$1million", "date": "Jan 14, 2021", "views": "284,095 views", "comments": "324", "likes": "2,829 likes", "dislikes": " Unavailable", "video_length": 141.181, "url": "https://www.youtube.com/watch?v=jvBQuJ8lAuE"}, "https://www.youtube.com/watch?v=kNuTdJEVScE": {"title": "Comedian Arsenio Hall wants apology from Jussie Smollett | 10News WTSP", "content creator": "10 Tampa Bay", "description": "On Friday, producers announced they would be removing the \"Empire\" actor from the final two episodes of the season after police say Smollett orchestrated a racist and homophobic attack against himself.\n\nIt’s been a case that has everyone shocked and confused so much so, that Arsenio jokingly said that he would “binge this if this was on Netflix.“", "date": "Feb 22, 2019", "views": "887,868 views", "comments": "3,692", "likes": "13,233 likes", "dislikes": " Unavailable", "video_length": 95.141, "url": "https://www.youtube.com/watch?v=kNuTdJEVScE"}, "https://www.youtube.com/watch?v=bpEmIf4lXL8": {"title": "Gavin McInnes laughs at Betty White and Joan Rivers (GoML Censored TV) 😂", "content creator": "Gavin and friends", "description": "Finally Gavin finds a couple of broads to laugh at. And not in a mean way. \n\nFrom Get off my Lawn on Censored TV. Gavin McInnes and Ryan Katsu-Riveira provide around six hours of high quality entertainment each week for what you would pay for two overpriced coffees. You should consider subscribing so you can enjoy the whole show, including the parts that are not suitable for this platform. \n\n🌎 ", "date": "Jan 13, 2022", "views": "9,054 views", "comments": "37", "likes": "337 likes", "dislikes": " Unavailable", "video_length": 231.201, "url": "https://www.youtube.com/watch?v=bpEmIf4lXL8"}, "https://www.youtube.com/watch?v=95tC328G51Q": {"title": "Dyson: Whites should open individual reparations accounts", "content creator": "Fox News", "description": "Scholar Michael Eric Dyson, author of 'Tears We Cannot Stop: A Sermon to White America,' argues that white people should open individual reparations accounts as atonement for slavery. Tucker wants to know how this would work #Tucker", "date": "Feb 2, 2017", "views": "399,643 views", "comments": "4,843", "likes": "1,809 likes", "dislikes": " Unavailable", "video_length": 353.001, "url": "https://www.youtube.com/watch?v=95tC328G51Q"}, "https://www.youtube.com/watch?v=imdYIdv8F4w": {"title": "Blender 3.0 Beginner Object Editing Tutorial (Donut part 2)", "content creator": "Blender Guru", "description": "Blender tutorial showing you how to add objects and edit them with proportional falloff. Part 2 of the donut series.\n\nWatch Part 3: ", "date": "Dec 2, 2021", "views": "365,874 views", "comments": "687", "likes": "12,456 likes", "dislikes": " Unavailable", "video_length": 1276.261, "url": "https://www.youtube.com/watch?v=imdYIdv8F4w"}, "https://www.youtube.com/watch?v=rpSo4fu1rgM": {"title": "Half in the Bag: The Matrix Resurrections", "content creator": "RedLetterMedia", "description": "Mike and Jay take a little break from tracking down the Omega variant infested Mr. Plinkett to talk about an important contribution to cinema: The Matrix: Resurrections. This episode also marks an important milestone. It's the first time Mike only drank one beer instead of 5 or more. His dementia is in full swing though. Watch this elderly fat ass try to form coherent sentences is like watching a manatee jump rope. Jay does a pretty good job talking about the movie though.", "date": "Dec 31, 2021", "views": "1,447,695 views", "comments": "9,608", "likes": "49,178 likes", "dislikes": " Unavailable", "video_length": 3293.941, "url": "https://www.youtube.com/watch?v=rpSo4fu1rgM"}, "https://www.youtube.com/watch?v=pnmaYPewyB8": {"title": "Melissa Chen: What Americans Don’t Understand About China", "content creator": "JRE Clips", "description": "Taken from JRE #1427 w/Melissa Chen: https://youtu.be/6SLVjWbER4M", "date": "Feb 14, 2020", "views": "5,888,547 views", "comments": "14,600", "likes": "87,503 likes", "dislikes": " Unavailable", "video_length": 305.921, "url": "https://www.youtube.com/watch?v=pnmaYPewyB8"}, "https://www.youtube.com/watch?v=SyAogwZ0PA8": {"title": "Unbelievable ABANDONED Mansion found in the woods. Explore #90", "content creator": "Abandoned Urbex Canada", "description": "Unbelievable ABANDONED Mansion found in the woods. Explore #90\nCanada\n\nThis abandoned Tudor style mansion sits on a very secluded property in northern Ontario, Canada. To my knowledge it was a custom home that was built in the 1980’s. The property is just stunning. Wildlife call this property their home. From deer, ducks to wild turkeys they are everywhere here. There is rolling hills, large pond and beautiful in ground pool. The house is massive, it has 6 bedrooms, 6 bathrooms and 3 kitchens. I couldn’t believe how much stuff was left behind here. Pretty much every room has personal items left behind. This property sits on a few acres and was bought up a few years ago by a developer. It hasn’t been abandoned for very long. From watching the video I found out that there is a large amount of empty water jugs throughout the house. I’m not sure if the water was shut off before the previous owners left or if squatters moved into the house once it was abandoned. \n\nIf you like this video or you would like support my channel, you can buy me a coffee at this link: ", "date": "Jan 8, 2022", "views": "153,313 views", "comments": "684", "likes": "4,246 likes", "dislikes": " Unavailable", "video_length": 1580.781, "url": "https://www.youtube.com/watch?v=SyAogwZ0PA8"}, "https://www.youtube.com/watch?v=mEfgf2GRk3Q": {"title": "Senator Makes a fool of herself. Bill C-16", "content creator": "Wheat King", "description": "Senator makes a fool of herself. Bill C-16", "date": "May 17, 2017", "views": "9,384,404 views", "comments": "19,879", "likes": "143,322 likes", "dislikes": " Unavailable", "video_length": 322.341, "url": "https://www.youtube.com/watch?v=mEfgf2GRk3Q"}, "https://www.youtube.com/watch?v=XSoJqdPi4Iw": {"title": "Funny guy makes Royal Guard Laugh at Buckingham Palace", "content creator": "Mas Pak", "description": "A tourist  makes the un-laughable Cute English Royal Guard  to burst out Laughing, at Buckingham Palace in London(SUBTITLES BELOW)\nSUBTITULOS ABAJO EN ESPAÑOL\n\nCAMERA GUY (CG) yeh you’re allowed to go right up to him, yeh\nJust can’t touch him\nYANKEL: were in this thing together right?\nCG: A little closer\nYANKEL: we were together in school me & him, he went his own way\nJust standing here\nI’m only here for a couple minutes\nCG: so how long do you know this man?\nYANKEL: 30 years\nCG: 30 years you’ve been together, & you’ve been to school where?\nYANKEL: school? Kensington \nCG: you’ve been to Kensington together & eh did you learn martial arts together?\nYANKEL: yes\nI don’t have this nice sword!\nHe was never talkative I remember in school he used to sit by himself & read books, i was just this guy fooling around & having fun, he was just reading, you’d ask him questions he would answer with his head, yeh no yeh no, what’s your name no, what!! it’s not a name shake of a head is not a name, please say your name & by recess you know he’s just this guy hanging out ,him his mother always picked him up from school, you know he’s that type of guy until he was 20 his mother picked him up from school\nCG: Yankel  Yankel dance for the camera Yankel dance for the camera \nYANKEL: uh now he’s walking\n\nUn turista hace estallar la risa de la Real Guardia Real inglesa, riendo, en el Palacio de Buckingham en Londres (SUBTITULOS A CONTINUACIÓN)\n\nCAMERA GUY (CG) si puedes ir directamente a él, yeh\nSimplemente no puedo tocarlo\nYANKEL: estaban en esto juntos ¿verdad?\nCG: un poco más cerca\nYANKEL: estuvimos juntos en la escuela yo y él, él siguió su propio camino\nSolo parado aquí\nSolo estoy aquí por un par de minutos\nCG: ¿cuánto tiempo conoces a este hombre?\nYANKEL: 30 años\nCG: 30 años que has estado juntos, y has estado en la escuela, ¿dónde?\nYANKEL: ¿escuela? Kensington\nCG: has estado en Kensington juntos y eh ¿aprendiste artes marciales juntos?\nYANKEL: sí\n¡No tengo esta bonita espada!\nÉl nunca fue locuaz. Recuerdo que en la escuela solía sentarse solo y leer libros, yo solo era este tipo bromeando y divirtiéndome, él solo estaba leyendo, le hacías preguntas que respondería con su cabeza, yeh no yeh no, ¿cuál es tu nombre? ¡No, qué! no es un nombre lamerse la cabeza no es un nombre, por favor diga su nombre y por el recreo sabrá que es solo este tipo pasando el rato, él su madre siempre lo recogió de la escuela, usted sabe que él es ese tipo de chico hasta que tenía 20 su madre lo recogió de la escuela\nCG: Danza de Yankel Yankel para la cámara Danza de Yankel para la cámara\nYANKEL: ahora él está caminando", "date": "Mar 5, 2014", "views": "76,020,282 views", "comments": "77,259", "likes": "2,090,965 likes", "dislikes": " Unavailable", "video_length": 134.701, "url": "https://www.youtube.com/watch?v=XSoJqdPi4Iw"}, "https://www.youtube.com/watch?v=uOS9cyoz62I": {"title": "Self Defense / Home Defense Airgun Revolver .50", "content creator": "AAR - Andy’s Airgun Reviews", "description": "AAR Merchandise www.aar-onair.com  \nThe Shop www.vector-air.co.uk\nFacebook www.facebook.com/andyairgunreviews \n\nIMPORTANT NOTICE. IMPORTANT NOTICE. IMPORTANT NOTICE. IMPORTANT NOTICE.\nAAR does not endorse or support the use of any weapon for use as self defence, this program is simply to review the products available from manufacturers and any implication of suitability for use as a self defence item is made by the manufacturer and not AAR, or the suppliers or retailers. This is classed as a legal air weapon because it is below 7.5 Joules and the 11 Joules version is NOT legal in the U.K. You must consider and consult the laws in your country/area before considering purchase of any items shown in these videos and consider its intended use. AAR does not and has never recommended or suggested you point or fire any weapon or toy weapon at an individual or use them as any form of self defence item. \n\nAAR channels bring you the latest News and Reviews of products in the world of airguns, air rifles, air pistols, accessories and all things Airgun related.\nBelow are all the links I can recommend for finding out more about the items shown in the video.\nAndy is the Host and a hobby Air gunner and video maker and produces the AAR channels during his spare time. The Production team consists of Andy, Mrs AAR, Karl and Luke. No remuneration is received for the production of these videos. We hope you enjoy the Videos and channels, please always\nshoot safely and within the Laws relating to your country, and please ensure you are respectful of the Law and others at all times.\n\nTheme Music and all Music used in the AAR videos are produced by AAR using non-copyright music loops from Apple Garage Band and are supplied by Apple on a royalty free basis for all to use ", "date": "Jun 17, 2021", "views": "2,479,514 views", "comments": "6,572", "likes": "44,204 likes", "dislikes": " Unavailable", "video_length": 658.741, "url": "https://www.youtube.com/watch?v=uOS9cyoz62I"}, "https://www.youtube.com/watch?v=6Izjz2aEzgs": {"title": "This Is Bad!!! We Have The Biggest Snow Job Tomorrow", "content creator": "Matt's Off Road Recovery", "description": "So I got a build project on the snowcat and I better get it done in one day.\n\nSubscribe  https://www.youtube.com/channel/UCwdV... \n\nOff Road Recovery Videos\nThis Is Bad!!! It’s Cold And We’re Stranded!", "date": "Jan 16, 2022", "views": "760,965 views", "comments": "2,296", "likes": "34,757 likes", "dislikes": " Unavailable", "video_length": 1160.881, "url": "https://www.youtube.com/watch?v=6Izjz2aEzgs"}, "https://www.youtube.com/watch?v=M1F0lBnsnkE": {"title": "Old Movie Stars Dance to Uptown Funk", "content creator": "Nerd Fest UK", "description": "My inspiration came from What's the Mashup? (https://www.youtube.com/watch?v=EmnSm...) but I didn't manage 100! The idea was to do the same for movies from the Golden Age – meaning no title later than 1953 (although there is one at the end.) Oh, and none of these clips was sped up or slowed down.\n\nTurn on subtitles to find out the film names.\n\nPS. I write books as well. Here's two very reasonably priced ones about movies:", "date": "Oct 6, 2015", "views": "63,113,332 views", "comments": "27,240", "likes": "490,262 likes", "dislikes": " Unavailable", "video_length": 292.341, "url": "https://www.youtube.com/watch?v=M1F0lBnsnkE"}, "https://www.youtube.com/watch?v=tY-IYY0yJdE": {"title": "Reporters asking stupid questions to ELON MUSK for 2 minutes straight", "content creator": "Absurd 3D World", "description": "Elon does fire some classy replies.", "date": "Jan 15, 2019", "views": "8,637,767 views", "comments": "8,440", "likes": "163,319 likes", "dislikes": " Unavailable", "video_length": 129.861, "url": "https://www.youtube.com/watch?v=tY-IYY0yJdE"}, "https://www.youtube.com/watch?v=XNN1Hbg9oNU": {"title": "Harrison Ford Breaks Down His Career, from 'Star Wars' to 'Indiana Jones' | Vanity Fair", "content creator": "Vanity Fair", "description": "Harrison Ford walks us through his legendary career, discussing his roles in ‘Dead Heat on a Merry-Go Round,’ ‘Star Wars,’ ‘Raiders of the Lost Ark,’ ‘Indiana Jones,’ ’Blade Runner,’ ‘Witness,’ ‘The Mosquito Coast,’ ‘Frantic,’ ‘Working Girl,’ ‘The Devil’s Own,’ ‘Patriot Games,’ ‘The Fugitive,’ ‘What Lies Beneath,’ ‘Morning Glory,’ ‘The Call of the Wild' and more.\n\nSee Harrison Ford in 'The Call of The Wild,' in theaters now!\n\nStill haven’t subscribed to Vanity Fair on YouTube? ►► ", "date": "Feb 27, 2020", "views": "3,511,769 views", "comments": "5,435", "likes": "89,550 likes", "dislikes": " Unavailable", "video_length": 1360.861, "url": "https://www.youtube.com/watch?v=XNN1Hbg9oNU"}, "https://www.youtube.com/watch?v=t705r8ICkRw": {"title": "Starbase Tour with Elon Musk [PART 1]", "content creator": "Everyday Astronaut", "description": "Join me as I take a tour of SpaceX's Starbase facility with Elon Musk as our tour guide! This is part 1 of 3, so stay tuned, there's a lot more coming!\n\nIf you need some notes on this video with key points, check out our article - ", "date": "Aug 3, 2021", "views": "4,478,235 views", "comments": "16,820", "likes": "200,389 likes", "dislikes": " Unavailable", "video_length": 3196.761, "url": "https://www.youtube.com/watch?v=t705r8ICkRw"}, "https://www.youtube.com/watch?v=yAZFFrisoD4": {"title": "Otto Octavius Demonstrates His Mechanical Arms - The Fusion Accident Scene - Spider-Man 2 (2004)", "content creator": "TopMovieClips", "description": "Doctor Octopus/Doc Ock/Otto Octavius (Alfred Molina) Demonstrates his Mechanical Arms/Tentacles - The Fusion Accident Scene - Spider-Man 2 (2004) Movie CLIP HD\n\nTM & © Sony (2004)\nFair use.\nCopyright Disclaimer Under Section 107 of the Copyright Act 1976, allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use. No copyright infringement intended.", "date": "Dec 18, 2021", "views": "10,630,829 views", "comments": "3,213", "likes": "106,885 likes", "dislikes": " Unavailable", "video_length": 157.021, "url": "https://www.youtube.com/watch?v=yAZFFrisoD4"}, "https://www.youtube.com/watch?v=LEBGl8MVE-c": {"title": "Heart risk after vaccines", "content creator": "Dr. John Campbell", "description": "Does the risk of a heart attack increase from 11% up to 25% \nAbstract 10712: Mrna COVID Vaccines Dramatically Increase Endothelial Inflammatory Markers and ACS Risk as Measured by the PULS Cardiac Test: a Warning (8th November)", "date": "Nov 25, 2021", "views": "2,467,683 views", "comments": "20,650", "likes": "59,913 likes", "dislikes": " Unavailable", "video_length": 1455.321, "url": "https://www.youtube.com/watch?v=LEBGl8MVE-c"}, "https://www.youtube.com/watch?v=ggAT0FWbSxM": {"title": "Opening up for our sector is a priority: Dr S Somanath, Chairman, ISRO | Space News | India", "content creator": "WION", "description": "Eminent aerospace engineer and rocket scientist Dr S Somanath was been appointed as the new chairman of Indian Space Research Organisation (ISRO) a few days ago. He was also appointed as Secretary of the Department of Space for a joint tenure of three years. He succeeded Kailasavadivoo Sivan as the occupant of the position. WION spoke to Dr S Somanath on his new role and his top priorities as the Chairman of ISRO.", "date": "Jan 16, 2022", "views": "36,674 views", "comments": "294", "likes": "1,105 likes", "dislikes": " Unavailable", "video_length": 350.061, "url": "https://www.youtube.com/watch?v=ggAT0FWbSxM"}, "https://www.youtube.com/watch?v=whZsut9LmvU": {"title": "Dwyane Wade Shocks Crowd In Last Minutes Of His FINAL MIAMI HEAT GAME! Heat vs Sixers", "content creator": "CliveNBAParody", "description": "Dwyane Wade Last & Final Game To End His NBA Career Is Shocking As He Shows He's Still One Of The Best! Heat vs Sixers April 9, 2019 NBA Season \n\n警告：視頻禁止轉載！！！\n警告：視頻禁止轉載！！！\n------(All clips property of the NBA. No copyright infringement is intended. All videos are edited to follow the \"Free Use\" guideline of YouTube------\n\nInstagram: ", "date": "Apr 9, 2019", "views": "15,621,085 views", "comments": "4,427", "likes": "81,555 likes", "dislikes": " Unavailable", "video_length": 641.641, "url": "https://www.youtube.com/watch?v=whZsut9LmvU"}, "https://www.youtube.com/watch?v=G9KDm2svb1Q": {"title": "Pierre Poilievre Nearly Losses His Patience with Reporter during Press Conference", "content creator": "Ima Stoner", "description": "Pierre Poilievre answers media questions.\nPress Conference highlights from Dec12th 2021", "date": "Dec 12, 2021", "views": "320,878 views", "comments": "2,140", "likes": "9,101 likes", "dislikes": " Unavailable", "video_length": 251.941, "url": "https://www.youtube.com/watch?v=G9KDm2svb1Q"}, "https://www.youtube.com/watch?v=UijQ-6jhVuc": {"title": "Doctor Dies After Getting COVID Vaccine? Post Vaccine Deaths", "content creator": "Doctor Mike Hansen", "description": "Doctor Dies After Getting COVID Vaccine? Post Vaccine Deaths\n\nAn Obstetrician / Gynecologist | Dr. Gregory Michael in Miami, Florida, received the 1st dose of the Pfizer vaccine on Dec.18th. Shortly after receiving the Pfizer vaccine, he reportedly developed acute immune thrombocytopenia. Unfortunately, he died 16 days after getting the covid vaccine. Dr. Gregory Michael's cause of death results from a brain hemorrhage. Obviously, this is horrible. It's tragic, and you feel for his family. \n\n---------------------------------------------------------\nDoctor Mike Hansen's Programs ⏩ \nFULL Course for MORE ENERGY:", "date": "Jan 20, 2021", "views": "5,535,563 views", "comments": "21,098", "likes": "79,617 likes", "dislikes": " Unavailable", "video_length": 500.281, "url": "https://www.youtube.com/watch?v=UijQ-6jhVuc"}, "https://www.youtube.com/watch?v=j0mOA1KAZME": {"title": "The Nazi Officer's Wife", "content creator": "Niky Dimitrov", "description": "The Nazi Officer's Wife: How One Jewish Woman Survived the Holocaust is a 1999 autobiography by Austrian-born Edith Hahn-Beer. Written with the help of Susan Dworkin, the book's first edition was published by Rob Weibach Books and William Morrow and Company. A documentary film based on the source material and starring Hahn-Beer herself was released in 2003.", "date": "Oct 31, 2015", "views": "2,891,561 views", "comments": "3,486", "likes": "23,011 likes", "dislikes": " Unavailable", "video_length": 5845.661, "url": "https://www.youtube.com/watch?v=j0mOA1KAZME"}, "https://www.youtube.com/watch?v=gxy6rHlOVDw": {"title": "Prosecutor on Trump finally getting CHARGED (interview with Glenn Kirschner)", "content creator": "Brian Tyler Cohen", "description": "INTERVIEW: Brian interviews former prosecutor @Glenn Kirschner about the speed of the January 6 investigation and if we can expect those who incited the insurrection, including Donald Trump, to be charged.\n\nLISTEN TO FULL PODCAST EPISODE HERE:\nApple Podcasts: ", "date": "Jan 12, 2022", "views": "368,269 views", "comments": "2,186", "likes": "20,050 likes", "dislikes": " Unavailable", "video_length": 927.781, "url": "https://www.youtube.com/watch?v=gxy6rHlOVDw"}, "https://www.youtube.com/watch?v=SVjMzrCMW9Q": {"title": "Gran Torino - Spooks _HD", "content creator": "Alec McRae", "description": "Gran Torino spooks", "date": "Jan 10, 2009", "views": "7,928,751 views", "comments": "8,322", "likes": "56,375 likes", "dislikes": " Unavailable", "video_length": 131.261, "url": "https://www.youtube.com/watch?v=SVjMzrCMW9Q"}, "https://www.youtube.com/watch?v=xWtfo9kuRTU": {"title": "Skyrim Exploration Suite", "content creator": "TheSagaris2", "description": "Credit goes to the composer of the incredible Skyrim soundtrack, Jeremy Soule.\n\nI have been slowly working on this over the past few weeks as I realised not long ago how beautifully the atmospheric and ambient sounds of Skyrim flow with the calmer exploration pieces from the game's soundtrack. I thought it was about time that a large relaxing suite was created for Skyrim. And it seems like this is an appropriate celebration of Skyrim as the Special Edition was only just revealed. I hope you enjoy!", "date": "Jun 15, 2016", "views": "8,311,114 views", "comments": "3,888", "likes": "80,518 likes", "dislikes": " Unavailable", "video_length": 6477.301, "url": "https://www.youtube.com/watch?v=xWtfo9kuRTU"}, "https://www.youtube.com/watch?v=czs0_I3-NNE": {"title": "Will Russia Invade Ukraine? And Can They Win?", "content creator": "Covert Cabal", "description": "Download the free Ground News app at https://ground.news/covertcabal to compare more than 50,000 news sources. By threading multiple perspectives from thousands of publications through a neutral platform, Ground News frees people from algorithmic restraints, illuminates blindspots and makes media bias explicit.\n\nFor Business Inquiries - CovertCabal@Ellify.com\n\nAmazon Prime 30 Free Trial - ", "date": "Dec 13, 2021", "views": "265,415 views", "comments": "2,943", "likes": "9,243 likes", "dislikes": " Unavailable", "video_length": 602.361, "url": "https://www.youtube.com/watch?v=czs0_I3-NNE"}, "https://www.youtube.com/watch?v=sSr2DsZfKSw": {"title": "Inside Comedian Gabriel Iglesias' $3 Million Volkswagen Bus Collection", "content creator": "Business Insider", "description": "Fluffy comedian Gabriel Iglesias owns a $3 million collection of classic Volkswagen Buses. He keeps them in his enormous personal museum that resembles Volkswagen's most famous German factory. His car collection also includes several very rare Beetles and muscle cars.\n\nFor more, visit:", "date": "Aug 11, 2019", "views": "7,716,472 views", "comments": "4,672", "likes": "85,066 likes", "dislikes": " Unavailable", "video_length": 335.781, "url": "https://www.youtube.com/watch?v=sSr2DsZfKSw"}, "https://www.youtube.com/watch?v=CqFiucWKo-8": {"title": "Strain Hunters India Expedition (FULL HD MOVIE)", "content creator": "Green House Seed Co", "description": "For educational purposes only.\n\nVisit http://www.strainhunters.com", "date": "Oct 17, 2010", "views": "7,929,970 views", "comments": "585", "likes": "40,236 likes", "dislikes": " Unavailable", "video_length": 3531.101, "url": "https://www.youtube.com/watch?v=CqFiucWKo-8"}, "https://www.youtube.com/watch?v=ZXsvWeZdfjg": {"title": "VIDEO: Keanu Reeves Handles Home Invasion by Himself", "content creator": "MaryS Brown", "description": "Keanu Reeves' house was reportedly broken into by a middle-aged fan who was eventually apprehended by authorities for a psych evaluation.\nKeanu Reeves' house was reportedly broken into by a middle-aged fan who was eventually apprehended by authorities for a psych evaluation.\nKeanu Reeves' house was reportedly broken into by a middle-aged fan who was eventually apprehended by authorities for a psych evaluation.\n\n                        \n                                \n                            \n                        VIDEO: Keanu Reeves Handles Home Invasion by Himself \n                                \n\n                        \n                                \n                            \n                        VIDEO: Keanu Reeves Handles Home Invasion by Himself \n                                \n\n                        \n                                \n                            \n                        VIDEO: Keanu Reeves Handles Home Invasion by Himself", "date": "Sep 19, 2014", "views": "522,951 views", "comments": "180", "likes": "3,325 likes", "dislikes": " Unavailable", "video_length": 66.581, "url": "https://www.youtube.com/watch?v=ZXsvWeZdfjg"}, "https://www.youtube.com/watch?v=7ZwydHahCvQ": {"title": "Chris Evans Being A Gentleman", "content creator": "LIVE and Fan", "description": "--------------------------------------------------------\nif you are interested in programming (python) 👇\n\non this channel I solve problems with leetcode and create unique games and programs on python\n👇👇👇👇👇", "date": "Jun 9, 2020", "views": "387,851 views", "comments": "170", "likes": "4,892 likes", "dislikes": " Unavailable", "video_length": 55.761, "url": "https://www.youtube.com/watch?v=7ZwydHahCvQ"}, "https://www.youtube.com/watch?v=0pn2bwa2zZc": {"title": "Congresswoman Tries to Call Ben Shapiro Racist...Regrets it Immediately.", "content creator": "Ben Shapiro", "description": "Congresswoman Tries to Call Ben Shapiro Racist...Regrets it Immediately.", "date": "Mar 22, 2020", "views": "15,373,664 views", "comments": "36,389", "likes": "341,730 likes", "dislikes": " Unavailable", "video_length": 189.601, "url": "https://www.youtube.com/watch?v=0pn2bwa2zZc"}, "https://www.youtube.com/watch?v=s9boOxtFSCI": {"title": "I Talk to Strangers in Japan’s MOST UNFRIENDLY City: You Won’t Believe what Happens", "content creator": "Oriental Pearl", "description": "All over YouTube there are countless videos saying Japan doesn't like foreigners. How true is that? Tokyo is domestically known to be Japan's most unfriendly city. People in Tokyo are said to be cold to foreigners and Japanese people alike. Today I walked around the backstreets of Tokyo talking to strangers in Japanese. You will be surprised what happened.\n\nJAPANESE LESSONS: ", "date": "Jan 11, 2021", "views": "632,120 views", "comments": "1,412", "likes": "15,511 likes", "dislikes": " Unavailable", "video_length": 531.121, "url": "https://www.youtube.com/watch?v=s9boOxtFSCI"}, "https://www.youtube.com/watch?v=CcvMO_4mJ2E": {"title": "Kamala is a Joke 🤣 #Shorts", "content creator": "Sjw Triggered", "description": "#Shorts", "date": "Jan 15, 2022", "views": "99,477 views", "comments": "759", "likes": "4,184 likes", "dislikes": " Unavailable", "video_length": 56.881, "url": "https://www.youtube.com/watch?v=CcvMO_4mJ2E"}, "https://www.youtube.com/watch?v=2ea8xAa0JI4": {"title": "Injured Fawn Deer In Rocky Mountains Gets Adopted | The Dodo Faith = Restored", "content creator": "The Dodo", "description": "This guy brought an injured baby deer into his house and became her dad 😍\n\nSpecial thanks to Darius Sasnauskas for giving this deer a second chance; learn more about his wildlife rescues on Youtube:  ", "date": "Feb 12, 2020", "views": "7,708,719 views", "comments": "4,868", "likes": "165,223 likes", "dislikes": " Unavailable", "video_length": 307.401, "url": "https://www.youtube.com/watch?v=2ea8xAa0JI4"}, "https://www.youtube.com/watch?v=_TG8Yxn7OA4": {"title": "In Loving Memory of Chris Cuomo's Career", "content creator": "Mark Dice", "description": "🚨  Order your SHIRTS here ➜ teespring.com/stores/MarkDice ⬅\n\nGet Free Shipping this weekend by using the promo code SANTA at the checkout (U.S. only)   \n\n⚠️  Order your \"F_ck Joe Biden\" shirt here: ", "date": "Dec 5, 2021", "views": "359,656 views", "comments": "5,354", "likes": "53,359 likes", "dislikes": " Unavailable", "video_length": 327.821, "url": "https://www.youtube.com/watch?v=_TG8Yxn7OA4"}, "https://www.youtube.com/watch?v=sTd6IzkA7yM": {"title": "Don Jr and Ivanka Have This AMAZING Response to NY Attorney General Subpoena", "content creator": "The Next News Network", "description": "Melt Away Body Fat Today With Keto Elevate\nhttp://ketowithgary.com\nGet 51% OFF By Clicking The Link Above ^^^\n\nGet more at ", "date": "Jan 5, 2022", "views": "48,445 views", "comments": "932", "likes": "6,154 likes", "dislikes": " Unavailable", "video_length": 426.221, "url": "https://www.youtube.com/watch?v=sTd6IzkA7yM"}, "https://www.youtube.com/watch?v=Y_zfNYxmS0E": {"title": "Nancy Pelosi confronted by ‘Let’s go Brandon’ chanting", "content creator": "Sky News Australia", "description": "House Speaker Nancy Pelosi has been confronted mid-speech at an infrastructure event in San Francisco by an anti-Biden voter yelling “let’s go Brandon”.", "date": "Dec 20, 2021", "views": "285,593 views", "comments": "2,190", "likes": "14,224 likes", "dislikes": " Unavailable", "video_length": 97.281, "url": "https://www.youtube.com/watch?v=Y_zfNYxmS0E"}, "https://www.youtube.com/watch?v=S16OXQJ8hcw": {"title": "Yeah, that worked 🇫🇷", "content creator": "Carl Vernon", "description": "Exclusive content: https://www.carlvernon.com\nOrder your t-shirt: teespring.com/stores/official-carl-ve...\nPaypal tip: https://paypal.me/officialcarlvernon", "date": "Jan 10, 2022", "views": "232,754 views", "comments": "2,590", "likes": "15,029 likes", "dislikes": " Unavailable", "video_length": 53.901, "url": "https://www.youtube.com/watch?v=S16OXQJ8hcw"}, "https://www.youtube.com/watch?v=VspjfNMPHyc": {"title": "Is It Time To Get Over Slavery? Black Liberals vs Black Conservatives | Middle Ground", "content creator": "Jubilee", "description": "Thanks to Skillshare for sponsoring this video! The first 1000 people to use this link will get a 2 month free trial of Skillshare Premium Membership: https://skl.sh/jubilee5", "date": "Apr 3, 2020", "views": "5,138,811 views", "comments": "57,218", "likes": "161,536 likes", "dislikes": " Unavailable", "video_length": 1554.121, "url": "https://www.youtube.com/watch?v=VspjfNMPHyc"}, "https://www.youtube.com/watch?v=A88wLvujGkQ": {"title": "The Fast & Furious Car Guy Answers Car Questions From Twitter | Tech Support | WIRED", "content creator": "WIRED", "description": "Dennis McCarthy, the man behind all of the cars from the Fast and the Furious franchise, uses the power of Twitter to answer the internet's burning questions about cars. How many cars have they destroyed filming the Fast and the Furious franchise? What's the point of spoilers on cars? Why do people rev their engines? What's better, a low-rider or a muscle car? Dennis answers all these questions and much more.\n\nF9 is in theaters June 25, ", "date": "Jun 23, 2021", "views": "1,330,613 views", "comments": "1,991", "likes": "41,919 likes", "dislikes": " Unavailable", "video_length": 1295.681, "url": "https://www.youtube.com/watch?v=A88wLvujGkQ"}}